espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DIEPTXF3_REG register
 *  Device IN Endpoint Transmit FIFO Size Register
 */
#define USB_DIEPTXF3_REG (SOC_DPORT_USB_BASE + 0x10c)
/** USB_INEP3TXFSTADDR : R/W; bitpos: [16:0]; default: 512;
 *  IN Endpoint FIFOn Transmit RAM Start Address.
 */
#define USB_INEP3TXFSTADDR    0x0000FFFF
#define USB_INEP3TXFSTADDR_M  (USB_INEP3TXFSTADDR_V << USB_INEP3TXFSTADDR_S)
#define USB_INEP3TXFSTADDR_V  0x0000FFFF
#define USB_INEP3TXFSTADDR_S  0
/** USB_INEP3TXFDEP : R/W; bitpos: [32:16]; default: 4096;
 *  IN Endpoint TxFIFO Depth
 */
#define USB_INEP3TXFDEP    0x0000FFFF
#define USB_INEP3TXFDEP_M  (USB_INEP3TXFDEP_V << USB_INEP3TXFDEP_S)
#define USB_INEP3TXFDEP_V  0x0000FFFF
#define USB_INEP3TXFDEP_S  16


/** USB_DIEPTXF4_REG register
 *  Device IN Endpoint Transmit FIFO Size Register
 */
#define USB_DIEPTXF4_REG (SOC_DPORT_USB_BASE + 0x110)
/** USB_INEP4TXFSTADDR : R/W; bitpos: [16:0]; default: 512;
 *  IN Endpoint FIFOn Transmit RAM Start Address.
 */
#define USB_INEP4TXFSTADDR    0x0000FFFF
#define USB_INEP4TXFSTADDR_M  (USB_INEP4TXFSTADDR_V << USB_INEP4TXFSTADDR_S)
#define USB_INEP4TXFSTADDR_V  0x0000FFFF
#define USB_INEP4TXFSTADDR_S  0
/** USB_INEP4TXFDEP : R/W; bitpos: [32:16]; default: 4096;
 *  IN Endpoint TxFIFO Depth
 */
#define USB_INEP4TXFDEP    0x0000FFFF
#define USB_INEP4TXFDEP_M  (USB_INEP4TXFDEP_V << USB_INEP4TXFDEP_S)
#define USB_INEP4TXFDEP_V  0x0000FFFF
#define USB_INEP4TXFDEP_S  16


/** USB_HCFG_REG register
 *  Host Configuration Register
 */
#define USB_HCFG_REG (SOC_DPORT_USB_BASE + 0x400)
/** USB_H_FSLSPCLKSEL : R/W; bitpos: [2:0]; default: 0;
 *  0x0 : PHY clock is running at 30/60 MHz
 *  0x1 : PHY clock is running at 48 MHz
 *  0x2 : PHY clock is running at 6 MHz
 */
#define USB_H_FSLSPCLKSEL    0x00000003
#define USB_H_FSLSPCLKSEL_M  (USB_H_FSLSPCLKSEL_V << USB_H_FSLSPCLKSEL_S)
#define USB_H_FSLSPCLKSEL_V  0x00000003
#define USB_H_FSLSPCLKSEL_S  0
/** USB_H_FSLSSUPP : R/W; bitpos: [2]; default: 0;
 *  FS- and LS-Only Support
 *  1'b0: HS/FS/LS, based on the maximum speed supported by the connected device
 *  1'b1: FS/LS-only, even If the connected device can support HS
 */
#define USB_H_FSLSSUPP    (BIT(2))
#define USB_H_FSLSSUPP_M  (USB_H_FSLSSUPP_V << USB_H_FSLSSUPP_S)
#define USB_H_FSLSSUPP_V  0x00000001
#define USB_H_FSLSSUPP_S  2
/** USB_H_ENA32KHZS : R/W; bitpos: [7]; default: 0;
 *  1'b0:32 KHz Suspend mode disabled
 *  1'b1:32 KHz Suspend mode enabled
 */
#define USB_H_ENA32KHZS    (BIT(7))
#define USB_H_ENA32KHZS_M  (USB_H_ENA32KHZS_V << USB_H_ENA32KHZS_S)
#define USB_H_ENA32KHZS_V  0x00000001
#define USB_H_ENA32KHZS_S  7
/** USB_H_DESCDMA : R/W; bitpos: [23]; default: 0;
 *  GAHBCFG_REG.USB_DMAEN=0,HCFG_REG.USB_DESCDMA=0 => Slave mode
 *  GAHBCFG_REG.USB_DMAEN=0,HCFG_REG.USB_DESCDMA=1 => Invalid
 *  GAHBCFG_REG.USB_DMAEN=1,HCFG_REG.USB_DESCDMA=0 => Buffered DMA
 *  GAHBCFG_REG.USB_DMAEN=1,HCFG_REG.USB_DESCDMA=1 => Scatter/Gather DMA mode
 */
#define USB_H_DESCDMA    (BIT(23))
#define USB_H_DESCDMA_M  (USB_H_DESCDMA_V << USB_H_DESCDMA_S)
#define USB_H_DESCDMA_V  0x00000001
#define USB_H_DESCDMA_S  23
/** USB_H_FRLISTEN : R/W; bitpos: [26:24]; default: 0;
 *  Frame List Entries
 *  2'b00: 8 Entries
 *  2'b01: 16 Entries
 *  2'b10: 32 Entries
 *  2'b11: 64 Entries
 */
#define USB_H_FRLISTEN    0x00000003
#define USB_H_FRLISTEN_M  (USB_H_FRLISTEN_V << USB_H_FRLISTEN_S)
#define USB_H_FRLISTEN_V  0x00000003
#define USB_H_FRLISTEN_S  24
/** USB_H_PERSCHEDENA : R/W; bitpos: [26]; default: 0;
 *  0x0 (DISABLED): Disables periodic scheduling within the core
 *  0x1 (ENABLED): Enables periodic scheduling within the core
 */
#define USB_H_PERSCHEDENA    (BIT(26))
#define USB_H_PERSCHEDENA_M  (USB_H_PERSCHEDENA_V << USB_H_PERSCHEDENA_S)
#define USB_H_PERSCHEDENA_V  0x00000001
#define USB_H_PERSCHEDENA_S  26
/** USB_H_MODECHTIMEN : R/W; bitpos: [31]; default: 0;
 *  Mode Change Ready Timer Enable,
 *  1'b0 : The Host core waits for either 200 PHY clock cycles or a linestate of SE0 at
 *  the end of resume to the change the opmode from 2'b10 to 2'b00.
 *  1'b1 : The Host core waits only for a linstate of SE0 at the end of resume to
 *  change the opmode from 2'b10 to 2'b00.
 */
#define USB_H_MODECHTIMEN    (BIT(31))
#define USB_H_MODECHTIMEN_M  (USB_H_MODECHTIMEN_V << USB_H_MODECHTIMEN_S)
#define USB_H_MODECHTIMEN_V  0x00000001
#define USB_H_MODECHTIMEN_S  31


/** USB_HFIR_REG register
 *  Host Frame Interval Register
 */
#define USB_HFIR_REG (SOC_DPORT_USB_BASE + 0x404)
/** USB_FRINT : R/W; bitpos: [16:0]; default: 6103;
 *  Frame Interval .  1 ms * (PHY clock frequency for FS/LS)
 */
#define USB_FRINT    0x0000FFFF
#define USB_FRINT_M  (USB_FRINT_V << USB_FRINT_S)
#define USB_FRINT_V  0x0000FFFF
#define USB_FRINT_S  0
/** USB_HFIRRLDCTRL : R/W; bitpos: [16]; default: 0;
 *  Reload Control
 *  1'b0 : The HFIR cannot be reloaded dynamically
 *  1'b1: the HFIR can be dynamically reloaded during runtime
 */
#define USB_HFIRRLDCTRL    (BIT(16))
#define USB_HFIRRLDCTRL_M  (USB_HFIRRLDCTRL_V << USB_HFIRRLDCTRL_S)
#define USB_HFIRRLDCTRL_V  0x00000001
#define USB_HFIRRLDCTRL_S  16


/** USB_HFLBADDR_REG register
 *  Host Frame List Base Address Register
 */
#define USB_HFLBADDR_REG (SOC_DPORT_USB_BASE + 0x41c)
/** USB_HFLBADDR : R/W; bitpos: [32:0]; default: 0;
 *  The starting address of the Frame list. This register is used only for Isochronous
 *  and Interrupt Channels.
 */
#define USB_HFLBADDR    0xFFFFFFFF
#define USB_HFLBADDR_M  (USB_HFLBADDR_V << USB_HFLBADDR_S)
#define USB_HFLBADDR_V  0xFFFFFFFF
#define USB_HFLBADDR_S  0


/** USB_HPRT_REG register
 *  Host Port Control and Status Register
 */
#define USB_HPRT_REG (SOC_DPORT_USB_BASE + 0x440)
/** USB_PRTCONNSTS : RO; bitpos: [0]; default: 0;
 *  Port Connect Status
 *  0x0: No device is attached to the port
 *  0x1: A device is attached to the port
 */
#define USB_PRTCONNSTS    (BIT(0))
#define USB_PRTCONNSTS_M  (USB_PRTCONNSTS_V << USB_PRTCONNSTS_S)
#define USB_PRTCONNSTS_V  0x00000001
#define USB_PRTCONNSTS_S  0
/** USB_PRTCONNDET : R/W; bitpos: [1]; default: 0;
 *  Port Connect Detected.
 *  0x1 : Device connection detected.
 *  0x0 : No device connection detected.
 */
#define USB_PRTCONNDET    (BIT(1))
#define USB_PRTCONNDET_M  (USB_PRTCONNDET_V << USB_PRTCONNDET_S)
#define USB_PRTCONNDET_V  0x00000001
#define USB_PRTCONNDET_S  1
/** USB_PRTENA : R/W; bitpos: [2]; default: 0;
 *  Port Enable
 *  1'b0: Port disabled
 *  1'b1: Port enabled
 */
#define USB_PRTENA    (BIT(2))
#define USB_PRTENA_M  (USB_PRTENA_V << USB_PRTENA_S)
#define USB_PRTENA_V  0x00000001
#define USB_PRTENA_S  2
/** USB_PRTENCHNG : R/W; bitpos: [3]; default: 0;
 *  Port Enable/Disable Change
 *  0x0 : Port Enable bit 2 has not changed
 *  0x1 : Port Enable bit 2 changed
 */
#define USB_PRTENCHNG    (BIT(3))
#define USB_PRTENCHNG_M  (USB_PRTENCHNG_V << USB_PRTENCHNG_S)
#define USB_PRTENCHNG_V  0x00000001
#define USB_PRTENCHNG_S  3
/** USB_PRTOVRCURRACT : RO; bitpos: [4]; default: 0;
 *  Port Overcurrent Active
 *  1'b0: No overcurrent condition
 *  1'b1: Overcurrent condition
 */
#define USB_PRTOVRCURRACT    (BIT(4))
#define USB_PRTOVRCURRACT_M  (USB_PRTOVRCURRACT_V << USB_PRTOVRCURRACT_S)
#define USB_PRTOVRCURRACT_V  0x00000001
#define USB_PRTOVRCURRACT_S  4
/** USB_PRTOVRCURRCHNG : R/W; bitpos: [5]; default: 0;
 *  Port Overcurrent Change
 *  0x0: Status of port overcurrent status is not changed
 *  0x1: Status of port overcurrent changed
 */
#define USB_PRTOVRCURRCHNG    (BIT(5))
#define USB_PRTOVRCURRCHNG_M  (USB_PRTOVRCURRCHNG_V << USB_PRTOVRCURRCHNG_S)
#define USB_PRTOVRCURRCHNG_V  0x00000001
#define USB_PRTOVRCURRCHNG_S  5
/** USB_PRTRES : R/W; bitpos: [6]; default: 0;
 *  Port Resume
 *  1'b0: No resume driven
 *  1'b1: Resume driven
 */
#define USB_PRTRES    (BIT(6))
#define USB_PRTRES_M  (USB_PRTRES_V << USB_PRTRES_S)
#define USB_PRTRES_V  0x00000001
#define USB_PRTRES_S  6
/** USB_PRTSUSP : R/W; bitpos: [7]; default: 0;
 *  Port Suspend
 *  1'b0: Port not in Suspend mode
 *  1'b1: Port in Suspend mode
 */
#define USB_PRTSUSP    (BIT(7))
#define USB_PRTSUSP_M  (USB_PRTSUSP_V << USB_PRTSUSP_S)
#define USB_PRTSUSP_V  0x00000001
#define USB_PRTSUSP_S  7
/** USB_PRTRST : R/W; bitpos: [8]; default: 0;
 *  Port Reset.
 *  1'b0: Port not in reset
 *  1'b1: Port in reset
 */
#define USB_PRTRST    (BIT(8))
#define USB_PRTRST_M  (USB_PRTRST_V << USB_PRTRST_S)
#define USB_PRTRST_V  0x00000001
#define USB_PRTRST_S  8
/** USB_PRTLNSTS : RO; bitpos: [12:10]; default: 0;
 *  Port Line Status
 *  Bit [10]: Logic level of D+
 *  Bit [11]: Logic level of D-
 */
#define USB_PRTLNSTS    0x00000003
#define USB_PRTLNSTS_M  (USB_PRTLNSTS_V << USB_PRTLNSTS_S)
#define USB_PRTLNSTS_V  0x00000003
#define USB_PRTLNSTS_S  10
/** USB_PRTPWR : R/W; bitpos: [12]; default: 0;
 *  Port Power
 *  1'b0: Power off
 *  1'b1: Power on
 */
#define USB_PRTPWR    (BIT(12))
#define USB_PRTPWR_M  (USB_PRTPWR_V << USB_PRTPWR_S)
#define USB_PRTPWR_V  0x00000001
#define USB_PRTPWR_S  12
/** USB_PRTTSTCTL : R/W; bitpos: [17:13]; default: 0;
 *  Port Test Control
 *  4'b0000: Test mode disabled
 *  4'b0001: Test_J mode
 *  4'b0010: Test_K mode
 *  4'b0011: Test_SE0_NAK mode
 *  4'b0100: Test_Packet mode
 *  4'b0101: Test_Force_Enable
 *  Others: Reserved
 */
#define USB_PRTTSTCTL    0x0000000F
#define USB_PRTTSTCTL_M  (USB_PRTTSTCTL_V << USB_PRTTSTCTL_S)
#define USB_PRTTSTCTL_V  0x0000000F
#define USB_PRTTSTCTL_S  13
/** USB_PRTSPD : RO; bitpos: [19:17]; default: 0;
 *  Port Speed
 *  2'b00: High speed
 *  2'b01: Full speed
 *  2'b10: Low speed
 *  2'b11: Reserved
 */
#define USB_PRTSPD    0x00000003
#define USB_PRTSPD_M  (USB_PRTSPD_V << USB_PRTSPD_S)
#define USB_PRTSPD_V  0x00000003
#define USB_PRTSPD_S  17


/** USB_HCCHAR0_REG register
 *  Host Channel 0 Characteristics Register
 */
#define USB_HCCHAR0_REG (SOC_DPORT_USB_BASE + 0x500)
/** USB_H_MPS0 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS0    0x000007FF
#define USB_H_MPS0_M  (USB_H_MPS0_V << USB_H_MPS0_S)
#define USB_H_MPS0_V  0x000007FF
#define USB_H_MPS0_S  0
/** USB_H_EPNUM0 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM0    0x0000000F
#define USB_H_EPNUM0_M  (USB_H_EPNUM0_V << USB_H_EPNUM0_S)
#define USB_H_EPNUM0_V  0x0000000F
#define USB_H_EPNUM0_S  11
/** USB_H_EPDIR0 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR0    (BIT(15))
#define USB_H_EPDIR0_M  (USB_H_EPDIR0_V << USB_H_EPDIR0_S)
#define USB_H_EPDIR0_V  0x00000001
#define USB_H_EPDIR0_S  15
/** USB_H_LSPDDEV0 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV0    (BIT(17))
#define USB_H_LSPDDEV0_M  (USB_H_LSPDDEV0_V << USB_H_LSPDDEV0_S)
#define USB_H_LSPDDEV0_V  0x00000001
#define USB_H_LSPDDEV0_S  17
/** USB_H_EPTYPE0 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE0    0x00000003
#define USB_H_EPTYPE0_M  (USB_H_EPTYPE0_V << USB_H_EPTYPE0_S)
#define USB_H_EPTYPE0_V  0x00000003
#define USB_H_EPTYPE0_S  18
/** USB_H_EC0 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC0    (BIT(21))
#define USB_H_EC0_M  (USB_H_EC0_V << USB_H_EC0_S)
#define USB_H_EC0_V  0x00000001
#define USB_H_EC0_S  21
/** USB_H_DEVADDR0 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR0    0x0000007F
#define USB_H_DEVADDR0_M  (USB_H_DEVADDR0_V << USB_H_DEVADDR0_S)
#define USB_H_DEVADDR0_V  0x0000007F
#define USB_H_DEVADDR0_S  22
/** USB_H_ODDFRM0 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM0    (BIT(29))
#define USB_H_ODDFRM0_M  (USB_H_ODDFRM0_V << USB_H_ODDFRM0_S)
#define USB_H_ODDFRM0_V  0x00000001
#define USB_H_ODDFRM0_S  29
/** USB_H_CHDIS0 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS0    (BIT(30))
#define USB_H_CHDIS0_M  (USB_H_CHDIS0_V << USB_H_CHDIS0_S)
#define USB_H_CHDIS0_V  0x00000001
#define USB_H_CHDIS0_S  30
/** USB_H_CHENA0 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA0    (BIT(31))
#define USB_H_CHENA0_M  (USB_H_CHENA0_V << USB_H_CHENA0_S)
#define USB_H_CHENA0_V  0x00000001
#define USB_H_CHENA0_S  31


/** USB_HCDMA0_REG register
 *  Host Channel 0 DMA Address Register
 */
#define USB_HCDMA0_REG (SOC_DPORT_USB_BASE + 0x514)
/** USB_H_DMAADDR0 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR0    0xFFFFFFFF
#define USB_H_DMAADDR0_M  (USB_H_DMAADDR0_V << USB_H_DMAADDR0_S)
#define USB_H_DMAADDR0_V  0xFFFFFFFF
#define USB_H_DMAADDR0_S  0


/** USB_HCCHAR1_REG register
 *  Host Channel 1 Characteristics Register
 */
#define USB_HCCHAR1_REG (SOC_DPORT_USB_BASE + 0x520)
/** USB_H_MPS1 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS1    0x000007FF
#define USB_H_MPS1_M  (USB_H_MPS1_V << USB_H_MPS1_S)
#define USB_H_MPS1_V  0x000007FF
#define USB_H_MPS1_S  0
/** USB_H_EPNUM1 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM1    0x0000000F
#define USB_H_EPNUM1_M  (USB_H_EPNUM1_V << USB_H_EPNUM1_S)
#define USB_H_EPNUM1_V  0x0000000F
#define USB_H_EPNUM1_S  11
/** USB_H_EPDIR1 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR1    (BIT(15))
#define USB_H_EPDIR1_M  (USB_H_EPDIR1_V << USB_H_EPDIR1_S)
#define USB_H_EPDIR1_V  0x00000001
#define USB_H_EPDIR1_S  15
/** USB_H_LSPDDEV1 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV1    (BIT(17))
#define USB_H_LSPDDEV1_M  (USB_H_LSPDDEV1_V << USB_H_LSPDDEV1_S)
#define USB_H_LSPDDEV1_V  0x00000001
#define USB_H_LSPDDEV1_S  17
/** USB_H_EPTYPE1 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE1    0x00000003
#define USB_H_EPTYPE1_M  (USB_H_EPTYPE1_V << USB_H_EPTYPE1_S)
#define USB_H_EPTYPE1_V  0x00000003
#define USB_H_EPTYPE1_S  18
/** USB_H_EC1 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC1    (BIT(21))
#define USB_H_EC1_M  (USB_H_EC1_V << USB_H_EC1_S)
#define USB_H_EC1_V  0x00000001
#define USB_H_EC1_S  21
/** USB_H_DEVADDR1 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR1    0x0000007F
#define USB_H_DEVADDR1_M  (USB_H_DEVADDR1_V << USB_H_DEVADDR1_S)
#define USB_H_DEVADDR1_V  0x0000007F
#define USB_H_DEVADDR1_S  22
/** USB_H_ODDFRM1 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM1    (BIT(29))
#define USB_H_ODDFRM1_M  (USB_H_ODDFRM1_V << USB_H_ODDFRM1_S)
#define USB_H_ODDFRM1_V  0x00000001
#define USB_H_ODDFRM1_S  29
/** USB_H_CHDIS1 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS1    (BIT(30))
#define USB_H_CHDIS1_M  (USB_H_CHDIS1_V << USB_H_CHDIS1_S)
#define USB_H_CHDIS1_V  0x00000001
#define USB_H_CHDIS1_S  30
/** USB_H_CHENA1 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA1    (BIT(31))
#define USB_H_CHENA1_M  (USB_H_CHENA1_V << USB_H_CHENA1_S)
#define USB_H_CHENA1_V  0x00000001
#define USB_H_CHENA1_S  31


/** USB_HCDMA1_REG register
 *  Host Channel 1 DMA Address Register
 */
#define USB_HCDMA1_REG (SOC_DPORT_USB_BASE + 0x534)
/** USB_H_DMAADDR1 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR1    0xFFFFFFFF
#define USB_H_DMAADDR1_M  (USB_H_DMAADDR1_V << USB_H_DMAADDR1_S)
#define USB_H_DMAADDR1_V  0xFFFFFFFF
#define USB_H_DMAADDR1_S  0


/** USB_HCCHAR2_REG register
 *  Host Channel 2 Characteristics Register
 */
#define USB_HCCHAR2_REG (SOC_DPORT_USB_BASE + 0x540)
/** USB_H_MPS2 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS2    0x000007FF
#define USB_H_MPS2_M  (USB_H_MPS2_V << USB_H_MPS2_S)
#define USB_H_MPS2_V  0x000007FF
#define USB_H_MPS2_S  0
/** USB_H_EPNUM2 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM2    0x0000000F
#define USB_H_EPNUM2_M  (USB_H_EPNUM2_V << USB_H_EPNUM2_S)
#define USB_H_EPNUM2_V  0x0000000F
#define USB_H_EPNUM2_S  11
/** USB_H_EPDIR2 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR2    (BIT(15))
#define USB_H_EPDIR2_M  (USB_H_EPDIR2_V << USB_H_EPDIR2_S)
#define USB_H_EPDIR2_V  0x00000001
#define USB_H_EPDIR2_S  15
/** USB_H_LSPDDEV2 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV2    (BIT(17))
#define USB_H_LSPDDEV2_M  (USB_H_LSPDDEV2_V << USB_H_LSPDDEV2_S)
#define USB_H_LSPDDEV2_V  0x00000001
#define USB_H_LSPDDEV2_S  17
/** USB_H_EPTYPE2 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE2    0x00000003
#define USB_H_EPTYPE2_M  (USB_H_EPTYPE2_V << USB_H_EPTYPE2_S)
#define USB_H_EPTYPE2_V  0x00000003
#define USB_H_EPTYPE2_S  18
/** USB_H_EC2 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC2    (BIT(21))
#define USB_H_EC2_M  (USB_H_EC2_V << USB_H_EC2_S)
#define USB_H_EC2_V  0x00000001
#define USB_H_EC2_S  21
/** USB_H_DEVADDR2 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR2    0x0000007F
#define USB_H_DEVADDR2_M  (USB_H_DEVADDR2_V << USB_H_DEVADDR2_S)
#define USB_H_DEVADDR2_V  0x0000007F
#define USB_H_DEVADDR2_S  22
/** USB_H_ODDFRM2 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM2    (BIT(29))
#define USB_H_ODDFRM2_M  (USB_H_ODDFRM2_V << USB_H_ODDFRM2_S)
#define USB_H_ODDFRM2_V  0x00000001
#define USB_H_ODDFRM2_S  29
/** USB_H_CHDIS2 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS2    (BIT(30))
#define USB_H_CHDIS2_M  (USB_H_CHDIS2_V << USB_H_CHDIS2_S)
#define USB_H_CHDIS2_V  0x00000001
#define USB_H_CHDIS2_S  30
/** USB_H_CHENA2 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA2    (BIT(31))
#define USB_H_CHENA2_M  (USB_H_CHENA2_V << USB_H_CHENA2_S)
#define USB_H_CHENA2_V  0x00000001
#define USB_H_CHENA2_S  31


/** USB_HCDMA2_REG register
 *  Host Channel 2 DMA Address Register
 */
#define USB_HCDMA2_REG (SOC_DPORT_USB_BASE + 0x554)
/** USB_H_DMAADDR2 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR2    0xFFFFFFFF
#define USB_H_DMAADDR2_M  (USB_H_DMAADDR2_V << USB_H_DMAADDR2_S)
#define USB_H_DMAADDR2_V  0xFFFFFFFF
#define USB_H_DMAADDR2_S  0


