espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_HCCHAR3_REG register
 *  Host Channel 3 Characteristics Register
 */
#define USB_HCCHAR3_REG (SOC_DPORT_USB_BASE + 0x560)
/** USB_H_MPS3 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS3    0x000007FF
#define USB_H_MPS3_M  (USB_H_MPS3_V << USB_H_MPS3_S)
#define USB_H_MPS3_V  0x000007FF
#define USB_H_MPS3_S  0
/** USB_H_EPNUM3 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM3    0x0000000F
#define USB_H_EPNUM3_M  (USB_H_EPNUM3_V << USB_H_EPNUM3_S)
#define USB_H_EPNUM3_V  0x0000000F
#define USB_H_EPNUM3_S  11
/** USB_H_EPDIR3 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR3    (BIT(15))
#define USB_H_EPDIR3_M  (USB_H_EPDIR3_V << USB_H_EPDIR3_S)
#define USB_H_EPDIR3_V  0x00000001
#define USB_H_EPDIR3_S  15
/** USB_H_LSPDDEV3 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV3    (BIT(17))
#define USB_H_LSPDDEV3_M  (USB_H_LSPDDEV3_V << USB_H_LSPDDEV3_S)
#define USB_H_LSPDDEV3_V  0x00000001
#define USB_H_LSPDDEV3_S  17
/** USB_H_EPTYPE3 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE3    0x00000003
#define USB_H_EPTYPE3_M  (USB_H_EPTYPE3_V << USB_H_EPTYPE3_S)
#define USB_H_EPTYPE3_V  0x00000003
#define USB_H_EPTYPE3_S  18
/** USB_H_EC3 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC3    (BIT(21))
#define USB_H_EC3_M  (USB_H_EC3_V << USB_H_EC3_S)
#define USB_H_EC3_V  0x00000001
#define USB_H_EC3_S  21
/** USB_H_DEVADDR3 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR3    0x0000007F
#define USB_H_DEVADDR3_M  (USB_H_DEVADDR3_V << USB_H_DEVADDR3_S)
#define USB_H_DEVADDR3_V  0x0000007F
#define USB_H_DEVADDR3_S  22
/** USB_H_ODDFRM3 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM3    (BIT(29))
#define USB_H_ODDFRM3_M  (USB_H_ODDFRM3_V << USB_H_ODDFRM3_S)
#define USB_H_ODDFRM3_V  0x00000001
#define USB_H_ODDFRM3_S  29
/** USB_H_CHDIS3 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS3    (BIT(30))
#define USB_H_CHDIS3_M  (USB_H_CHDIS3_V << USB_H_CHDIS3_S)
#define USB_H_CHDIS3_V  0x00000001
#define USB_H_CHDIS3_S  30
/** USB_H_CHENA3 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA3    (BIT(31))
#define USB_H_CHENA3_M  (USB_H_CHENA3_V << USB_H_CHENA3_S)
#define USB_H_CHENA3_V  0x00000001
#define USB_H_CHENA3_S  31


/** USB_HCDMA3_REG register
 *  Host Channel 3 DMA Address Register
 */
#define USB_HCDMA3_REG (SOC_DPORT_USB_BASE + 0x574)
/** USB_H_DMAADDR3 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR3    0xFFFFFFFF
#define USB_H_DMAADDR3_M  (USB_H_DMAADDR3_V << USB_H_DMAADDR3_S)
#define USB_H_DMAADDR3_V  0xFFFFFFFF
#define USB_H_DMAADDR3_S  0


/** USB_HCCHAR4_REG register
 *  Host Channel 4 Characteristics Register
 */
#define USB_HCCHAR4_REG (SOC_DPORT_USB_BASE + 0x580)
/** USB_H_MPS4 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS4    0x000007FF
#define USB_H_MPS4_M  (USB_H_MPS4_V << USB_H_MPS4_S)
#define USB_H_MPS4_V  0x000007FF
#define USB_H_MPS4_S  0
/** USB_H_EPNUM4 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM4    0x0000000F
#define USB_H_EPNUM4_M  (USB_H_EPNUM4_V << USB_H_EPNUM4_S)
#define USB_H_EPNUM4_V  0x0000000F
#define USB_H_EPNUM4_S  11
/** USB_H_EPDIR4 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR4    (BIT(15))
#define USB_H_EPDIR4_M  (USB_H_EPDIR4_V << USB_H_EPDIR4_S)
#define USB_H_EPDIR4_V  0x00000001
#define USB_H_EPDIR4_S  15
/** USB_H_LSPDDEV4 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV4    (BIT(17))
#define USB_H_LSPDDEV4_M  (USB_H_LSPDDEV4_V << USB_H_LSPDDEV4_S)
#define USB_H_LSPDDEV4_V  0x00000001
#define USB_H_LSPDDEV4_S  17
/** USB_H_EPTYPE4 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE4    0x00000003
#define USB_H_EPTYPE4_M  (USB_H_EPTYPE4_V << USB_H_EPTYPE4_S)
#define USB_H_EPTYPE4_V  0x00000003
#define USB_H_EPTYPE4_S  18
/** USB_H_EC4 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC4    (BIT(21))
#define USB_H_EC4_M  (USB_H_EC4_V << USB_H_EC4_S)
#define USB_H_EC4_V  0x00000001
#define USB_H_EC4_S  21
/** USB_H_DEVADDR4 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR4    0x0000007F
#define USB_H_DEVADDR4_M  (USB_H_DEVADDR4_V << USB_H_DEVADDR4_S)
#define USB_H_DEVADDR4_V  0x0000007F
#define USB_H_DEVADDR4_S  22
/** USB_H_ODDFRM4 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM4    (BIT(29))
#define USB_H_ODDFRM4_M  (USB_H_ODDFRM4_V << USB_H_ODDFRM4_S)
#define USB_H_ODDFRM4_V  0x00000001
#define USB_H_ODDFRM4_S  29
/** USB_H_CHDIS4 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS4    (BIT(30))
#define USB_H_CHDIS4_M  (USB_H_CHDIS4_V << USB_H_CHDIS4_S)
#define USB_H_CHDIS4_V  0x00000001
#define USB_H_CHDIS4_S  30
/** USB_H_CHENA4 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA4    (BIT(31))
#define USB_H_CHENA4_M  (USB_H_CHENA4_V << USB_H_CHENA4_S)
#define USB_H_CHENA4_V  0x00000001
#define USB_H_CHENA4_S  31


