espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DCTL_REG register
 *  Device Control Register
 */
#define USB_DCTL_REG (SOC_DPORT_USB_BASE + 0x804)
/** USB_RMTWKUPSIG : R/W; bitpos: [0]; default: 0;
 *  0x0 : Core does not send Remote Wakeup Signaling
 *  0x1 : Core sends Remote Wakeup Signaling
 */
#define USB_RMTWKUPSIG    (BIT(0))
#define USB_RMTWKUPSIG_M  (USB_RMTWKUPSIG_V << USB_RMTWKUPSIG_S)
#define USB_RMTWKUPSIG_V  0x00000001
#define USB_RMTWKUPSIG_S  0
/** USB_SFTDISCON : R/W; bitpos: [1]; default: 0;
 *  1'b0: Normal operation. When this bit is cleared after a soft disconnect, the core
 *  drives the phy_opmode_o signal on the UTMI+ to 2'b00, which generates a device
 *  connect event to the USB host. When the device is reconnected, the USB host
 *  restarts device enumeration
 *  1'b1: The core drives the phy_opmode_o signal on the UTMI+ to  2'b01, which
 *  generates a device disconnect event to the USB host
 */
#define USB_SFTDISCON    (BIT(1))
#define USB_SFTDISCON_M  (USB_SFTDISCON_V << USB_SFTDISCON_S)
#define USB_SFTDISCON_V  0x00000001
#define USB_SFTDISCON_S  1
/** USB_GNPINNAKSTS : RO; bitpos: [2]; default: 0;
 *  0x0 : A handshake is sent out based on the data availability in the transmit FIFO
 *  0x1 : A NAK handshake is sent out on all non-periodic  IN endpoints, irrespective
 *  of the data availability in the transmit FIFO
 */
#define USB_GNPINNAKSTS    (BIT(2))
#define USB_GNPINNAKSTS_M  (USB_GNPINNAKSTS_V << USB_GNPINNAKSTS_S)
#define USB_GNPINNAKSTS_V  0x00000001
#define USB_GNPINNAKSTS_S  2
/** USB_GOUTNAKSTS : RO; bitpos: [3]; default: 0;
 *  0x0 : A handshake is sent based on the FIFO Status and the NAK and STALL bit
 *  settings
 *  0x1 : No data is written to the RxFIFO, irrespective of  space availability. Sends
 *  a NAK handshake on all packets, except on SETUP transactions. All isochronous OUT
 *  packets are dropped
 */
#define USB_GOUTNAKSTS    (BIT(3))
#define USB_GOUTNAKSTS_M  (USB_GOUTNAKSTS_V << USB_GOUTNAKSTS_S)
#define USB_GOUTNAKSTS_V  0x00000001
#define USB_GOUTNAKSTS_S  3
/** USB_TSTCTL : R/W; bitpos: [7:4]; default: 0;
 *  0x0: Test mode disabled
 *  0x1: Test_J mode
 *  0x2 : Test_K mode
 *  0x3 : Test_SE0_NAK mode
 *  0x4 : Test_Packet mode
 *  0x5 : Test_force_Enable
 */
#define USB_TSTCTL    0x00000007
#define USB_TSTCTL_M  (USB_TSTCTL_V << USB_TSTCTL_S)
#define USB_TSTCTL_V  0x00000007
#define USB_TSTCTL_S  4
/** USB_SGNPINNAK : WO; bitpos: [7]; default: 0;
 *  Set Global Non-periodic IN NAK. A write to this field sets the Global Non-periodic
 *  IN NAK.The application uses this bit to send a NAK handshake on all non-periodic IN
 *  endpoints. The core can also Set this bit when a timeout condition is detected on a
 *  non-periodic endpoint in shared FIFO operation. The application must Set this bit
 *  only after making sure that the Global IN NAK Effective bit in the Core Interrupt
 *  Register (GINTSTS.GINNakEff) is cleared
 */
#define USB_SGNPINNAK    (BIT(7))
#define USB_SGNPINNAK_M  (USB_SGNPINNAK_V << USB_SGNPINNAK_S)
#define USB_SGNPINNAK_V  0x00000001
#define USB_SGNPINNAK_S  7
/** USB_CGNPINNAK : WO; bitpos: [8]; default: 0;
 *  Clear Global Non-periodic IN NAK. A write to this field clears the Global
 *  Non-periodic IN NAK.
 */
#define USB_CGNPINNAK    (BIT(8))
#define USB_CGNPINNAK_M  (USB_CGNPINNAK_V << USB_CGNPINNAK_S)
#define USB_CGNPINNAK_V  0x00000001
#define USB_CGNPINNAK_S  8
/** USB_SGOUTNAK : WO; bitpos: [9]; default: 0;
 *  Set Global OUT NAK. A write to this field sets the Global OUT NAK. The application
 *  uses this bit to send a NAK handshake on all OUT endpoints. The application must
 *  set the this bit only after making sure that the Global OUT NAK Effective bit in
 *  the Core Interrupt Register (GINTSTS.GOUTNakEff) is cleared.
 */
#define USB_SGOUTNAK    (BIT(9))
#define USB_SGOUTNAK_M  (USB_SGOUTNAK_V << USB_SGOUTNAK_S)
#define USB_SGOUTNAK_V  0x00000001
#define USB_SGOUTNAK_S  9
/** USB_CGOUTNAK : WO; bitpos: [10]; default: 0;
 *  Clear Global OUT NAK. A write to this field clears the Global OUT NAK.
 */
#define USB_CGOUTNAK    (BIT(10))
#define USB_CGOUTNAK_M  (USB_CGOUTNAK_V << USB_CGOUTNAK_S)
#define USB_CGOUTNAK_V  0x00000001
#define USB_CGOUTNAK_S  10
/** USB_PWRONPRGDONE : R/W; bitpos: [11]; default: 0;
 *  1'b0: Power-On Programming not done
 *  1'b1: Power-On Programming Done
 */
#define USB_PWRONPRGDONE    (BIT(11))
#define USB_PWRONPRGDONE_M  (USB_PWRONPRGDONE_V << USB_PWRONPRGDONE_S)
#define USB_PWRONPRGDONE_V  0x00000001
#define USB_PWRONPRGDONE_S  11
/** USB_GMC : R/W; bitpos: [15:13]; default: 1;
 *  Global Multi Count. applicable only for Scatter/Gather DMA mode
 *  0x0 : Invalid
 *  0x1 : 1 packet
 *  0x2 : 2 packets
 *  0x3 : 3 packets
 */
#define USB_GMC    0x00000003
#define USB_GMC_M  (USB_GMC_V << USB_GMC_S)
#define USB_GMC_V  0x00000003
#define USB_GMC_S  13
/** USB_IGNRFRMNUM : R/W; bitpos: [15]; default: 0;
 *  0: The core transmits the packets only in the frame number in which they are
 *  intended to be transmitted
 *  1: The core ignores the frame number, sending packets immediately as the packets
 *  are ready
 */
#define USB_IGNRFRMNUM    (BIT(15))
#define USB_IGNRFRMNUM_M  (USB_IGNRFRMNUM_V << USB_IGNRFRMNUM_S)
#define USB_IGNRFRMNUM_V  0x00000001
#define USB_IGNRFRMNUM_S  15
/** USB_NAKONBBLE : R/W; bitpos: [16]; default: 0;
 *  1'b0: Disable NAK on Babble Error
 *  1'b1: NAK on Babble Error
 */
#define USB_NAKONBBLE    (BIT(16))
#define USB_NAKONBBLE_M  (USB_NAKONBBLE_V << USB_NAKONBBLE_S)
#define USB_NAKONBBLE_V  0x00000001
#define USB_NAKONBBLE_S  16
/** USB_ENCOUNTONBNA : R/W; bitpos: [17]; default: 0;
 *  1'b0: After receiving BNA interrupt,the core disables the endpoint. When the
 *  endpoint is re-enabled by the application,the core starts processing from the
 *  DOEPDMA descriptor
 *  1'b1: After receiving BNA interrupt, the core disables the endpoint. When the
 *  endpoint is re-enabled by the application, the core starts processing from the
 *  descriptor that received the BNA interrupt
 */
#define USB_ENCOUNTONBNA    (BIT(17))
#define USB_ENCOUNTONBNA_M  (USB_ENCOUNTONBNA_V << USB_ENCOUNTONBNA_S)
#define USB_ENCOUNTONBNA_V  0x00000001
#define USB_ENCOUNTONBNA_S  17
/** USB_DEEPSLEEPBESLREJECT : R/W; bitpos: [18]; default: 0;
 *  1'b0: Deep Sleep BESL Reject feature is disabled
 *  1'b1: Deep Sleep BESL Reject feature is enabled
 */
#define USB_DEEPSLEEPBESLREJECT    (BIT(18))
#define USB_DEEPSLEEPBESLREJECT_M  (USB_DEEPSLEEPBESLREJECT_V << USB_DEEPSLEEPBESLREJECT_S)
#define USB_DEEPSLEEPBESLREJECT_V  0x00000001
#define USB_DEEPSLEEPBESLREJECT_S  18


/** USB_DVBUSDIS_REG register
 *  Device VBUS Discharge Time Register
 */
#define USB_DVBUSDIS_REG (SOC_DPORT_USB_BASE + 0x828)
/** USB_DVBUSDIS : R/W; bitpos: [16:0]; default: 6103;
 *  Specifies the VBUS discharge time after VBUS pulsing during SRP. This value equals
 *  (VBUS discharge time in PHY clocks) / 1, 024. The value you use depends whether the
 *  PHY is operating at 30MHz (16-bit data width) or 60 MHz (8-bit data width).
 *  Depending on your VBUS load, this value can need adjustment.
 */
#define USB_DVBUSDIS    0x0000FFFF
#define USB_DVBUSDIS_M  (USB_DVBUSDIS_V << USB_DVBUSDIS_S)
#define USB_DVBUSDIS_V  0x0000FFFF
#define USB_DVBUSDIS_S  0


/** USB_DVBUSPULSE_REG register
 *  Device VBUS Pulsing Time Register
 */
#define USB_DVBUSPULSE_REG (SOC_DPORT_USB_BASE + 0x82c)
/** USB_DVBUSPULSE : R/W; bitpos: [12:0]; default: 1464;
 *  Specifies the VBUS pulsing time during SRP. This value equals (VBUS pulsing time in
 *  PHY clocks) / 1, 024 The value you use depends whether the PHY is operating at
 *  30MHz (16-bit data width) or 60 MHz (8-bit data width).
 */
#define USB_DVBUSPULSE    0x00000FFF
#define USB_DVBUSPULSE_M  (USB_DVBUSPULSE_V << USB_DVBUSPULSE_S)
#define USB_DVBUSPULSE_V  0x00000FFF
#define USB_DVBUSPULSE_S  0


/** USB_DTHRCTL_REG register
 *  Device Threshold Control Register
 */
#define USB_DTHRCTL_REG (SOC_DPORT_USB_BASE + 0x830)
/** USB_NONISOTHREN : R/W; bitpos: [0]; default: 0;
 *  Non-ISO IN Endpoints Threshold Enable
 *  0x0 : No thresholding
 *  0x1 : Enable thresholding for non-isochronous IN endpoints
 */
#define USB_NONISOTHREN    (BIT(0))
#define USB_NONISOTHREN_M  (USB_NONISOTHREN_V << USB_NONISOTHREN_S)
#define USB_NONISOTHREN_V  0x00000001
#define USB_NONISOTHREN_S  0
/** USB_ISOTHREN : R/W; bitpos: [1]; default: 0;
 *  ISO IN Endpoints Threshold Enable
 *  0x0 : No thresholding
 *  0x1 : Enables thresholding for isochronous IN endpoints
 */
#define USB_ISOTHREN    (BIT(1))
#define USB_ISOTHREN_M  (USB_ISOTHREN_V << USB_ISOTHREN_S)
#define USB_ISOTHREN_V  0x00000001
#define USB_ISOTHREN_S  1
/** USB_TXTHRLEN : R/W; bitpos: [11:2]; default: 8;
 *  This field specifies Transmit thresholding size in DWORDS. This also forms the MAC
 *  threshold and specifies the amount of data in bytes to be in the corresponding
 *  endpoint transmit FIFO, before the core can start transmit on the USB. The
 *  threshold length has to be at least eight DWORDS when the value of AHBThrRatio is
 *  2'h00. In case the AHBThrRatio is non zero the application needs to ensure that the
 *  AHB Threshold value does not go below the recommended eight DWORD. This field
 *  controls both isochronous and non-isochronous IN endpoint thresholds. The
 *  recommended value for ThrLen is to be the same as the programmed AHB Burst Length
 *  (GAHBCFG.HBstLen).
 */
#define USB_TXTHRLEN    0x000001FF
#define USB_TXTHRLEN_M  (USB_TXTHRLEN_V << USB_TXTHRLEN_S)
#define USB_TXTHRLEN_V  0x000001FF
#define USB_TXTHRLEN_S  2
/** USB_AHBTHRRATIO : R/W; bitpos: [13:11]; default: 0;
 *  2'b00: AHB threshold = MAC threshold
 *  2'b01: AHB threshold = MAC threshold/2
 *  2'b10: AHB threshold = MAC threshold/4
 *  2'b11: AHB threshold = MAC threshold/8
 */
#define USB_AHBTHRRATIO    0x00000003
#define USB_AHBTHRRATIO_M  (USB_AHBTHRRATIO_V << USB_AHBTHRRATIO_S)
#define USB_AHBTHRRATIO_V  0x00000003
#define USB_AHBTHRRATIO_S  11
/** USB_RXTHREN : R/W; bitpos: [16]; default: 0;
 *  0x0 : Disable thresholding
 *  0x1 : Enable thresholding in the receive direction
 */
#define USB_RXTHREN    (BIT(16))
#define USB_RXTHREN_M  (USB_RXTHREN_V << USB_RXTHREN_S)
#define USB_RXTHREN_V  0x00000001
#define USB_RXTHREN_S  16
/** USB_RXTHRLEN : R/W; bitpos: [26:17]; default: 1;
 *  Receive Threshold Length.  This field specifies Receive thresholding size in
 *  DWORDS. This field also specifies the amount of data received on the USB before the
 *  core can start transmitting on the AHB. The threshold length has to be at least
 *  eight DWORDS. The recommended value for ThrLen is to be the same as the programmed
 *  AHB Burst Length(GAHBCFG.HBstLen).
 */
#define USB_RXTHRLEN    0x000001FF
#define USB_RXTHRLEN_M  (USB_RXTHRLEN_V << USB_RXTHRLEN_S)
#define USB_RXTHRLEN_V  0x000001FF
#define USB_RXTHRLEN_S  17
/** USB_ARBPRKEN : R/W; bitpos: [27]; default: 1;
 *  0x0 : Disable DMA arbiter parking
 *  0x1 : Enable DMA arbiter parking for IN endpoints
 */
#define USB_ARBPRKEN    (BIT(27))
#define USB_ARBPRKEN_M  (USB_ARBPRKEN_V << USB_ARBPRKEN_S)
#define USB_ARBPRKEN_V  0x00000001
#define USB_ARBPRKEN_S  27


/** USB_DIEPCTL0_REG register
 *  Device Control IN Endpoint $n Control Register
 */
#define USB_DIEPCTL0_REG (SOC_DPORT_USB_BASE + 0x900)
/** USB_D_MPS0 : R/W; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_D_MPS0    0x00000003
#define USB_D_MPS0_M  (USB_D_MPS0_V << USB_D_MPS0_S)
#define USB_D_MPS0_V  0x00000003
#define USB_D_MPS0_S  0
/** USB_D_USBACTEP0 : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint
 *  0x1 : Control endpoint is always active
 */
#define USB_D_USBACTEP0    (BIT(15))
#define USB_D_USBACTEP0_M  (USB_D_USBACTEP0_V << USB_D_USBACTEP0_S)
#define USB_D_USBACTEP0_V  0x00000001
#define USB_D_USBACTEP0_S  15
/** USB_D_NAKSTS0 : RO; bitpos: [17]; default: 0;
 *  NAK Status
 *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
 *  0x1 : The core is transmitting NAK handshakes on this endpoint
 */
#define USB_D_NAKSTS0    (BIT(17))
#define USB_D_NAKSTS0_M  (USB_D_NAKSTS0_V << USB_D_NAKSTS0_S)
#define USB_D_NAKSTS0_V  0x00000001
#define USB_D_NAKSTS0_S  17
/** USB_D_EPTYPE0 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 0
 */
#define USB_D_EPTYPE0    0x00000003
#define USB_D_EPTYPE0_M  (USB_D_EPTYPE0_V << USB_D_EPTYPE0_S)
#define USB_D_EPTYPE0_V  0x00000003
#define USB_D_EPTYPE0_S  18
/** USB_D_STALL0 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it
 *  0x0 : No Stall
 *  0x1 : Stall Handshake
 */
#define USB_D_STALL0    (BIT(21))
#define USB_D_STALL0_M  (USB_D_STALL0_V << USB_D_STALL0_S)
#define USB_D_STALL0_V  0x00000001
#define USB_D_STALL0_S  21
/** USB_D_TXFNUM0 : R/W; bitpos: [26:22]; default: 0;
 *  TxFIFO Number.
 */
#define USB_D_TXFNUM0    0x0000000F
#define USB_D_TXFNUM0_M  (USB_D_TXFNUM0_V << USB_D_TXFNUM0_S)
#define USB_D_TXFNUM0_V  0x0000000F
#define USB_D_TXFNUM0_S  22
/** USB_D_CNAK0 : WO; bitpos: [26]; default: 0;
 *  A write to this bit clears the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_D_CNAK0    (BIT(26))
#define USB_D_CNAK0_M  (USB_D_CNAK0_V << USB_D_CNAK0_S)
#define USB_D_CNAK0_V  0x00000001
#define USB_D_CNAK0_S  26
/** USB_DI_SNAK0 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DI_SNAK0    (BIT(27))
#define USB_DI_SNAK0_M  (USB_DI_SNAK0_V << USB_DI_SNAK0_S)
#define USB_DI_SNAK0_V  0x00000001
#define USB_DI_SNAK0_S  27
/** USB_D_EPDIS0 : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No action
 *  0x1 : Disabled Endpoint
 */
#define USB_D_EPDIS0    (BIT(30))
#define USB_D_EPDIS0_M  (USB_D_EPDIS0_V << USB_D_EPDIS0_S)
#define USB_D_EPDIS0_V  0x00000001
#define USB_D_EPDIS0_S  30
/** USB_D_EPENA0 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_D_EPENA0    (BIT(31))
#define USB_D_EPENA0_M  (USB_D_EPENA0_V << USB_D_EPENA0_S)
#define USB_D_EPENA0_V  0x00000001
#define USB_D_EPENA0_S  31


/** USB_DIEPTSIZ0_REG register
 *  Device IN Endpoint 0 Transfer Size Register
 */
#define USB_DIEPTSIZ0_REG (SOC_DPORT_USB_BASE + 0x910)
/** USB_D_XFERSIZE0 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size
 *  IN Endpoints: The core decrements this field every time a packet from the external
 *  memory is written to the TxFIFO
 *  OUT Endpoints: The core decrements this field every time a  packet is read from the
 *  RxFIFO and written to the external memory
 */
#define USB_D_XFERSIZE0    0x0000007F
#define USB_D_XFERSIZE0_M  (USB_D_XFERSIZE0_V << USB_D_XFERSIZE0_S)
#define USB_D_XFERSIZE0_V  0x0000007F
#define USB_D_XFERSIZE0_S  0
/** USB_D_PKTCNT0 : R/W; bitpos: [21:19]; default: 0;
 *  Packet Count
 *  IN Endpoints : This field is decremented every time a packet (maximum size or short
 *  packet) is read from the TxFIFO
 *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
 *  packet) is written to the RxFIFO
 */
#define USB_D_PKTCNT0    0x00000003
#define USB_D_PKTCNT0_M  (USB_D_PKTCNT0_V << USB_D_PKTCNT0_S)
#define USB_D_PKTCNT0_V  0x00000003
#define USB_D_PKTCNT0_S  19


