espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DIEPDMA0_REG register
 *  Device IN Endpoint 0 DMA Address Register
 */
#define USB_DIEPDMA0_REG (SOC_DPORT_USB_BASE + 0x914)
/** USB_D_DMAADDR0 : R/W; bitpos: [32:0]; default: 0;
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 */
#define USB_D_DMAADDR0    0xFFFFFFFF
#define USB_D_DMAADDR0_M  (USB_D_DMAADDR0_V << USB_D_DMAADDR0_S)
#define USB_D_DMAADDR0_V  0xFFFFFFFF
#define USB_D_DMAADDR0_S  0


/** USB_DIEPCTL1_REG register
 *  Device Control IN Endpoint $n Control Register
 */
#define USB_DIEPCTL1_REG (SOC_DPORT_USB_BASE + 0x920)
/** USB_D_MPS1 : R/W; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_D_MPS1    0x00000003
#define USB_D_MPS1_M  (USB_D_MPS1_V << USB_D_MPS1_S)
#define USB_D_MPS1_V  0x00000003
#define USB_D_MPS1_S  0
/** USB_D_USBACTEP1 : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint
 *  0x1 : Control endpoint is always active
 */
#define USB_D_USBACTEP1    (BIT(15))
#define USB_D_USBACTEP1_M  (USB_D_USBACTEP1_V << USB_D_USBACTEP1_S)
#define USB_D_USBACTEP1_V  0x00000001
#define USB_D_USBACTEP1_S  15
/** USB_D_NAKSTS1 : RO; bitpos: [17]; default: 0;
 *  NAK Status
 *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
 *  0x1 : The core is transmitting NAK handshakes on this endpoint
 */
#define USB_D_NAKSTS1    (BIT(17))
#define USB_D_NAKSTS1_M  (USB_D_NAKSTS1_V << USB_D_NAKSTS1_S)
#define USB_D_NAKSTS1_V  0x00000001
#define USB_D_NAKSTS1_S  17
/** USB_D_EPTYPE1 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 0
 */
#define USB_D_EPTYPE1    0x00000003
#define USB_D_EPTYPE1_M  (USB_D_EPTYPE1_V << USB_D_EPTYPE1_S)
#define USB_D_EPTYPE1_V  0x00000003
#define USB_D_EPTYPE1_S  18
/** USB_D_STALL1 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it
 *  0x0 : No Stall
 *  0x1 : Stall Handshake
 */
#define USB_D_STALL1    (BIT(21))
#define USB_D_STALL1_M  (USB_D_STALL1_V << USB_D_STALL1_S)
#define USB_D_STALL1_V  0x00000001
#define USB_D_STALL1_S  21
/** USB_D_TXFNUM1 : R/W; bitpos: [26:22]; default: 0;
 *  TxFIFO Number.
 */
#define USB_D_TXFNUM1    0x0000000F
#define USB_D_TXFNUM1_M  (USB_D_TXFNUM1_V << USB_D_TXFNUM1_S)
#define USB_D_TXFNUM1_V  0x0000000F
#define USB_D_TXFNUM1_S  22
/** USB_D_CNAK1 : WO; bitpos: [26]; default: 0;
 *  A write to this bit clears the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_D_CNAK1    (BIT(26))
#define USB_D_CNAK1_M  (USB_D_CNAK1_V << USB_D_CNAK1_S)
#define USB_D_CNAK1_V  0x00000001
#define USB_D_CNAK1_S  26
/** USB_DI_SNAK1 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DI_SNAK1    (BIT(27))
#define USB_DI_SNAK1_M  (USB_DI_SNAK1_V << USB_DI_SNAK1_S)
#define USB_DI_SNAK1_V  0x00000001
#define USB_DI_SNAK1_S  27
/** USB_DI_SETD0PID1 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DI_SETD0PID1    (BIT(28))
#define USB_DI_SETD0PID1_M  (USB_DI_SETD0PID1_V << USB_DI_SETD0PID1_S)
#define USB_DI_SETD0PID1_V  0x00000001
#define USB_DI_SETD0PID1_S  28
/** USB_DI_SETD1PID1 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DI_SETD1PID1    (BIT(29))
#define USB_DI_SETD1PID1_M  (USB_DI_SETD1PID1_V << USB_DI_SETD1PID1_S)
#define USB_DI_SETD1PID1_V  0x00000001
#define USB_DI_SETD1PID1_S  29
/** USB_D_EPDIS1 : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No action
 *  0x1 : Disabled Endpoint
 */
#define USB_D_EPDIS1    (BIT(30))
#define USB_D_EPDIS1_M  (USB_D_EPDIS1_V << USB_D_EPDIS1_S)
#define USB_D_EPDIS1_V  0x00000001
#define USB_D_EPDIS1_S  30
/** USB_D_EPENA1 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_D_EPENA1    (BIT(31))
#define USB_D_EPENA1_M  (USB_D_EPENA1_V << USB_D_EPENA1_S)
#define USB_D_EPENA1_V  0x00000001
#define USB_D_EPENA1_S  31


/** USB_DIEPTSIZ1_REG register
 *  Device IN Endpoint 1 Transfer Size Register
 */
#define USB_DIEPTSIZ1_REG (SOC_DPORT_USB_BASE + 0x930)
/** USB_D_XFERSIZE1 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size
 *  IN Endpoints: The core decrements this field every time a packet from the external
 *  memory is written to the TxFIFO
 *  OUT Endpoints: The core decrements this field every time a  packet is read from the
 *  RxFIFO and written to the external memory
 */
#define USB_D_XFERSIZE1    0x0000007F
#define USB_D_XFERSIZE1_M  (USB_D_XFERSIZE1_V << USB_D_XFERSIZE1_S)
#define USB_D_XFERSIZE1_V  0x0000007F
#define USB_D_XFERSIZE1_S  0
/** USB_D_PKTCNT1 : R/W; bitpos: [21:19]; default: 0;
 *  Packet Count
 *  IN Endpoints : This field is decremented every time a packet (maximum size or short
 *  packet) is read from the TxFIFO
 *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
 *  packet) is written to the RxFIFO
 */
#define USB_D_PKTCNT1    0x00000003
#define USB_D_PKTCNT1_M  (USB_D_PKTCNT1_V << USB_D_PKTCNT1_S)
#define USB_D_PKTCNT1_V  0x00000003
#define USB_D_PKTCNT1_S  19


/** USB_DIEPDMA1_REG register
 *  Device IN Endpoint 1 DMA Address Register
 */
#define USB_DIEPDMA1_REG (SOC_DPORT_USB_BASE + 0x934)
/** USB_D_DMAADDR1 : R/W; bitpos: [32:0]; default: 0;
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 */
#define USB_D_DMAADDR1    0xFFFFFFFF
#define USB_D_DMAADDR1_M  (USB_D_DMAADDR1_V << USB_D_DMAADDR1_S)
#define USB_D_DMAADDR1_V  0xFFFFFFFF
#define USB_D_DMAADDR1_S  0


/** USB_DIEPCTL2_REG register
 *  Device Control IN Endpoint 2 Control Register
 */
#define USB_DIEPCTL2_REG (SOC_DPORT_USB_BASE + 0x940)
/** USB_D_MPS2 : R/W; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_D_MPS2    0x00000003
#define USB_D_MPS2_M  (USB_D_MPS2_V << USB_D_MPS2_S)
#define USB_D_MPS2_V  0x00000003
#define USB_D_MPS2_S  0
/** USB_D_USBACTEP2 : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint
 *  0x1 : Control endpoint is always active
 */
#define USB_D_USBACTEP2    (BIT(15))
#define USB_D_USBACTEP2_M  (USB_D_USBACTEP2_V << USB_D_USBACTEP2_S)
#define USB_D_USBACTEP2_V  0x00000001
#define USB_D_USBACTEP2_S  15
/** USB_D_NAKSTS2 : RO; bitpos: [17]; default: 0;
 *  NAK Status
 *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
 *  0x1 : The core is transmitting NAK handshakes on this endpoint
 */
#define USB_D_NAKSTS2    (BIT(17))
#define USB_D_NAKSTS2_M  (USB_D_NAKSTS2_V << USB_D_NAKSTS2_S)
#define USB_D_NAKSTS2_V  0x00000001
#define USB_D_NAKSTS2_S  17
/** USB_D_EPTYPE2 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 0
 */
#define USB_D_EPTYPE2    0x00000003
#define USB_D_EPTYPE2_M  (USB_D_EPTYPE2_V << USB_D_EPTYPE2_S)
#define USB_D_EPTYPE2_V  0x00000003
#define USB_D_EPTYPE2_S  18
/** USB_D_STALL2 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it
 *  0x0 : No Stall
 *  0x1 : Stall Handshake
 */
#define USB_D_STALL2    (BIT(21))
#define USB_D_STALL2_M  (USB_D_STALL2_V << USB_D_STALL2_S)
#define USB_D_STALL2_V  0x00000001
#define USB_D_STALL2_S  21
/** USB_D_TXFNUM2 : R/W; bitpos: [26:22]; default: 0;
 *  TxFIFO Number.
 */
#define USB_D_TXFNUM2    0x0000000F
#define USB_D_TXFNUM2_M  (USB_D_TXFNUM2_V << USB_D_TXFNUM2_S)
#define USB_D_TXFNUM2_V  0x0000000F
#define USB_D_TXFNUM2_S  22
/** USB_D_CNAK2 : WO; bitpos: [26]; default: 0;
 *  A write to this bit clears the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_D_CNAK2    (BIT(26))
#define USB_D_CNAK2_M  (USB_D_CNAK2_V << USB_D_CNAK2_S)
#define USB_D_CNAK2_V  0x00000001
#define USB_D_CNAK2_S  26
/** USB_DI_SNAK2 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DI_SNAK2    (BIT(27))
#define USB_DI_SNAK2_M  (USB_DI_SNAK2_V << USB_DI_SNAK2_S)
#define USB_DI_SNAK2_V  0x00000001
#define USB_DI_SNAK2_S  27
/** USB_DI_SETD0PID2 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DI_SETD0PID2    (BIT(28))
#define USB_DI_SETD0PID2_M  (USB_DI_SETD0PID2_V << USB_DI_SETD0PID2_S)
#define USB_DI_SETD0PID2_V  0x00000001
#define USB_DI_SETD0PID2_S  28
/** USB_DI_SETD1PID2 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DI_SETD1PID2    (BIT(29))
#define USB_DI_SETD1PID2_M  (USB_DI_SETD1PID2_V << USB_DI_SETD1PID2_S)
#define USB_DI_SETD1PID2_V  0x00000001
#define USB_DI_SETD1PID2_S  29
/** USB_D_EPDIS2 : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No action
 *  0x1 : Disabled Endpoint
 */
#define USB_D_EPDIS2    (BIT(30))
#define USB_D_EPDIS2_M  (USB_D_EPDIS2_V << USB_D_EPDIS2_S)
#define USB_D_EPDIS2_V  0x00000001
#define USB_D_EPDIS2_S  30
/** USB_D_EPENA2 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_D_EPENA2    (BIT(31))
#define USB_D_EPENA2_M  (USB_D_EPENA2_V << USB_D_EPENA2_S)
#define USB_D_EPENA2_V  0x00000001
#define USB_D_EPENA2_S  31


/** USB_DIEPTSIZ2_REG register
 *  Device IN Endpoint 2 Transfer Size Register
 */
#define USB_DIEPTSIZ2_REG (SOC_DPORT_USB_BASE + 0x950)
/** USB_D_XFERSIZE2 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size
 *  IN Endpoints: The core decrements this field every time a packet from the external
 *  memory is written to the TxFIFO
 *  OUT Endpoints: The core decrements this field every time a  packet is read from the
 *  RxFIFO and written to the external memory
 */
#define USB_D_XFERSIZE2    0x0000007F
#define USB_D_XFERSIZE2_M  (USB_D_XFERSIZE2_V << USB_D_XFERSIZE2_S)
#define USB_D_XFERSIZE2_V  0x0000007F
#define USB_D_XFERSIZE2_S  0
/** USB_D_PKTCNT2 : R/W; bitpos: [21:19]; default: 0;
 *  Packet Count
 *  IN Endpoints : This field is decremented every time a packet (maximum size or short
 *  packet) is read from the TxFIFO
 *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
 *  packet) is written to the RxFIFO
 */
#define USB_D_PKTCNT2    0x00000003
#define USB_D_PKTCNT2_M  (USB_D_PKTCNT2_V << USB_D_PKTCNT2_S)
#define USB_D_PKTCNT2_V  0x00000003
#define USB_D_PKTCNT2_S  19


/** USB_DIEPDMA2_REG register
 *  Device IN Endpoint 2 DMA Address Register
 */
#define USB_DIEPDMA2_REG (SOC_DPORT_USB_BASE + 0x954)
/** USB_D_DMAADDR2 : R/W; bitpos: [32:0]; default: 0;
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 */
#define USB_D_DMAADDR2    0xFFFFFFFF
#define USB_D_DMAADDR2_M  (USB_D_DMAADDR2_V << USB_D_DMAADDR2_S)
#define USB_D_DMAADDR2_V  0xFFFFFFFF
#define USB_D_DMAADDR2_S  0


