espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DOEPDMAB0_REG register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
#define USB_DOEPDMAB0_REG (SOC_DPORT_USB_BASE + 0xb1c)
/** USB_DMABUFFERADDR0 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_DMABUFFERADDR0    0xFFFFFFFF
#define USB_DMABUFFERADDR0_M  (USB_DMABUFFERADDR0_V << USB_DMABUFFERADDR0_S)
#define USB_DMABUFFERADDR0_V  0xFFFFFFFF
#define USB_DMABUFFERADDR0_S  0


/** USB_DOEPCTL1_REG register
 *  Device Control OUT Endpoint 1 Control Register
 */
#define USB_DOEPCTL1_REG (SOC_DPORT_USB_BASE + 0xb20)
/** USB_MPS1 : RO; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size in bytes
 */
#define USB_MPS1    0x000007FF
#define USB_MPS1_M  (USB_MPS1_V << USB_MPS1_S)
#define USB_MPS1_V  0x000007FF
#define USB_MPS1_S  0
/** USB_USBACTEP1 : RO; bitpos: [15]; default: 1;
 *  0x1: USB Active Endpoint 0
 */
#define USB_USBACTEP1    (BIT(15))
#define USB_USBACTEP1_M  (USB_USBACTEP1_V << USB_USBACTEP1_S)
#define USB_USBACTEP1_V  0x00000001
#define USB_USBACTEP1_S  15
/** USB_NAKSTS1 : RO; bitpos: [17]; default: 0;
 *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
 *  0x1 :The core is transmitting NAK handshakes on this endpoint
 */
#define USB_NAKSTS1    (BIT(17))
#define USB_NAKSTS1_M  (USB_NAKSTS1_V << USB_NAKSTS1_S)
#define USB_NAKSTS1_V  0x00000001
#define USB_NAKSTS1_S  17
/** USB_EPTYPE1 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 1
 */
#define USB_EPTYPE1    0x00000003
#define USB_EPTYPE1_M  (USB_EPTYPE1_V << USB_EPTYPE1_S)
#define USB_EPTYPE1_V  0x00000003
#define USB_EPTYPE1_S  18
/** USB_SNP1 : R/W; bitpos: [20]; default: 0;
 *  0x0 : Reserved 0
 *  0x1 : Reserved 1
 */
#define USB_SNP1    (BIT(20))
#define USB_SNP1_M  (USB_SNP1_V << USB_SNP1_S)
#define USB_SNP1_V  0x00000001
#define USB_SNP1_S  20
/** USB_STALL1 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it, when a SETUP token
 *  is received for this endpoint
 *  0x0 (INACTIVE): No Stall
 *  0x1 (ACTIVE): Stall Handshake
 */
#define USB_STALL1    (BIT(21))
#define USB_STALL1_M  (USB_STALL1_V << USB_STALL1_S)
#define USB_STALL1_V  0x00000001
#define USB_STALL1_S  21
/** USB_CNAK1 : WO; bitpos: [26]; default: 0;
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_CNAK1    (BIT(26))
#define USB_CNAK1_M  (USB_CNAK1_V << USB_CNAK1_S)
#define USB_CNAK1_V  0x00000001
#define USB_CNAK1_S  26
/** USB_DO_SNAK1 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DO_SNAK1    (BIT(27))
#define USB_DO_SNAK1_M  (USB_DO_SNAK1_V << USB_DO_SNAK1_S)
#define USB_DO_SNAK1_V  0x00000001
#define USB_DO_SNAK1_S  27
/** USB_DO_SETD0PID1 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DO_SETD0PID1    (BIT(28))
#define USB_DO_SETD0PID1_M  (USB_DO_SETD0PID1_V << USB_DO_SETD0PID1_S)
#define USB_DO_SETD0PID1_V  0x00000001
#define USB_DO_SETD0PID1_S  28
/** USB_DO_SETD1PID1 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DO_SETD1PID1    (BIT(29))
#define USB_DO_SETD1PID1_M  (USB_DO_SETD1PID1_V << USB_DO_SETD1PID1_S)
#define USB_DO_SETD1PID1_V  0x00000001
#define USB_DO_SETD1PID1_S  29
/** USB_EPDIS1 : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No Endpoint disable
 */
#define USB_EPDIS1    (BIT(30))
#define USB_EPDIS1_M  (USB_EPDIS1_V << USB_EPDIS1_S)
#define USB_EPDIS1_V  0x00000001
#define USB_EPDIS1_S  30
/** USB_EPENA1 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_EPENA1    (BIT(31))
#define USB_EPENA1_M  (USB_EPENA1_V << USB_EPENA1_S)
#define USB_EPENA1_V  0x00000001
#define USB_EPENA1_S  31


/** USB_DOEPTSIZ1_REG register
 *  Device OUT Endpoint 1 Transfer Size Register
 */
#define USB_DOEPTSIZ1_REG (SOC_DPORT_USB_BASE + 0xb30)
/** USB_XFERSIZE1 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size.Indicates the transfer size in bytes for ENDPOINT1
 */
#define USB_XFERSIZE1    0x0000007F
#define USB_XFERSIZE1_M  (USB_XFERSIZE1_V << USB_XFERSIZE1_S)
#define USB_XFERSIZE1_V  0x0000007F
#define USB_XFERSIZE1_S  0
/** USB_PKTCNT1 : R/W; bitpos: [19]; default: 0;
 *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
 *  into the RxFIFO.
 */
#define USB_PKTCNT1    (BIT(19))
#define USB_PKTCNT1_M  (USB_PKTCNT1_V << USB_PKTCNT1_S)
#define USB_PKTCNT1_V  0x00000001
#define USB_PKTCNT1_S  19
/** USB_SUPCNT1 : R/W; bitpos: [31:29]; default: 0;
 *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
 *  data packets the endpoint can receive
 *  2'b01: 1 packet
 *  2'b10: 2 packets
 *  2'b11: 3 packets
 */
#define USB_SUPCNT1    0x00000003
#define USB_SUPCNT1_M  (USB_SUPCNT1_V << USB_SUPCNT1_S)
#define USB_SUPCNT1_V  0x00000003
#define USB_SUPCNT1_S  29


/** USB_DOEPDMA1_REG register
 *  Device OUT Endpoint 1 DMA Address Register
 */
#define USB_DOEPDMA1_REG (SOC_DPORT_USB_BASE + 0xb34)
/** USB_DMAADDR1 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 */
#define USB_DMAADDR1    0xFFFFFFFF
#define USB_DMAADDR1_M  (USB_DMAADDR1_V << USB_DMAADDR1_S)
#define USB_DMAADDR1_V  0xFFFFFFFF
#define USB_DMAADDR1_S  0


/** USB_DOEPDMAB1_REG register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
#define USB_DOEPDMAB1_REG (SOC_DPORT_USB_BASE + 0xb3c)
/** USB_DMABUFFERADDR1 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_DMABUFFERADDR1    0xFFFFFFFF
#define USB_DMABUFFERADDR1_M  (USB_DMABUFFERADDR1_V << USB_DMABUFFERADDR1_S)
#define USB_DMABUFFERADDR1_V  0xFFFFFFFF
#define USB_DMABUFFERADDR1_S  0


/** USB_DOEPCTL2_REG register
 *  Device Control OUT Endpoint 2 Control Register
 */
#define USB_DOEPCTL2_REG (SOC_DPORT_USB_BASE + 0xb40)
/** USB_MPS2 : RO; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size in bytes
 */
#define USB_MPS2    0x000007FF
#define USB_MPS2_M  (USB_MPS2_V << USB_MPS2_S)
#define USB_MPS2_V  0x000007FF
#define USB_MPS2_S  0
/** USB_USBACTEP2 : RO; bitpos: [15]; default: 1;
 *  0x1: USB Active Endpoint 0
 */
#define USB_USBACTEP2    (BIT(15))
#define USB_USBACTEP2_M  (USB_USBACTEP2_V << USB_USBACTEP2_S)
#define USB_USBACTEP2_V  0x00000001
#define USB_USBACTEP2_S  15
/** USB_NAKSTS2 : RO; bitpos: [17]; default: 0;
 *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
 *  0x1 :The core is transmitting NAK handshakes on this endpoint
 */
#define USB_NAKSTS2    (BIT(17))
#define USB_NAKSTS2_M  (USB_NAKSTS2_V << USB_NAKSTS2_S)
#define USB_NAKSTS2_V  0x00000001
#define USB_NAKSTS2_S  17
/** USB_EPTYPE2 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 2
 */
#define USB_EPTYPE2    0x00000003
#define USB_EPTYPE2_M  (USB_EPTYPE2_V << USB_EPTYPE2_S)
#define USB_EPTYPE2_V  0x00000003
#define USB_EPTYPE2_S  18
/** USB_SNP2 : R/W; bitpos: [20]; default: 0;
 *  0x0 : Reserved 0
 *  0x1 : Reserved 1
 */
#define USB_SNP2    (BIT(20))
#define USB_SNP2_M  (USB_SNP2_V << USB_SNP2_S)
#define USB_SNP2_V  0x00000001
#define USB_SNP2_S  20
/** USB_STALL2 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it, when a SETUP token
 *  is received for this endpoint
 *  0x0 (INACTIVE): No Stall
 *  0x1 (ACTIVE): Stall Handshake
 */
#define USB_STALL2    (BIT(21))
#define USB_STALL2_M  (USB_STALL2_V << USB_STALL2_S)
#define USB_STALL2_V  0x00000001
#define USB_STALL2_S  21
/** USB_CNAK2 : WO; bitpos: [26]; default: 0;
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_CNAK2    (BIT(26))
#define USB_CNAK2_M  (USB_CNAK2_V << USB_CNAK2_S)
#define USB_CNAK2_V  0x00000001
#define USB_CNAK2_S  26
/** USB_DO_SNAK2 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DO_SNAK2    (BIT(27))
#define USB_DO_SNAK2_M  (USB_DO_SNAK2_V << USB_DO_SNAK2_S)
#define USB_DO_SNAK2_V  0x00000001
#define USB_DO_SNAK2_S  27
/** USB_DO_SETD0PID2 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DO_SETD0PID2    (BIT(28))
#define USB_DO_SETD0PID2_M  (USB_DO_SETD0PID2_V << USB_DO_SETD0PID2_S)
#define USB_DO_SETD0PID2_V  0x00000001
#define USB_DO_SETD0PID2_S  28
/** USB_DO_SETD1PID2 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DO_SETD1PID2    (BIT(29))
#define USB_DO_SETD1PID2_M  (USB_DO_SETD1PID2_V << USB_DO_SETD1PID2_S)
#define USB_DO_SETD1PID2_V  0x00000001
#define USB_DO_SETD1PID2_S  29
/** USB_EPDIS2 : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No Endpoint disable
 */
#define USB_EPDIS2    (BIT(30))
#define USB_EPDIS2_M  (USB_EPDIS2_V << USB_EPDIS2_S)
#define USB_EPDIS2_V  0x00000001
#define USB_EPDIS2_S  30
/** USB_EPENA2 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_EPENA2    (BIT(31))
#define USB_EPENA2_M  (USB_EPENA2_V << USB_EPENA2_S)
#define USB_EPENA2_V  0x00000001
#define USB_EPENA2_S  31


/** USB_DOEPTSIZ2_REG register
 *  Device OUT Endpoint 2 Transfer Size Register
 */
#define USB_DOEPTSIZ2_REG (SOC_DPORT_USB_BASE + 0xb50)
/** USB_XFERSIZE2 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size.Indicates the transfer size in bytes for ENDPOINT2
 */
#define USB_XFERSIZE2    0x0000007F
#define USB_XFERSIZE2_M  (USB_XFERSIZE2_V << USB_XFERSIZE2_S)
#define USB_XFERSIZE2_V  0x0000007F
#define USB_XFERSIZE2_S  0
/** USB_PKTCNT2 : R/W; bitpos: [19]; default: 0;
 *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
 *  into the RxFIFO.
 */
#define USB_PKTCNT2    (BIT(19))
#define USB_PKTCNT2_M  (USB_PKTCNT2_V << USB_PKTCNT2_S)
#define USB_PKTCNT2_V  0x00000001
#define USB_PKTCNT2_S  19
/** USB_SUPCNT2 : R/W; bitpos: [31:29]; default: 0;
 *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
 *  data packets the endpoint can receive
 *  2'b01: 1 packet
 *  2'b10: 2 packets
 *  2'b11: 3 packets
 */
#define USB_SUPCNT2    0x00000003
#define USB_SUPCNT2_M  (USB_SUPCNT2_V << USB_SUPCNT2_S)
#define USB_SUPCNT2_V  0x00000003
#define USB_SUPCNT2_S  29


