espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DOEPDMA2_REG register
 *  Device OUT Endpoint 2 DMA Address Register
 */
#define USB_DOEPDMA2_REG (SOC_DPORT_USB_BASE + 0xb54)
/** USB_DMAADDR2 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 */
#define USB_DMAADDR2    0xFFFFFFFF
#define USB_DMAADDR2_M  (USB_DMAADDR2_V << USB_DMAADDR2_S)
#define USB_DMAADDR2_V  0xFFFFFFFF
#define USB_DMAADDR2_S  0


/** USB_DOEPDMAB2_REG register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
#define USB_DOEPDMAB2_REG (SOC_DPORT_USB_BASE + 0xb5c)
/** USB_DMABUFFERADDR2 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_DMABUFFERADDR2    0xFFFFFFFF
#define USB_DMABUFFERADDR2_M  (USB_DMABUFFERADDR2_V << USB_DMABUFFERADDR2_S)
#define USB_DMABUFFERADDR2_V  0xFFFFFFFF
#define USB_DMABUFFERADDR2_S  0


/** USB_DOEPCTL3_REG register
 *  Device Control OUT Endpoint 3 Control Register
 */
#define USB_DOEPCTL3_REG (SOC_DPORT_USB_BASE + 0xb60)
/** USB_MPS3 : RO; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size in bytes
 */
#define USB_MPS3    0x000007FF
#define USB_MPS3_M  (USB_MPS3_V << USB_MPS3_S)
#define USB_MPS3_V  0x000007FF
#define USB_MPS3_S  0
/** USB_USBACTEP3 : RO; bitpos: [15]; default: 1;
 *  0x1: USB Active Endpoint 0
 */
#define USB_USBACTEP3    (BIT(15))
#define USB_USBACTEP3_M  (USB_USBACTEP3_V << USB_USBACTEP3_S)
#define USB_USBACTEP3_V  0x00000001
#define USB_USBACTEP3_S  15
/** USB_NAKSTS3 : RO; bitpos: [17]; default: 0;
 *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
 *  0x1 :The core is transmitting NAK handshakes on this endpoint
 */
#define USB_NAKSTS3    (BIT(17))
#define USB_NAKSTS3_M  (USB_NAKSTS3_V << USB_NAKSTS3_S)
#define USB_NAKSTS3_V  0x00000001
#define USB_NAKSTS3_S  17
/** USB_EPTYPE3 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 3
 */
#define USB_EPTYPE3    0x00000003
#define USB_EPTYPE3_M  (USB_EPTYPE3_V << USB_EPTYPE3_S)
#define USB_EPTYPE3_V  0x00000003
#define USB_EPTYPE3_S  18
/** USB_SNP3 : R/W; bitpos: [20]; default: 0;
 *  0x0 : Reserved 0
 *  0x1 : Reserved 1
 */
#define USB_SNP3    (BIT(20))
#define USB_SNP3_M  (USB_SNP3_V << USB_SNP3_S)
#define USB_SNP3_V  0x00000001
#define USB_SNP3_S  20
/** USB_STALL3 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it, when a SETUP token
 *  is received for this endpoint
 *  0x0 (INACTIVE): No Stall
 *  0x1 (ACTIVE): Stall Handshake
 */
#define USB_STALL3    (BIT(21))
#define USB_STALL3_M  (USB_STALL3_V << USB_STALL3_S)
#define USB_STALL3_V  0x00000001
#define USB_STALL3_S  21
/** USB_CNAK3 : WO; bitpos: [26]; default: 0;
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_CNAK3    (BIT(26))
#define USB_CNAK3_M  (USB_CNAK3_V << USB_CNAK3_S)
#define USB_CNAK3_V  0x00000001
#define USB_CNAK3_S  26
/** USB_DO_SNAK3 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DO_SNAK3    (BIT(27))
#define USB_DO_SNAK3_M  (USB_DO_SNAK3_V << USB_DO_SNAK3_S)
#define USB_DO_SNAK3_V  0x00000001
#define USB_DO_SNAK3_S  27
/** USB_DO_SETD0PID3 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DO_SETD0PID3    (BIT(28))
#define USB_DO_SETD0PID3_M  (USB_DO_SETD0PID3_V << USB_DO_SETD0PID3_S)
#define USB_DO_SETD0PID3_V  0x00000001
#define USB_DO_SETD0PID3_S  28
/** USB_DO_SETD1PID3 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DO_SETD1PID3    (BIT(29))
#define USB_DO_SETD1PID3_M  (USB_DO_SETD1PID3_V << USB_DO_SETD1PID3_S)
#define USB_DO_SETD1PID3_V  0x00000001
#define USB_DO_SETD1PID3_S  29
/** USB_EPDIS3 : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No Endpoint disable
 */
#define USB_EPDIS3    (BIT(30))
#define USB_EPDIS3_M  (USB_EPDIS3_V << USB_EPDIS3_S)
#define USB_EPDIS3_V  0x00000001
#define USB_EPDIS3_S  30
/** USB_EPENA3 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_EPENA3    (BIT(31))
#define USB_EPENA3_M  (USB_EPENA3_V << USB_EPENA3_S)
#define USB_EPENA3_V  0x00000001
#define USB_EPENA3_S  31


/** USB_DOEPTSIZ3_REG register
 *  Device OUT Endpoint 3 Transfer Size Register
 */
#define USB_DOEPTSIZ3_REG (SOC_DPORT_USB_BASE + 0xb70)
/** USB_XFERSIZE3 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size.Indicates the transfer size in bytes for ENDPOINT3
 */
#define USB_XFERSIZE3    0x0000007F
#define USB_XFERSIZE3_M  (USB_XFERSIZE3_V << USB_XFERSIZE3_S)
#define USB_XFERSIZE3_V  0x0000007F
#define USB_XFERSIZE3_S  0
/** USB_PKTCNT3 : R/W; bitpos: [19]; default: 0;
 *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
 *  into the RxFIFO.
 */
#define USB_PKTCNT3    (BIT(19))
#define USB_PKTCNT3_M  (USB_PKTCNT3_V << USB_PKTCNT3_S)
#define USB_PKTCNT3_V  0x00000001
#define USB_PKTCNT3_S  19
/** USB_SUPCNT3 : R/W; bitpos: [31:29]; default: 0;
 *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
 *  data packets the endpoint can receive
 *  2'b01: 1 packet
 *  2'b10: 2 packets
 *  2'b11: 3 packets
 */
#define USB_SUPCNT3    0x00000003
#define USB_SUPCNT3_M  (USB_SUPCNT3_V << USB_SUPCNT3_S)
#define USB_SUPCNT3_V  0x00000003
#define USB_SUPCNT3_S  29


/** USB_DOEPDMA3_REG register
 *  Device OUT Endpoint 3 DMA Address Register
 */
#define USB_DOEPDMA3_REG (SOC_DPORT_USB_BASE + 0xb74)
/** USB_DMAADDR3 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 */
#define USB_DMAADDR3    0xFFFFFFFF
#define USB_DMAADDR3_M  (USB_DMAADDR3_V << USB_DMAADDR3_S)
#define USB_DMAADDR3_V  0xFFFFFFFF
#define USB_DMAADDR3_S  0


/** USB_DOEPDMAB3_REG register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
#define USB_DOEPDMAB3_REG (SOC_DPORT_USB_BASE + 0xb7c)
/** USB_DMABUFFERADDR3 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_DMABUFFERADDR3    0xFFFFFFFF
#define USB_DMABUFFERADDR3_M  (USB_DMABUFFERADDR3_V << USB_DMABUFFERADDR3_S)
#define USB_DMABUFFERADDR3_V  0xFFFFFFFF
#define USB_DMABUFFERADDR3_S  0


/** USB_DOEPCTL4_REG register
 *  Device Control OUT Endpoint 4 Control Register
 */
#define USB_DOEPCTL4_REG (SOC_DPORT_USB_BASE + 0xb80)
/** USB_MPS4 : RO; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size in bytes
 */
#define USB_MPS4    0x000007FF
#define USB_MPS4_M  (USB_MPS4_V << USB_MPS4_S)
#define USB_MPS4_V  0x000007FF
#define USB_MPS4_S  0
/** USB_USBACTEP4 : RO; bitpos: [15]; default: 1;
 *  0x1: USB Active Endpoint 0
 */
#define USB_USBACTEP4    (BIT(15))
#define USB_USBACTEP4_M  (USB_USBACTEP4_V << USB_USBACTEP4_S)
#define USB_USBACTEP4_V  0x00000001
#define USB_USBACTEP4_S  15
/** USB_NAKSTS4 : RO; bitpos: [17]; default: 0;
 *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
 *  0x1 :The core is transmitting NAK handshakes on this endpoint
 */
#define USB_NAKSTS4    (BIT(17))
#define USB_NAKSTS4_M  (USB_NAKSTS4_V << USB_NAKSTS4_S)
#define USB_NAKSTS4_V  0x00000001
#define USB_NAKSTS4_S  17
/** USB_EPTYPE4 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 4
 */
#define USB_EPTYPE4    0x00000003
#define USB_EPTYPE4_M  (USB_EPTYPE4_V << USB_EPTYPE4_S)
#define USB_EPTYPE4_V  0x00000003
#define USB_EPTYPE4_S  18
/** USB_SNP4 : R/W; bitpos: [20]; default: 0;
 *  0x0 : Reserved 0
 *  0x1 : Reserved 1
 */
#define USB_SNP4    (BIT(20))
#define USB_SNP4_M  (USB_SNP4_V << USB_SNP4_S)
#define USB_SNP4_V  0x00000001
#define USB_SNP4_S  20
/** USB_STALL4 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it, when a SETUP token
 *  is received for this endpoint
 *  0x0 (INACTIVE): No Stall
 *  0x1 (ACTIVE): Stall Handshake
 */
#define USB_STALL4    (BIT(21))
#define USB_STALL4_M  (USB_STALL4_V << USB_STALL4_S)
#define USB_STALL4_V  0x00000001
#define USB_STALL4_S  21
/** USB_CNAK4 : WO; bitpos: [26]; default: 0;
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_CNAK4    (BIT(26))
#define USB_CNAK4_M  (USB_CNAK4_V << USB_CNAK4_S)
#define USB_CNAK4_V  0x00000001
#define USB_CNAK4_S  26
/** USB_DO_SNAK4 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DO_SNAK4    (BIT(27))
#define USB_DO_SNAK4_M  (USB_DO_SNAK4_V << USB_DO_SNAK4_S)
#define USB_DO_SNAK4_V  0x00000001
#define USB_DO_SNAK4_S  27
/** USB_DO_SETD0PID4 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DO_SETD0PID4    (BIT(28))
#define USB_DO_SETD0PID4_M  (USB_DO_SETD0PID4_V << USB_DO_SETD0PID4_S)
#define USB_DO_SETD0PID4_V  0x00000001
#define USB_DO_SETD0PID4_S  28
/** USB_DO_SETD1PID4 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DO_SETD1PID4    (BIT(29))
#define USB_DO_SETD1PID4_M  (USB_DO_SETD1PID4_V << USB_DO_SETD1PID4_S)
#define USB_DO_SETD1PID4_V  0x00000001
#define USB_DO_SETD1PID4_S  29
/** USB_EPDIS4 : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No Endpoint disable
 */
#define USB_EPDIS4    (BIT(30))
#define USB_EPDIS4_M  (USB_EPDIS4_V << USB_EPDIS4_S)
#define USB_EPDIS4_V  0x00000001
#define USB_EPDIS4_S  30
/** USB_EPENA4 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_EPENA4    (BIT(31))
#define USB_EPENA4_M  (USB_EPENA4_V << USB_EPENA4_S)
#define USB_EPENA4_V  0x00000001
#define USB_EPENA4_S  31


/** USB_DOEPTSIZ4_REG register
 *  Device OUT Endpoint 4 Transfer Size Register
 */
#define USB_DOEPTSIZ4_REG (SOC_DPORT_USB_BASE + 0xb90)
/** USB_XFERSIZE4 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size.Indicates the transfer size in bytes for ENDPOINT4
 */
#define USB_XFERSIZE4    0x0000007F
#define USB_XFERSIZE4_M  (USB_XFERSIZE4_V << USB_XFERSIZE4_S)
#define USB_XFERSIZE4_V  0x0000007F
#define USB_XFERSIZE4_S  0
/** USB_PKTCNT4 : R/W; bitpos: [19]; default: 0;
 *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
 *  into the RxFIFO.
 */
#define USB_PKTCNT4    (BIT(19))
#define USB_PKTCNT4_M  (USB_PKTCNT4_V << USB_PKTCNT4_S)
#define USB_PKTCNT4_V  0x00000001
#define USB_PKTCNT4_S  19
/** USB_SUPCNT4 : R/W; bitpos: [31:29]; default: 0;
 *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
 *  data packets the endpoint can receive
 *  2'b01: 1 packet
 *  2'b10: 2 packets
 *  2'b11: 3 packets
 */
#define USB_SUPCNT4    0x00000003
#define USB_SUPCNT4_M  (USB_SUPCNT4_V << USB_SUPCNT4_S)
#define USB_SUPCNT4_V  0x00000003
#define USB_SUPCNT4_S  29


/** USB_DOEPDMA4_REG register
 *  Device OUT Endpoint 4 DMA Address Register
 */
#define USB_DOEPDMA4_REG (SOC_DPORT_USB_BASE + 0xb94)
/** USB_DMAADDR4 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 */
#define USB_DMAADDR4    0xFFFFFFFF
#define USB_DMAADDR4_M  (USB_DMAADDR4_V << USB_DMAADDR4_S)
#define USB_DMAADDR4_V  0xFFFFFFFF
#define USB_DMAADDR4_S  0


/** USB_DOEPDMAB4_REG register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
#define USB_DOEPDMAB4_REG (SOC_DPORT_USB_BASE + 0xb9c)
/** USB_DMABUFFERADDR4 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_DMABUFFERADDR4    0xFFFFFFFF
#define USB_DMABUFFERADDR4_M  (USB_DMABUFFERADDR4_V << USB_DMABUFFERADDR4_S)
#define USB_DMABUFFERADDR4_V  0xFFFFFFFF
#define USB_DMABUFFERADDR4_S  0


/** USB_DOEPCTL5_REG register
 *  Device Control OUT Endpoint 5 Control Register
 */
#define USB_DOEPCTL5_REG (SOC_DPORT_USB_BASE + 0xba0)
/** USB_MPS5 : RO; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size in bytes
 */
#define USB_MPS5    0x000007FF
#define USB_MPS5_M  (USB_MPS5_V << USB_MPS5_S)
#define USB_MPS5_V  0x000007FF
#define USB_MPS5_S  0
/** USB_USBACTEP5 : RO; bitpos: [15]; default: 1;
 *  0x1: USB Active Endpoint 0
 */
#define USB_USBACTEP5    (BIT(15))
#define USB_USBACTEP5_M  (USB_USBACTEP5_V << USB_USBACTEP5_S)
#define USB_USBACTEP5_V  0x00000001
#define USB_USBACTEP5_S  15
/** USB_NAKSTS5 : RO; bitpos: [17]; default: 0;
 *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
 *  0x1 :The core is transmitting NAK handshakes on this endpoint
 */
#define USB_NAKSTS5    (BIT(17))
#define USB_NAKSTS5_M  (USB_NAKSTS5_V << USB_NAKSTS5_S)
#define USB_NAKSTS5_V  0x00000001
#define USB_NAKSTS5_S  17
/** USB_EPTYPE5 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 5
 */
#define USB_EPTYPE5    0x00000003
#define USB_EPTYPE5_M  (USB_EPTYPE5_V << USB_EPTYPE5_S)
#define USB_EPTYPE5_V  0x00000003
#define USB_EPTYPE5_S  18
/** USB_SNP5 : R/W; bitpos: [20]; default: 0;
 *  0x0 : Reserved 0
 *  0x1 : Reserved 1
 */
#define USB_SNP5    (BIT(20))
#define USB_SNP5_M  (USB_SNP5_V << USB_SNP5_S)
#define USB_SNP5_V  0x00000001
#define USB_SNP5_S  20
/** USB_STALL5 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it, when a SETUP token
 *  is received for this endpoint
 *  0x0 (INACTIVE): No Stall
 *  0x1 (ACTIVE): Stall Handshake
 */
#define USB_STALL5    (BIT(21))
#define USB_STALL5_M  (USB_STALL5_V << USB_STALL5_S)
#define USB_STALL5_V  0x00000001
#define USB_STALL5_S  21
/** USB_CNAK5 : WO; bitpos: [26]; default: 0;
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_CNAK5    (BIT(26))
#define USB_CNAK5_M  (USB_CNAK5_V << USB_CNAK5_S)
#define USB_CNAK5_V  0x00000001
#define USB_CNAK5_S  26
/** USB_DO_SNAK5 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DO_SNAK5    (BIT(27))
#define USB_DO_SNAK5_M  (USB_DO_SNAK5_V << USB_DO_SNAK5_S)
#define USB_DO_SNAK5_V  0x00000001
#define USB_DO_SNAK5_S  27
/** USB_DO_SETD0PID5 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DO_SETD0PID5    (BIT(28))
#define USB_DO_SETD0PID5_M  (USB_DO_SETD0PID5_V << USB_DO_SETD0PID5_S)
#define USB_DO_SETD0PID5_V  0x00000001
#define USB_DO_SETD0PID5_S  28
/** USB_DO_SETD1PID5 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DO_SETD1PID5    (BIT(29))
#define USB_DO_SETD1PID5_M  (USB_DO_SETD1PID5_V << USB_DO_SETD1PID5_S)
#define USB_DO_SETD1PID5_V  0x00000001
#define USB_DO_SETD1PID5_S  29
/** USB_EPDIS5 : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No Endpoint disable
 */
#define USB_EPDIS5    (BIT(30))
#define USB_EPDIS5_M  (USB_EPDIS5_V << USB_EPDIS5_S)
#define USB_EPDIS5_V  0x00000001
#define USB_EPDIS5_S  30
/** USB_EPENA5 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_EPENA5    (BIT(31))
#define USB_EPENA5_M  (USB_EPENA5_V << USB_EPENA5_S)
#define USB_EPENA5_V  0x00000001
#define USB_EPENA5_S  31


/** USB_DOEPTSIZ5_REG register
 *  Device OUT Endpoint 5 Transfer Size Register
 */
#define USB_DOEPTSIZ5_REG (SOC_DPORT_USB_BASE + 0xbb0)
/** USB_XFERSIZE5 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size.Indicates the transfer size in bytes for ENDPOINT5
 */
#define USB_XFERSIZE5    0x0000007F
#define USB_XFERSIZE5_M  (USB_XFERSIZE5_V << USB_XFERSIZE5_S)
#define USB_XFERSIZE5_V  0x0000007F
#define USB_XFERSIZE5_S  0
/** USB_PKTCNT5 : R/W; bitpos: [19]; default: 0;
 *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
 *  into the RxFIFO.
 */
#define USB_PKTCNT5    (BIT(19))
#define USB_PKTCNT5_M  (USB_PKTCNT5_V << USB_PKTCNT5_S)
#define USB_PKTCNT5_V  0x00000001
#define USB_PKTCNT5_S  19
/** USB_SUPCNT5 : R/W; bitpos: [31:29]; default: 0;
 *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
 *  data packets the endpoint can receive
 *  2'b01: 1 packet
 *  2'b10: 2 packets
 *  2'b11: 3 packets
 */
#define USB_SUPCNT5    0x00000003
#define USB_SUPCNT5_M  (USB_SUPCNT5_V << USB_SUPCNT5_S)
#define USB_SUPCNT5_V  0x00000003
#define USB_SUPCNT5_S  29


