espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DOEPDMA5_REG register
 *  Device OUT Endpoint 5 DMA Address Register
 */
#define USB_DOEPDMA5_REG (SOC_DPORT_USB_BASE + 0xbb4)
/** USB_DMAADDR5 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 */
#define USB_DMAADDR5    0xFFFFFFFF
#define USB_DMAADDR5_M  (USB_DMAADDR5_V << USB_DMAADDR5_S)
#define USB_DMAADDR5_V  0xFFFFFFFF
#define USB_DMAADDR5_S  0


/** USB_DOEPDMAB5_REG register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
#define USB_DOEPDMAB5_REG (SOC_DPORT_USB_BASE + 0xbbc)
/** USB_DMABUFFERADDR5 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_DMABUFFERADDR5    0xFFFFFFFF
#define USB_DMABUFFERADDR5_M  (USB_DMABUFFERADDR5_V << USB_DMABUFFERADDR5_S)
#define USB_DMABUFFERADDR5_V  0xFFFFFFFF
#define USB_DMABUFFERADDR5_S  0


/** USB_DOEPCTL6_REG register
 *  Device Control OUT Endpoint 6 Control Register
 */
#define USB_DOEPCTL6_REG (SOC_DPORT_USB_BASE + 0xbc0)
/** USB_MPS6 : RO; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size in bytes
 */
#define USB_MPS6    0x000007FF
#define USB_MPS6_M  (USB_MPS6_V << USB_MPS6_S)
#define USB_MPS6_V  0x000007FF
#define USB_MPS6_S  0
/** USB_USBACTEP6 : RO; bitpos: [15]; default: 1;
 *  0x1: USB Active Endpoint 0
 */
#define USB_USBACTEP6    (BIT(15))
#define USB_USBACTEP6_M  (USB_USBACTEP6_V << USB_USBACTEP6_S)
#define USB_USBACTEP6_V  0x00000001
#define USB_USBACTEP6_S  15
/** USB_NAKSTS6 : RO; bitpos: [17]; default: 0;
 *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
 *  0x1 :The core is transmitting NAK handshakes on this endpoint
 */
#define USB_NAKSTS6    (BIT(17))
#define USB_NAKSTS6_M  (USB_NAKSTS6_V << USB_NAKSTS6_S)
#define USB_NAKSTS6_V  0x00000001
#define USB_NAKSTS6_S  17
/** USB_EPTYPE6 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 6
 */
#define USB_EPTYPE6    0x00000003
#define USB_EPTYPE6_M  (USB_EPTYPE6_V << USB_EPTYPE6_S)
#define USB_EPTYPE6_V  0x00000003
#define USB_EPTYPE6_S  18
/** USB_SNP6 : R/W; bitpos: [20]; default: 0;
 *  0x0 : Reserved 0
 *  0x1 : Reserved 1
 */
#define USB_SNP6    (BIT(20))
#define USB_SNP6_M  (USB_SNP6_V << USB_SNP6_S)
#define USB_SNP6_V  0x00000001
#define USB_SNP6_S  20
/** USB_STALL6 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it, when a SETUP token
 *  is received for this endpoint
 *  0x0 (INACTIVE): No Stall
 *  0x1 (ACTIVE): Stall Handshake
 */
#define USB_STALL6    (BIT(21))
#define USB_STALL6_M  (USB_STALL6_V << USB_STALL6_S)
#define USB_STALL6_V  0x00000001
#define USB_STALL6_S  21
/** USB_CNAK6 : WO; bitpos: [26]; default: 0;
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_CNAK6    (BIT(26))
#define USB_CNAK6_M  (USB_CNAK6_V << USB_CNAK6_S)
#define USB_CNAK6_V  0x00000001
#define USB_CNAK6_S  26
/** USB_DO_SNAK6 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DO_SNAK6    (BIT(27))
#define USB_DO_SNAK6_M  (USB_DO_SNAK6_V << USB_DO_SNAK6_S)
#define USB_DO_SNAK6_V  0x00000001
#define USB_DO_SNAK6_S  27
/** USB_DO_SETD0PID6 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DO_SETD0PID6    (BIT(28))
#define USB_DO_SETD0PID6_M  (USB_DO_SETD0PID6_V << USB_DO_SETD0PID6_S)
#define USB_DO_SETD0PID6_V  0x00000001
#define USB_DO_SETD0PID6_S  28
/** USB_DO_SETD1PID6 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DO_SETD1PID6    (BIT(29))
#define USB_DO_SETD1PID6_M  (USB_DO_SETD1PID6_V << USB_DO_SETD1PID6_S)
#define USB_DO_SETD1PID6_V  0x00000001
#define USB_DO_SETD1PID6_S  29
/** USB_EPDIS6 : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No Endpoint disable
 */
#define USB_EPDIS6    (BIT(30))
#define USB_EPDIS6_M  (USB_EPDIS6_V << USB_EPDIS6_S)
#define USB_EPDIS6_V  0x00000001
#define USB_EPDIS6_S  30
/** USB_EPENA6 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_EPENA6    (BIT(31))
#define USB_EPENA6_M  (USB_EPENA6_V << USB_EPENA6_S)
#define USB_EPENA6_V  0x00000001
#define USB_EPENA6_S  31


/** USB_DOEPTSIZ6_REG register
 *  Device OUT Endpoint 6 Transfer Size Register
 */
#define USB_DOEPTSIZ6_REG (SOC_DPORT_USB_BASE + 0xbd0)
/** USB_XFERSIZE6 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size.Indicates the transfer size in bytes for ENDPOINT6
 */
#define USB_XFERSIZE6    0x0000007F
#define USB_XFERSIZE6_M  (USB_XFERSIZE6_V << USB_XFERSIZE6_S)
#define USB_XFERSIZE6_V  0x0000007F
#define USB_XFERSIZE6_S  0
/** USB_PKTCNT6 : R/W; bitpos: [19]; default: 0;
 *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
 *  into the RxFIFO.
 */
#define USB_PKTCNT6    (BIT(19))
#define USB_PKTCNT6_M  (USB_PKTCNT6_V << USB_PKTCNT6_S)
#define USB_PKTCNT6_V  0x00000001
#define USB_PKTCNT6_S  19
/** USB_SUPCNT6 : R/W; bitpos: [31:29]; default: 0;
 *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
 *  data packets the endpoint can receive
 *  2'b01: 1 packet
 *  2'b10: 2 packets
 *  2'b11: 3 packets
 */
#define USB_SUPCNT6    0x00000003
#define USB_SUPCNT6_M  (USB_SUPCNT6_V << USB_SUPCNT6_S)
#define USB_SUPCNT6_V  0x00000003
#define USB_SUPCNT6_S  29


/** USB_DOEPDMA6_REG register
 *  Device OUT Endpoint 6 DMA Address Register
 */
#define USB_DOEPDMA6_REG (SOC_DPORT_USB_BASE + 0xbd4)
/** USB_DMAADDR6 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 */
#define USB_DMAADDR6    0xFFFFFFFF
#define USB_DMAADDR6_M  (USB_DMAADDR6_V << USB_DMAADDR6_S)
#define USB_DMAADDR6_V  0xFFFFFFFF
#define USB_DMAADDR6_S  0


/** USB_DOEPDMAB6_REG register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
#define USB_DOEPDMAB6_REG (SOC_DPORT_USB_BASE + 0xbdc)
/** USB_DMABUFFERADDR6 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_DMABUFFERADDR6    0xFFFFFFFF
#define USB_DMABUFFERADDR6_M  (USB_DMABUFFERADDR6_V << USB_DMABUFFERADDR6_S)
#define USB_DMABUFFERADDR6_V  0xFFFFFFFF
#define USB_DMABUFFERADDR6_S  0


/** USB_PCGCCTL_REG register
 *  Power and Clock Gating Control Register
 */
#define USB_PCGCCTL_REG (SOC_DPORT_USB_BASE + 0xe00)
/** USB_STOPPCLK : R/W; bitpos: [0]; default: 0;
 *  0x0 : Disable Stop Pclk
 *  0x1 : Enable Stop Pclk
 */
#define USB_STOPPCLK    (BIT(0))
#define USB_STOPPCLK_M  (USB_STOPPCLK_V << USB_STOPPCLK_S)
#define USB_STOPPCLK_V  0x00000001
#define USB_STOPPCLK_S  0
/** USB_GATEHCLK : R/W; bitpos: [1]; default: 0;
 *  gate hclk
 *  0x0:clears this bit when USB is resumed or a new session starts
 *  0x1:set this bit to gate hclk to modules, when the USB is suspended or the session
 *  is not valid
 */
#define USB_GATEHCLK    (BIT(1))
#define USB_GATEHCLK_M  (USB_GATEHCLK_V << USB_GATEHCLK_S)
#define USB_GATEHCLK_V  0x00000001
#define USB_GATEHCLK_S  1
/** USB_PWRCLMP : R/W; bitpos: [2]; default: 0;
 *  0x0:Clears this bit to disable the clamping before the power is turned on
 *  0x1:In only Partial Power-Down mode, sets this bit to clamp the signals between the
 *  power-on modules and the power-off modules before the power is turned off
 */
#define USB_PWRCLMP    (BIT(2))
#define USB_PWRCLMP_M  (USB_PWRCLMP_V << USB_PWRCLMP_S)
#define USB_PWRCLMP_V  0x00000001
#define USB_PWRCLMP_S  2
/** USB_RSTPDWNMODULE : R/W; bitpos: [3]; default: 0;
 *  Reset Power-Down Modules.
 *  0x0 : Power is turned on
 *  0x1 : Power is turned off
 */
#define USB_RSTPDWNMODULE    (BIT(3))
#define USB_RSTPDWNMODULE_M  (USB_RSTPDWNMODULE_V << USB_RSTPDWNMODULE_S)
#define USB_RSTPDWNMODULE_V  0x00000001
#define USB_RSTPDWNMODULE_S  3
/** USB_PHYSLEEP : RO; bitpos: [6]; default: 0;
 *  0x0 : Phy not in Sleep state
 *  0x1 : Phy in Sleep state
 */
#define USB_PHYSLEEP    (BIT(6))
#define USB_PHYSLEEP_M  (USB_PHYSLEEP_V << USB_PHYSLEEP_S)
#define USB_PHYSLEEP_V  0x00000001
#define USB_PHYSLEEP_S  6
/** USB_L1SUSPENDED : RO; bitpos: [7]; default: 0;
 *  L1 Deep Sleep
 *  0x0 : Non Deep Sleep
 *  0x1 : Deep Sleep
 */
#define USB_L1SUSPENDED    (BIT(7))
#define USB_L1SUSPENDED_M  (USB_L1SUSPENDED_V << USB_L1SUSPENDED_S)
#define USB_L1SUSPENDED_V  0x00000001
#define USB_L1SUSPENDED_S  7
/** USB_RESETAFTERSUSP : R/W; bitpos: [8]; default: 0;
 *  Reset after suspend
 *  0x0 : In Host-only mode, host issues Resume after Suspend
 *  0x1 : In Host-only mode, host sets this bit before clamp is removed if the host
 *  needs to issue Reset after Suspend
 */
#define USB_RESETAFTERSUSP    (BIT(8))
#define USB_RESETAFTERSUSP_M  (USB_RESETAFTERSUSP_V << USB_RESETAFTERSUSP_S)
#define USB_RESETAFTERSUSP_V  0x00000001
#define USB_RESETAFTERSUSP_S  8




/** Interrupt registers */
/** USB_GOTGINT_REG register
 *  OTG Interrupt Register
 */
#define USB_GOTGINT_REG (SOC_DPORT_USB_BASE + 0x4)
/** USB_SESENDDET : R/W1C; bitpos: [2]; default: 0;
 *  Session End Detected.The controller sets this bit when the utmiotg_bvalid signal is
 *  deasserted. This bit can be set only by the core and the application should write 1
 *  to clear it
 */
#define USB_SESENDDET    (BIT(2))
#define USB_SESENDDET_M  (USB_SESENDDET_V << USB_SESENDDET_S)
#define USB_SESENDDET_V  0x00000001
#define USB_SESENDDET_S  2
/** USB_SESREQSUCSTSCHNG : R/W1C; bitpos: [8]; default: 0;
 *  Session Request Success Status Change.The core sets this bit on the success or
 *  failure of a session request.The application must read the Session Request Success
 *  bit in the OTG Control and Status register (GOTGCTL_REG.USB_SESREQSCS) to check for
 *  success or failure. This bit can be set only by the core and the application should
 *  write 1 to clear it.
 */
#define USB_SESREQSUCSTSCHNG    (BIT(8))
#define USB_SESREQSUCSTSCHNG_M  (USB_SESREQSUCSTSCHNG_V << USB_SESREQSUCSTSCHNG_S)
#define USB_SESREQSUCSTSCHNG_V  0x00000001
#define USB_SESREQSUCSTSCHNG_S  8
/** USB_HSTNEGSUCSTSCHNG : R/W1C; bitpos: [9]; default: 0;
 *  Host Negotiation Success Status Change. The core sets this bit on the success or
 *  failure of a USB host negotiation request. The application must read the Host
 *  Negotiation Success bit of the OTG Control and Status register
 *  (GOTGCTL_REG.USB_HSTNEGSCS) to check for success or failure. This bit can be set
 *  only by the core and the application should write 1 to clear it
 */
#define USB_HSTNEGSUCSTSCHNG    (BIT(9))
#define USB_HSTNEGSUCSTSCHNG_M  (USB_HSTNEGSUCSTSCHNG_V << USB_HSTNEGSUCSTSCHNG_S)
#define USB_HSTNEGSUCSTSCHNG_V  0x00000001
#define USB_HSTNEGSUCSTSCHNG_S  9
/** USB_HSTNEGDET : R/W1C; bitpos: [17]; default: 0;
 *  Host Negotiation Detected.The core sets this bit when it detects a host negotiation
 *  request on the USB. This bit can be set only by the core and the application should
 *  write 1 to clear it.
 */
#define USB_HSTNEGDET    (BIT(17))
#define USB_HSTNEGDET_M  (USB_HSTNEGDET_V << USB_HSTNEGDET_S)
#define USB_HSTNEGDET_V  0x00000001
#define USB_HSTNEGDET_S  17
/** USB_ADEVTOUTCHG : R/W1C; bitpos: [18]; default: 0;
 *  A-Device Timeout Change. The core sets this bit to indicate that the A-device has
 *  timed out while waiting for the B-device to connect.This bit can be set only by the
 *  core and the application should write 1 to clear it
 */
#define USB_ADEVTOUTCHG    (BIT(18))
#define USB_ADEVTOUTCHG_M  (USB_ADEVTOUTCHG_V << USB_ADEVTOUTCHG_S)
#define USB_ADEVTOUTCHG_V  0x00000001
#define USB_ADEVTOUTCHG_S  18
/** USB_DBNCEDONE : R/W1C; bitpos: [19]; default: 0;
 *  Debounce Done. The core sets this bit when the debounce is completed after the
 *  device connect. The application can start driving USB reset after seeing this
 *  interrupt. This bit is only valid when the HNP Capable or SRP Capable bit is SET in
 *  the Core USB Configuration register (GUSBCFG.HNPCap or GUSBCFG.SRPCap,
 *  respectively). This bit can be set only by the core and the application should
 *  write 1 to clear it
 */
#define USB_DBNCEDONE    (BIT(19))
#define USB_DBNCEDONE_M  (USB_DBNCEDONE_V << USB_DBNCEDONE_S)
#define USB_DBNCEDONE_V  0x00000001
#define USB_DBNCEDONE_S  19


