espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_GINTSTS_REG register
 *  Interrupt Register
 */
#define USB_GINTSTS_REG (SOC_DPORT_USB_BASE + 0x14)
/** USB_CURMOD_INT : RO; bitpos: [0]; default: 0;
 *  Current Mode of Operation
 *  1'b0: Device mode
 *  1'b1: Host mode
 */
#define USB_CURMOD_INT    (BIT(0))
#define USB_CURMOD_INT_M  (USB_CURMOD_INT_V << USB_CURMOD_INT_S)
#define USB_CURMOD_INT_V  0x00000001
#define USB_CURMOD_INT_S  0
/** USB_MODEMIS : R/W1C; bitpos: [1]; default: 0;
 *  Mode Mismatch Interrupt.The core sets this bit when the application is trying to
 *  access:A Host mode register, when the controller is operating in Device mode
 */
#define USB_MODEMIS    (BIT(1))
#define USB_MODEMIS_M  (USB_MODEMIS_V << USB_MODEMIS_S)
#define USB_MODEMIS_V  0x00000001
#define USB_MODEMIS_S  1
/** USB_OTGINT : RO; bitpos: [2]; default: 0;
 *  OTG Interrupt.The controller sets this bit to indicate an OTG protocol event. The
 *  application must read the OTG Interrupt Status (GOTGINT_REG) register to determine
 *  the exact event that caused this interrupt. The application must clear the
 *  appropriate status bit in the GOTGINT_REG register to clear this bit.
 */
#define USB_OTGINT    (BIT(2))
#define USB_OTGINT_M  (USB_OTGINT_V << USB_OTGINT_S)
#define USB_OTGINT_V  0x00000001
#define USB_OTGINT_S  2
/** USB_SOF : R/W1C; bitpos: [3]; default: 0;
 *  Start of (micro)Frame (Sof)
 *  In Host mode, the core sets this bit to indicate that an SOF (FS), micro-SOF (HS),
 *  or Keep-Alive (LS) is transmitted on the USB. The application must write a 1 to
 *  this bit to clear the interrupt
 *  In Device mode, the controller sets this bit to indicate that an SOF token has been
 *  received on the USB. The application can read the Device Status register to get the
 *  current (micro)Frame number. This Interrupt is seen only when the core is operating
 *  at either HS or FS. This bit can be set only by the core and the application must
 *  write 1 to clear it
 */
#define USB_SOF    (BIT(3))
#define USB_SOF_M  (USB_SOF_V << USB_SOF_S)
#define USB_SOF_V  0x00000001
#define USB_SOF_S  3
/** USB_RXFLVI : RO; bitpos: [4]; default: 0;
 *  RxFIFO Non-Empty.Indicates that there is at least one packet pending to be read
 *  from the RxFIFO
 *  1'b0: Rx Fifo is empty
 *  1'b1: Rx Fifo is not empty
 */
#define USB_RXFLVI    (BIT(4))
#define USB_RXFLVI_M  (USB_RXFLVI_V << USB_RXFLVI_S)
#define USB_RXFLVI_V  0x00000001
#define USB_RXFLVI_S  4
/** USB_NPTXFEMP : RO; bitpos: [5]; default: 0;
 *  Non-periodic TxFIFO Empty.This interrupt is asserted when the Non-periodic TxFIFO
 *  is either half or completely empty, and there is space for at least one Entry to be
 *  written to the Non-periodic Transmit Request Queue. The half or completely empty
 *  status is determined by the Non-periodic TxFIFO Empty Level bit in the Core AHB
 *  Configuration register (GAHBCFG_REG.USB_NPTXFEMPLVL).
 */
#define USB_NPTXFEMP    (BIT(5))
#define USB_NPTXFEMP_M  (USB_NPTXFEMP_V << USB_NPTXFEMP_S)
#define USB_NPTXFEMP_V  0x00000001
#define USB_NPTXFEMP_S  5
/** USB_GINNAKEFF : RO; bitpos: [6]; default: 0;
 *  Device only.Global IN Non-periodic NAK Effective.Indicates that the Set Global
 *  Non-periodic IN NAK bit in the Device Control register (DCTL.SGNPInNak) set by the
 *  application, has taken effect in the core. That is, the core has sampled the Global
 *  IN NAK bit Set by the application. This bit can be cleared by clearing the Clear
 *  Global Non-periodic IN NAK bit in the Device Control register (DCTL.CGNPInNak).
 *  This interrupt does not necessarily mean that a NAK handshake is sent out on the
 *  USB. The STALL bit takes precedence over the NAK bit.
 */
#define USB_GINNAKEFF    (BIT(6))
#define USB_GINNAKEFF_M  (USB_GINNAKEFF_V << USB_GINNAKEFF_S)
#define USB_GINNAKEFF_V  0x00000001
#define USB_GINNAKEFF_S  6
/** USB_GOUTNAKEFF : RO; bitpos: [7]; default: 0;
 *  Device only.Global OUT NAK Effective.Indicates that the Set Global OUT NAK bit in
 *  the Device Control register (DCTL_REG.USB_SGOUTNAK), Set by the application, has
 *  taken effect in the core. This bit can be cleared by writing the Clear Global OUT
 *  NAK bit in the Device Control register (DCTL_REG.REG_CGOUTNAK).
 */
#define USB_GOUTNAKEFF    (BIT(7))
#define USB_GOUTNAKEFF_M  (USB_GOUTNAKEFF_V << USB_GOUTNAKEFF_S)
#define USB_GOUTNAKEFF_V  0x00000001
#define USB_GOUTNAKEFF_S  7
/** USB_ERLYSUSP : R/W1C; bitpos: [10]; default: 0;
 *  Device only.Early Suspend.The controller sets this bit to indicate that an Idle
 *  state has been detected on the USB for 3 ms.
 */
#define USB_ERLYSUSP    (BIT(10))
#define USB_ERLYSUSP_M  (USB_ERLYSUSP_V << USB_ERLYSUSP_S)
#define USB_ERLYSUSP_V  0x00000001
#define USB_ERLYSUSP_S  10
/** USB_USBSUSP : R/W1C; bitpos: [11]; default: 0;
 *  Device only.USB Suspend.The controller sets this bit to indicate that a suspend was
 *  detected on the USB. The controller enters the Suspended state when there is no
 *  activity on the linestate signal for an extended period of time.
 */
#define USB_USBSUSP    (BIT(11))
#define USB_USBSUSP_M  (USB_USBSUSP_V << USB_USBSUSP_S)
#define USB_USBSUSP_V  0x00000001
#define USB_USBSUSP_S  11
/** USB_USBRST : R/W1C; bitpos: [12]; default: 0;
 *  Device only.USB Reset.The controller sets this bit to indicate that a reset is
 *  detected on the USB
 */
#define USB_USBRST    (BIT(12))
#define USB_USBRST_M  (USB_USBRST_V << USB_USBRST_S)
#define USB_USBRST_V  0x00000001
#define USB_USBRST_S  12
/** USB_ENUMDONE : R/W1C; bitpos: [13]; default: 0;
 *  Device only.Enumeration Done.The core sets this bit to indicate that speed
 *  enumeration is complete. The application must read the Device Status (DSTS_REG)
 *  register to obtain the enumerated speed.
 */
#define USB_ENUMDONE    (BIT(13))
#define USB_ENUMDONE_M  (USB_ENUMDONE_V << USB_ENUMDONE_S)
#define USB_ENUMDONE_V  0x00000001
#define USB_ENUMDONE_S  13
/** USB_ISOOUTDROP : R/W1C; bitpos: [14]; default: 0;
 *  Device only.Isochronous OUT Packet Dropped Interrupt.The controller sets this bit
 *  when it fails to write an isochronous OUT packet into the RxFIFO because the RxFIFO
 *  does not have enough space to accommodate a maximum packet size packet for the
 *  isochronous OUT endpoint.
 */
#define USB_ISOOUTDROP    (BIT(14))
#define USB_ISOOUTDROP_M  (USB_ISOOUTDROP_V << USB_ISOOUTDROP_S)
#define USB_ISOOUTDROP_V  0x00000001
#define USB_ISOOUTDROP_S  14
/** USB_EOPF : R/W1C; bitpos: [15]; default: 0;
 *  Device only.End of Periodic Frame Interrupt.Indicates that the period specified in
 *  the Periodic Frame Interval field of the Device Configuration register
 *  (DCFG_REG.REG_PERFRINT) has been reached in the current microframe.
 */
#define USB_EOPF    (BIT(15))
#define USB_EOPF_M  (USB_EOPF_V << USB_EOPF_S)
#define USB_EOPF_V  0x00000001
#define USB_EOPF_S  15
/** USB_EPMIS : R/W1C; bitpos: [17]; default: 0;
 *  Device only.Endpoint Mismatch Interrupt.This interrupt is valid only in shared FIFO
 *  operation.Indicates that an IN token has been received for a non-periodic endpoint,
 *  but the data for another endpoint is present in the top of the Non-periodic
 *  Transmit FIFO and the IN endpoint mismatch count programmed by the application has
 *  expired.
 */
#define USB_EPMIS    (BIT(17))
#define USB_EPMIS_M  (USB_EPMIS_V << USB_EPMIS_S)
#define USB_EPMIS_V  0x00000001
#define USB_EPMIS_S  17
/** USB_IEPINT : RO; bitpos: [18]; default: 0;
 *  Device only.IN Endpoints Interrupt.The core sets this bit to indicate that an
 *  interrupt is pending on one of the IN endpoints of the core (in Device mode). The
 *  application must read the Device All Endpoints Interrupt (DAINT) register to
 *  determine the exact number of the IN endpoint on Device IN Endpoint-n Interrupt
 *  (DIEPINTn) register to determine the exact cause of the interrupt. The application
 *  must clear the appropriate status bit in the corresponding DIEPINTn register to
 *  clear this bit.
 */
#define USB_IEPINT    (BIT(18))
#define USB_IEPINT_M  (USB_IEPINT_V << USB_IEPINT_S)
#define USB_IEPINT_V  0x00000001
#define USB_IEPINT_S  18
/** USB_OEPINT : RO; bitpos: [19]; default: 0;
 *  Device only.OUT Endpoints Interrupt.The controller sets this bit to indicate that
 *  an interrupt is pending on one of the OUT endpoints of the core (in Device mode).
 *  The application must read the Device All Endpoints Interrupt (DAINT) register to
 *  determine the exact number of the OUT endpoint on which the interrupt occurred, and
 *  then read the corresponding Device OUT Endpoint-n Interrupt (DOEPINTn) register to
 *  determine the exact cause of the interrupt. The application must clear the
 *  appropriate status bit in the corresponding DOEPINTn register to clear this bit.
 */
#define USB_OEPINT    (BIT(19))
#define USB_OEPINT_M  (USB_OEPINT_V << USB_OEPINT_S)
#define USB_OEPINT_V  0x00000001
#define USB_OEPINT_S  19
/** USB_INCOMPISOIN : R/W1C; bitpos: [20]; default: 0;
 *  Device only.Incomplete Isochronous IN Transfer.The core sets this interrupt to
 *  indicate that there is at least one isochronous IN endpoint on which the transfer
 *  is not completed in the current microframe. This interrupt is asserted along with
 *  the End of Periodic Frame Interrupt (EOPF) bit in this register.
 */
#define USB_INCOMPISOIN    (BIT(20))
#define USB_INCOMPISOIN_M  (USB_INCOMPISOIN_V << USB_INCOMPISOIN_S)
#define USB_INCOMPISOIN_V  0x00000001
#define USB_INCOMPISOIN_S  20
/** USB_INCOMPIP : R/W1C; bitpos: [21]; default: 0;
 *  In Host mode, the core sets this interrupt bit when there are incomplete periodic
 *  transactions still pending which are scheduled for the current microframe.The
 *  Device mode, the core sets this interrupt to indicate that thereis at least one
 *  isochronous OUT endpoint on which the transfer is not completed in the current
 *  microframe. This interrupt is asserted along with the End of Periodic Frame
 *  Interrupt (EOPF) bit in this register.
 */
#define USB_INCOMPIP    (BIT(21))
#define USB_INCOMPIP_M  (USB_INCOMPIP_V << USB_INCOMPIP_S)
#define USB_INCOMPIP_V  0x00000001
#define USB_INCOMPIP_S  21
/** USB_FETSUSP : R/W1C; bitpos: [22]; default: 0;
 *  Device only.Data Fetch Suspended.This interrupt is valid only in DMA mode. This
 *  interrupt indicates that the core has stopped fetching data. For IN endpoints due
 *  to the unavailability of TxFIFO space or Request Queue space. This interrupt is
 *  used by the application for an endpoint mismatch algorithm
 */
#define USB_FETSUSP    (BIT(22))
#define USB_FETSUSP_M  (USB_FETSUSP_V << USB_FETSUSP_S)
#define USB_FETSUSP_V  0x00000001
#define USB_FETSUSP_S  22
/** USB_RESETDET : R/W1C; bitpos: [23]; default: 0;
 *  Reset detected Interrupt
 *  In Device mode, this interrupt is asserted when a reset is detected on the USB in
 *  partial power-down mode when the device is in Suspend
 *  In Host mode, this interrupt is not asserted
 */
#define USB_RESETDET    (BIT(23))
#define USB_RESETDET_M  (USB_RESETDET_V << USB_RESETDET_S)
#define USB_RESETDET_V  0x00000001
#define USB_RESETDET_S  23
/** USB_PRTLNT : RO; bitpos: [24]; default: 0;
 *  Host only.Host Port Interrupt.The core sets this bit to indicate a change in port
 *  status of one of the controller ports in Host mode. The application must read the
 *  Host Port Control and Status (HPRT) register to determine the exact event that
 *  caused this interrupt. The application must clear the appropriate status bit in the
 *  Host Port Control and Status register to clear this bit.
 */
#define USB_PRTLNT    (BIT(24))
#define USB_PRTLNT_M  (USB_PRTLNT_V << USB_PRTLNT_S)
#define USB_PRTLNT_V  0x00000001
#define USB_PRTLNT_S  24
/** USB_HCHLNT : RO; bitpos: [25]; default: 0;
 *  Host only.Host Channels Interrupt.The core sets this bit to indicate that an
 *  interrupt is pending on one of the channels of the core (in Host mode). The
 *  application must read the Host All Channels Interrupt (HAINT) register to determine
 *  the exact number of the channel on which the interrupt occurred,and Then read the
 *  corresponding Host Channel-n Interrupt (HCINTn) register to determine the exact
 *  cause of the interrupt.The application must clear the appropriate status bit in the
 *  HCINTn register to clear this bit.
 */
#define USB_HCHLNT    (BIT(25))
#define USB_HCHLNT_M  (USB_HCHLNT_V << USB_HCHLNT_S)
#define USB_HCHLNT_V  0x00000001
#define USB_HCHLNT_S  25
/** USB_PTXFEMP : RO; bitpos: [26]; default: 0;
 *  Host only.Periodic TxFIFO Empty.This interrupt is asserted when the Periodic
 *  Transmit FIFO is either half or completely empty and there is space for at least
 *  one entry to be written in the Periodic Request Queue. The half or completelyempty
 *  status is determined by the Periodic TxFIFO Empty Level bit in the Core AHB
 *  Configuration register (GAHBCFG.PTxFEmpLvl)
 */
#define USB_PTXFEMP    (BIT(26))
#define USB_PTXFEMP_M  (USB_PTXFEMP_V << USB_PTXFEMP_S)
#define USB_PTXFEMP_V  0x00000001
#define USB_PTXFEMP_S  26
/** USB_CONIDSTSCHNG : R/W1C; bitpos: [28]; default: 0;
 *  Connector ID Status Change
 *  1'b0:Not active
 *  1'b1:Connector ID Status Change
 */
#define USB_CONIDSTSCHNG    (BIT(28))
#define USB_CONIDSTSCHNG_M  (USB_CONIDSTSCHNG_V << USB_CONIDSTSCHNG_S)
#define USB_CONIDSTSCHNG_V  0x00000001
#define USB_CONIDSTSCHNG_S  28
/** USB_DISCONNINT : R/W1C; bitpos: [29]; default: 0;
 *  Disconnect Detected Interrupt
 *  1'b0:Not active
 *  1'b1:Disconnect Detected Interrupt
 */
#define USB_DISCONNINT    (BIT(29))
#define USB_DISCONNINT_M  (USB_DISCONNINT_V << USB_DISCONNINT_S)
#define USB_DISCONNINT_V  0x00000001
#define USB_DISCONNINT_S  29
/** USB_SESSREQINT : R/W1C; bitpos: [30]; default: 0;
 *  1'b0:Not active
 *  1'b1:Session Request New Session Detected
 */
#define USB_SESSREQINT    (BIT(30))
#define USB_SESSREQINT_M  (USB_SESSREQINT_V << USB_SESSREQINT_S)
#define USB_SESSREQINT_V  0x00000001
#define USB_SESSREQINT_S  30
/** USB_WKUPINT : R/W1C; bitpos: [31]; default: 0;
 *  Resume/Remote Wakeup Detected Interrupt
 *  1'b0:Not active
 *  1'b1:Resume or Remote Wakeup Detected Interrupt
 */
#define USB_WKUPINT    (BIT(31))
#define USB_WKUPINT_M  (USB_WKUPINT_V << USB_WKUPINT_S)
#define USB_WKUPINT_V  0x00000001
#define USB_WKUPINT_S  31


/** USB_GINTMSK_REG register
 *  Interrupt Mask Register
 */
#define USB_GINTMSK_REG (SOC_DPORT_USB_BASE + 0x18)
/** USB_MODEMISMSK : R/W; bitpos: [1]; default: 0;
 *  1'b0:Mode Mismatch Interrupt Mask
 *  1'b1:No Mode Mismatch Interrupt Mask
 */
#define USB_MODEMISMSK    (BIT(1))
#define USB_MODEMISMSK_M  (USB_MODEMISMSK_V << USB_MODEMISMSK_S)
#define USB_MODEMISMSK_V  0x00000001
#define USB_MODEMISMSK_S  1
/** USB_OTGINTMSK : R/W; bitpos: [2]; default: 0;
 *  1'b0:OTG Interrupt Mask
 *  1'b1:No OTG Interrupt Mask
 */
#define USB_OTGINTMSK    (BIT(2))
#define USB_OTGINTMSK_M  (USB_OTGINTMSK_V << USB_OTGINTMSK_S)
#define USB_OTGINTMSK_V  0x00000001
#define USB_OTGINTMSK_S  2
/** USB_SOFMSK : R/W; bitpos: [3]; default: 0;
 *  1'b0:Start of (micro)Frame Mask
 *  1'b1:No Start of (micro)Frame Mask
 */
#define USB_SOFMSK    (BIT(3))
#define USB_SOFMSK_M  (USB_SOFMSK_V << USB_SOFMSK_S)
#define USB_SOFMSK_V  0x00000001
#define USB_SOFMSK_S  3
/** USB_RXFLVIMSK : R/W; bitpos: [4]; default: 0;
 *  1'b0:Receive FIFO Non-Empty Mask
 *  1'b1:No Receive FIFO Non-Empty Mask
 */
#define USB_RXFLVIMSK    (BIT(4))
#define USB_RXFLVIMSK_M  (USB_RXFLVIMSK_V << USB_RXFLVIMSK_S)
#define USB_RXFLVIMSK_V  0x00000001
#define USB_RXFLVIMSK_S  4
/** USB_NPTXFEMPMSK : R/W; bitpos: [5]; default: 0;
 *  1'b0:Non-periodic TxFIFO Empty Mask
 *  1'b1:No Non-periodic TxFIFO Empty Mask
 */
#define USB_NPTXFEMPMSK    (BIT(5))
#define USB_NPTXFEMPMSK_M  (USB_NPTXFEMPMSK_V << USB_NPTXFEMPMSK_S)
#define USB_NPTXFEMPMSK_V  0x00000001
#define USB_NPTXFEMPMSK_S  5
/** USB_GINNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  1'b0:Global Non-periodic IN NAK Effective Mask
 *  1'b1:No Global Non-periodic IN NAK Effective Mask
 */
#define USB_GINNAKEFFMSK    (BIT(6))
#define USB_GINNAKEFFMSK_M  (USB_GINNAKEFFMSK_V << USB_GINNAKEFFMSK_S)
#define USB_GINNAKEFFMSK_V  0x00000001
#define USB_GINNAKEFFMSK_S  6
/** USB_GOUTNACKEFFMSK : R/W; bitpos: [7]; default: 0;
 *  1'b0:Global OUT NAK Effective Mask
 *  1'b1:No Global OUT NAK Effective Mask
 */
#define USB_GOUTNACKEFFMSK    (BIT(7))
#define USB_GOUTNACKEFFMSK_M  (USB_GOUTNACKEFFMSK_V << USB_GOUTNACKEFFMSK_S)
#define USB_GOUTNACKEFFMSK_V  0x00000001
#define USB_GOUTNACKEFFMSK_S  7
/** USB_ERLYSUSPMSK : R/W; bitpos: [10]; default: 0;
 *  1'b0:Early Suspend Mask
 *  1'b1:No Early Suspend Mask
 */
#define USB_ERLYSUSPMSK    (BIT(10))
#define USB_ERLYSUSPMSK_M  (USB_ERLYSUSPMSK_V << USB_ERLYSUSPMSK_S)
#define USB_ERLYSUSPMSK_V  0x00000001
#define USB_ERLYSUSPMSK_S  10
/** USB_USBSUSPMSK : R/W; bitpos: [11]; default: 0;
 *  1'b0:USB Suspend Mask
 *  1'b1:No USB Suspend Mask
 */
#define USB_USBSUSPMSK    (BIT(11))
#define USB_USBSUSPMSK_M  (USB_USBSUSPMSK_V << USB_USBSUSPMSK_S)
#define USB_USBSUSPMSK_V  0x00000001
#define USB_USBSUSPMSK_S  11
/** USB_USBRSTMSK : R/W; bitpos: [12]; default: 0;
 *  1'b0:USB Reset Mask
 *  1'b1:No USB Reset Mask
 */
#define USB_USBRSTMSK    (BIT(12))
#define USB_USBRSTMSK_M  (USB_USBRSTMSK_V << USB_USBRSTMSK_S)
#define USB_USBRSTMSK_V  0x00000001
#define USB_USBRSTMSK_S  12
/** USB_ENUMDONEMSK : R/W; bitpos: [13]; default: 0;
 *  1'b0: Enumeration Done Mask
 *  1'b1: No Enumeration Done Mask
 */
#define USB_ENUMDONEMSK    (BIT(13))
#define USB_ENUMDONEMSK_M  (USB_ENUMDONEMSK_V << USB_ENUMDONEMSK_S)
#define USB_ENUMDONEMSK_V  0x00000001
#define USB_ENUMDONEMSK_S  13
/** USB_ISOOUTDROPMSK : R/W; bitpos: [14]; default: 0;
 *  1'b0: Isochronous OUT Packet Dropped Interrupt Mask
 *  1'b1: No Isochronous OUT Packet Dropped Interrupt Mask
 */
#define USB_ISOOUTDROPMSK    (BIT(14))
#define USB_ISOOUTDROPMSK_M  (USB_ISOOUTDROPMSK_V << USB_ISOOUTDROPMSK_S)
#define USB_ISOOUTDROPMSK_V  0x00000001
#define USB_ISOOUTDROPMSK_S  14
/** USB_EOPFMSK : R/W; bitpos: [15]; default: 0;
 *  1'b0: End of Periodic Frame Interrupt Mask
 *  1'b1: No End of Periodic Frame Interrupt Mask
 */
#define USB_EOPFMSK    (BIT(15))
#define USB_EOPFMSK_M  (USB_EOPFMSK_V << USB_EOPFMSK_S)
#define USB_EOPFMSK_V  0x00000001
#define USB_EOPFMSK_S  15
/** USB_EPMISMSK : R/W; bitpos: [17]; default: 0;
 *  1'b0: Endpoint Mismatch Interrupt Mask
 *  1'b1: No Endpoint Mismatch Interrupt Mask
 */
#define USB_EPMISMSK    (BIT(17))
#define USB_EPMISMSK_M  (USB_EPMISMSK_V << USB_EPMISMSK_S)
#define USB_EPMISMSK_V  0x00000001
#define USB_EPMISMSK_S  17
/** USB_IEPINTMSK : R/W; bitpos: [18]; default: 0;
 *  1'b0: IN Endpoints Interrupt Mask
 *  1'b1: No IN Endpoints Interrupt Mask
 */
#define USB_IEPINTMSK    (BIT(18))
#define USB_IEPINTMSK_M  (USB_IEPINTMSK_V << USB_IEPINTMSK_S)
#define USB_IEPINTMSK_V  0x00000001
#define USB_IEPINTMSK_S  18
/** USB_OEPINTMSK : R/W; bitpos: [19]; default: 0;
 *  1'b0: OUT Endpoints Interrupt Mask
 *  1'b1: No OUT Endpoints Interrupt Mask
 */
#define USB_OEPINTMSK    (BIT(19))
#define USB_OEPINTMSK_M  (USB_OEPINTMSK_V << USB_OEPINTMSK_S)
#define USB_OEPINTMSK_V  0x00000001
#define USB_OEPINTMSK_S  19
/** USB_INCOMPISOINMSK : R/W; bitpos: [20]; default: 0;
 *  1'b0: Incomplete Isochronous IN Transfer Mask
 *  1'b1: No Incomplete Isochronous IN Transfer Mask
 */
#define USB_INCOMPISOINMSK    (BIT(20))
#define USB_INCOMPISOINMSK_M  (USB_INCOMPISOINMSK_V << USB_INCOMPISOINMSK_S)
#define USB_INCOMPISOINMSK_V  0x00000001
#define USB_INCOMPISOINMSK_S  20
/** USB_INCOMPIPMSK : R/W; bitpos: [21]; default: 0;
 *  1'b0: Host mode: Incomplete Periodic Transfer Mask Device mode: Incomplete
 *  Isochronous OUT Transfer Mask
 *  1'b1: Host mode: No Incomplete Periodic Transfer Mask  Device mode: No Incomplete
 *  Isochronous OUT Transfer Mask
 */
#define USB_INCOMPIPMSK    (BIT(21))
#define USB_INCOMPIPMSK_M  (USB_INCOMPIPMSK_V << USB_INCOMPIPMSK_S)
#define USB_INCOMPIPMSK_V  0x00000001
#define USB_INCOMPIPMSK_S  21
/** USB_FETSUSPMSK : R/W; bitpos: [22]; default: 0;
 *  1'b0: Data Fetch Suspended Mask
 *  1'b1: No Data Fetch Suspended Mask
 */
#define USB_FETSUSPMSK    (BIT(22))
#define USB_FETSUSPMSK_M  (USB_FETSUSPMSK_V << USB_FETSUSPMSK_S)
#define USB_FETSUSPMSK_V  0x00000001
#define USB_FETSUSPMSK_S  22
/** USB_RESETDETMSK : R/W; bitpos: [23]; default: 0;
 *  1'b0: Reset detected Interrupt Mask
 *  1'b1: No Reset detected Interrupt Mask
 */
#define USB_RESETDETMSK    (BIT(23))
#define USB_RESETDETMSK_M  (USB_RESETDETMSK_V << USB_RESETDETMSK_S)
#define USB_RESETDETMSK_V  0x00000001
#define USB_RESETDETMSK_S  23
/** USB_PRTLNTMSK : R/W; bitpos: [24]; default: 0;
 *  1'b0: Host Port Interrupt Mask
 *  1'b1: No Host Port Interrupt Mask
 */
#define USB_PRTLNTMSK    (BIT(24))
#define USB_PRTLNTMSK_M  (USB_PRTLNTMSK_V << USB_PRTLNTMSK_S)
#define USB_PRTLNTMSK_V  0x00000001
#define USB_PRTLNTMSK_S  24
/** USB_HCHINTMSK : R/W; bitpos: [25]; default: 0;
 *  1'b0: Host Channels Interrupt Mask
 *  1'b1: No Host Channels Interrupt Mask
 */
#define USB_HCHINTMSK    (BIT(25))
#define USB_HCHINTMSK_M  (USB_HCHINTMSK_V << USB_HCHINTMSK_S)
#define USB_HCHINTMSK_V  0x00000001
#define USB_HCHINTMSK_S  25
/** USB_PTXFEMPMSK : R/W; bitpos: [26]; default: 0;
 *  1'b0: Periodic TxFIFO Empty Mask
 *  1'b1: No Periodic TxFIFO Empty Mask
 */
#define USB_PTXFEMPMSK    (BIT(26))
#define USB_PTXFEMPMSK_M  (USB_PTXFEMPMSK_V << USB_PTXFEMPMSK_S)
#define USB_PTXFEMPMSK_V  0x00000001
#define USB_PTXFEMPMSK_S  26
/** USB_CONIDSTSCHNGMSK : R/W; bitpos: [28]; default: 0;
 *  1'b0: Connector ID Status Change Mask
 *  1'b1: No Connector ID Status Change Mask
 */
#define USB_CONIDSTSCHNGMSK    (BIT(28))
#define USB_CONIDSTSCHNGMSK_M  (USB_CONIDSTSCHNGMSK_V << USB_CONIDSTSCHNGMSK_S)
#define USB_CONIDSTSCHNGMSK_V  0x00000001
#define USB_CONIDSTSCHNGMSK_S  28
/** USB_DISCONNINTMSK : R/W; bitpos: [29]; default: 0;
 *  1'b0: Disconnect Detected Interrupt Mask
 *  1'b1: No Disconnect Detected Interrupt Mask
 */
#define USB_DISCONNINTMSK    (BIT(29))
#define USB_DISCONNINTMSK_M  (USB_DISCONNINTMSK_V << USB_DISCONNINTMSK_S)
#define USB_DISCONNINTMSK_V  0x00000001
#define USB_DISCONNINTMSK_S  29
/** USB_SESSREQINTMSK : R/W; bitpos: [30]; default: 0;
 *  1'b0: Session Request or New Session Detected Interrupt Mask
 *  1'b1: No Session Request or New Session Detected Interrupt Mask
 */
#define USB_SESSREQINTMSK    (BIT(30))
#define USB_SESSREQINTMSK_M  (USB_SESSREQINTMSK_V << USB_SESSREQINTMSK_S)
#define USB_SESSREQINTMSK_V  0x00000001
#define USB_SESSREQINTMSK_S  30
/** USB_WKUPINTMSK : R/W; bitpos: [31]; default: 0;
 *  1'b0 : Resume or Remote Wakeup Detected Interrupt Mask
 *  1'b1 : Unmask Resume Remote Wakeup Detected Interrupt
 */
#define USB_WKUPINTMSK    (BIT(31))
#define USB_WKUPINTMSK_M  (USB_WKUPINTMSK_V << USB_WKUPINTMSK_S)
#define USB_WKUPINTMSK_V  0x00000001
#define USB_WKUPINTMSK_S  31


/** USB_HAINT_REG register
 *  Host All Channels Interrupt Register
 */
#define USB_HAINT_REG (SOC_DPORT_USB_BASE + 0x414)
/** USB_HAINT : RO; bitpos: [8:0]; default: 0;
 *  Channel Interrupt for channel no.
 */
#define USB_HAINT    0x000000FF
#define USB_HAINT_M  (USB_HAINT_V << USB_HAINT_S)
#define USB_HAINT_V  0x000000FF
#define USB_HAINT_S  0


/** USB_HAINTMSK_REG register
 *  Host All Channels Interrupt Mask Register
 */
#define USB_HAINTMSK_REG (SOC_DPORT_USB_BASE + 0x418)
/** USB_HAINTMSK : R/W; bitpos: [8:0]; default: 0;
 *  Channel Interrupt Mask (HAINTMSK_REG) One bit per channel: Bit 0 for channel 0, bit
 *  15 for channel 15.
 */
#define USB_HAINTMSK    0x000000FF
#define USB_HAINTMSK_M  (USB_HAINTMSK_V << USB_HAINTMSK_S)
#define USB_HAINTMSK_V  0x000000FF
#define USB_HAINTMSK_S  0


