espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_HCINT0_REG register
 *  Host Channel 0 Interrupt Register
 */
#define USB_HCINT0_REG (SOC_DPORT_USB_BASE + 0x508)
/** USB_H_XFERCOMPL0 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL0    (BIT(0))
#define USB_H_XFERCOMPL0_M  (USB_H_XFERCOMPL0_V << USB_H_XFERCOMPL0_S)
#define USB_H_XFERCOMPL0_V  0x00000001
#define USB_H_XFERCOMPL0_S  0
/** USB_H_CHHLTD0 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD0    (BIT(1))
#define USB_H_CHHLTD0_M  (USB_H_CHHLTD0_V << USB_H_CHHLTD0_S)
#define USB_H_CHHLTD0_V  0x00000001
#define USB_H_CHHLTD0_S  1
/** USB_H_AHBERR0 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR0    (BIT(2))
#define USB_H_AHBERR0_M  (USB_H_AHBERR0_V << USB_H_AHBERR0_S)
#define USB_H_AHBERR0_V  0x00000001
#define USB_H_AHBERR0_S  2
/** USB_H_STALL0 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL0    (BIT(3))
#define USB_H_STALL0_M  (USB_H_STALL0_V << USB_H_STALL0_S)
#define USB_H_STALL0_V  0x00000001
#define USB_H_STALL0_S  3
/** USB_H_NACK0 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK0    (BIT(4))
#define USB_H_NACK0_M  (USB_H_NACK0_V << USB_H_NACK0_S)
#define USB_H_NACK0_V  0x00000001
#define USB_H_NACK0_S  4
/** USB_H_ACK0 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK0    (BIT(5))
#define USB_H_ACK0_M  (USB_H_ACK0_V << USB_H_ACK0_S)
#define USB_H_ACK0_V  0x00000001
#define USB_H_ACK0_S  5
/** USB_H_NYET0 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET0    (BIT(6))
#define USB_H_NYET0_M  (USB_H_NYET0_V << USB_H_NYET0_S)
#define USB_H_NYET0_V  0x00000001
#define USB_H_NYET0_S  6
/** USB_H_XACTERR0 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR0    (BIT(7))
#define USB_H_XACTERR0_M  (USB_H_XACTERR0_V << USB_H_XACTERR0_S)
#define USB_H_XACTERR0_V  0x00000001
#define USB_H_XACTERR0_S  7
/** USB_H_BBLERR0 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR0    (BIT(8))
#define USB_H_BBLERR0_M  (USB_H_BBLERR0_V << USB_H_BBLERR0_S)
#define USB_H_BBLERR0_V  0x00000001
#define USB_H_BBLERR0_S  8
/** USB_H_FRMOVRUN0 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN0    (BIT(9))
#define USB_H_FRMOVRUN0_M  (USB_H_FRMOVRUN0_V << USB_H_FRMOVRUN0_S)
#define USB_H_FRMOVRUN0_V  0x00000001
#define USB_H_FRMOVRUN0_S  9
/** USB_H_DATATGLERR0 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR0    (BIT(10))
#define USB_H_DATATGLERR0_M  (USB_H_DATATGLERR0_V << USB_H_DATATGLERR0_S)
#define USB_H_DATATGLERR0_V  0x00000001
#define USB_H_DATATGLERR0_S  10
/** USB_H_BNAINTR0 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR0    (BIT(11))
#define USB_H_BNAINTR0_M  (USB_H_BNAINTR0_V << USB_H_BNAINTR0_S)
#define USB_H_BNAINTR0_V  0x00000001
#define USB_H_BNAINTR0_S  11
/** USB_H_XCS_XACT_ERR0 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR0    (BIT(12))
#define USB_H_XCS_XACT_ERR0_M  (USB_H_XCS_XACT_ERR0_V << USB_H_XCS_XACT_ERR0_S)
#define USB_H_XCS_XACT_ERR0_V  0x00000001
#define USB_H_XCS_XACT_ERR0_S  12
/** USB_H_DESC_LST_ROLLINTR0 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR0    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR0_M  (USB_H_DESC_LST_ROLLINTR0_V << USB_H_DESC_LST_ROLLINTR0_S)
#define USB_H_DESC_LST_ROLLINTR0_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR0_S  13


/** USB_HCINTMSK0_REG register
 *  Host Channel 0 Interrupt Mask Register
 */
#define USB_HCINTMSK0_REG (SOC_DPORT_USB_BASE + 0x50c)
/** USB_H_XFERCOMPLMSK0 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK0    (BIT(0))
#define USB_H_XFERCOMPLMSK0_M  (USB_H_XFERCOMPLMSK0_V << USB_H_XFERCOMPLMSK0_S)
#define USB_H_XFERCOMPLMSK0_V  0x00000001
#define USB_H_XFERCOMPLMSK0_S  0
/** USB_H_CHHLTDMSK0 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK0    (BIT(1))
#define USB_H_CHHLTDMSK0_M  (USB_H_CHHLTDMSK0_V << USB_H_CHHLTDMSK0_S)
#define USB_H_CHHLTDMSK0_V  0x00000001
#define USB_H_CHHLTDMSK0_S  1
/** USB_H_AHBERRMSK0 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK0    (BIT(2))
#define USB_H_AHBERRMSK0_M  (USB_H_AHBERRMSK0_V << USB_H_AHBERRMSK0_S)
#define USB_H_AHBERRMSK0_V  0x00000001
#define USB_H_AHBERRMSK0_S  2
/** USB_H_STALLMSK0 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK0    (BIT(3))
#define USB_H_STALLMSK0_M  (USB_H_STALLMSK0_V << USB_H_STALLMSK0_S)
#define USB_H_STALLMSK0_V  0x00000001
#define USB_H_STALLMSK0_S  3
/** USB_H_NAKMSK0 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK0    (BIT(4))
#define USB_H_NAKMSK0_M  (USB_H_NAKMSK0_V << USB_H_NAKMSK0_S)
#define USB_H_NAKMSK0_V  0x00000001
#define USB_H_NAKMSK0_S  4
/** USB_H_ACKMSK0 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK0    (BIT(5))
#define USB_H_ACKMSK0_M  (USB_H_ACKMSK0_V << USB_H_ACKMSK0_S)
#define USB_H_ACKMSK0_V  0x00000001
#define USB_H_ACKMSK0_S  5
/** USB_H_NYETMSK0 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK0    (BIT(6))
#define USB_H_NYETMSK0_M  (USB_H_NYETMSK0_V << USB_H_NYETMSK0_S)
#define USB_H_NYETMSK0_V  0x00000001
#define USB_H_NYETMSK0_S  6
/** USB_H_XACTERRMSK0 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK0    (BIT(7))
#define USB_H_XACTERRMSK0_M  (USB_H_XACTERRMSK0_V << USB_H_XACTERRMSK0_S)
#define USB_H_XACTERRMSK0_V  0x00000001
#define USB_H_XACTERRMSK0_S  7
/** USB_H_BBLERRMSK0 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK0    (BIT(8))
#define USB_H_BBLERRMSK0_M  (USB_H_BBLERRMSK0_V << USB_H_BBLERRMSK0_S)
#define USB_H_BBLERRMSK0_V  0x00000001
#define USB_H_BBLERRMSK0_S  8
/** USB_H_FRMOVRUNMSK0 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK0    (BIT(9))
#define USB_H_FRMOVRUNMSK0_M  (USB_H_FRMOVRUNMSK0_V << USB_H_FRMOVRUNMSK0_S)
#define USB_H_FRMOVRUNMSK0_V  0x00000001
#define USB_H_FRMOVRUNMSK0_S  9
/** USB_H_DATATGLERRMSK0 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK0    (BIT(10))
#define USB_H_DATATGLERRMSK0_M  (USB_H_DATATGLERRMSK0_V << USB_H_DATATGLERRMSK0_S)
#define USB_H_DATATGLERRMSK0_V  0x00000001
#define USB_H_DATATGLERRMSK0_S  10
/** USB_H_BNAINTRMSK0 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK0    (BIT(11))
#define USB_H_BNAINTRMSK0_M  (USB_H_BNAINTRMSK0_V << USB_H_BNAINTRMSK0_S)
#define USB_H_BNAINTRMSK0_V  0x00000001
#define USB_H_BNAINTRMSK0_S  11
/** USB_H_DESC_LST_ROLLINTRMSK0 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK0    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK0_M  (USB_H_DESC_LST_ROLLINTRMSK0_V << USB_H_DESC_LST_ROLLINTRMSK0_S)
#define USB_H_DESC_LST_ROLLINTRMSK0_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK0_S  13


/** USB_HCINT1_REG register
 *  Host Channel 1 Interrupt Register
 */
#define USB_HCINT1_REG (SOC_DPORT_USB_BASE + 0x528)
/** USB_H_XFERCOMPL1 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL1    (BIT(0))
#define USB_H_XFERCOMPL1_M  (USB_H_XFERCOMPL1_V << USB_H_XFERCOMPL1_S)
#define USB_H_XFERCOMPL1_V  0x00000001
#define USB_H_XFERCOMPL1_S  0
/** USB_H_CHHLTD1 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD1    (BIT(1))
#define USB_H_CHHLTD1_M  (USB_H_CHHLTD1_V << USB_H_CHHLTD1_S)
#define USB_H_CHHLTD1_V  0x00000001
#define USB_H_CHHLTD1_S  1
/** USB_H_AHBERR1 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR1    (BIT(2))
#define USB_H_AHBERR1_M  (USB_H_AHBERR1_V << USB_H_AHBERR1_S)
#define USB_H_AHBERR1_V  0x00000001
#define USB_H_AHBERR1_S  2
/** USB_H_STALL1 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL1    (BIT(3))
#define USB_H_STALL1_M  (USB_H_STALL1_V << USB_H_STALL1_S)
#define USB_H_STALL1_V  0x00000001
#define USB_H_STALL1_S  3
/** USB_H_NACK1 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK1    (BIT(4))
#define USB_H_NACK1_M  (USB_H_NACK1_V << USB_H_NACK1_S)
#define USB_H_NACK1_V  0x00000001
#define USB_H_NACK1_S  4
/** USB_H_ACK1 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK1    (BIT(5))
#define USB_H_ACK1_M  (USB_H_ACK1_V << USB_H_ACK1_S)
#define USB_H_ACK1_V  0x00000001
#define USB_H_ACK1_S  5
/** USB_H_NYET1 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET1    (BIT(6))
#define USB_H_NYET1_M  (USB_H_NYET1_V << USB_H_NYET1_S)
#define USB_H_NYET1_V  0x00000001
#define USB_H_NYET1_S  6
/** USB_H_XACTERR1 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR1    (BIT(7))
#define USB_H_XACTERR1_M  (USB_H_XACTERR1_V << USB_H_XACTERR1_S)
#define USB_H_XACTERR1_V  0x00000001
#define USB_H_XACTERR1_S  7
/** USB_H_BBLERR1 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR1    (BIT(8))
#define USB_H_BBLERR1_M  (USB_H_BBLERR1_V << USB_H_BBLERR1_S)
#define USB_H_BBLERR1_V  0x00000001
#define USB_H_BBLERR1_S  8
/** USB_H_FRMOVRUN1 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN1    (BIT(9))
#define USB_H_FRMOVRUN1_M  (USB_H_FRMOVRUN1_V << USB_H_FRMOVRUN1_S)
#define USB_H_FRMOVRUN1_V  0x00000001
#define USB_H_FRMOVRUN1_S  9
/** USB_H_DATATGLERR1 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR1    (BIT(10))
#define USB_H_DATATGLERR1_M  (USB_H_DATATGLERR1_V << USB_H_DATATGLERR1_S)
#define USB_H_DATATGLERR1_V  0x00000001
#define USB_H_DATATGLERR1_S  10
/** USB_H_BNAINTR1 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR1    (BIT(11))
#define USB_H_BNAINTR1_M  (USB_H_BNAINTR1_V << USB_H_BNAINTR1_S)
#define USB_H_BNAINTR1_V  0x00000001
#define USB_H_BNAINTR1_S  11
/** USB_H_XCS_XACT_ERR1 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR1    (BIT(12))
#define USB_H_XCS_XACT_ERR1_M  (USB_H_XCS_XACT_ERR1_V << USB_H_XCS_XACT_ERR1_S)
#define USB_H_XCS_XACT_ERR1_V  0x00000001
#define USB_H_XCS_XACT_ERR1_S  12
/** USB_H_DESC_LST_ROLLINTR1 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR1    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR1_M  (USB_H_DESC_LST_ROLLINTR1_V << USB_H_DESC_LST_ROLLINTR1_S)
#define USB_H_DESC_LST_ROLLINTR1_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR1_S  13


/** USB_HCINTMSK1_REG register
 *  Host Channel 1 Interrupt Mask Register
 */
#define USB_HCINTMSK1_REG (SOC_DPORT_USB_BASE + 0x52c)
/** USB_H_XFERCOMPLMSK1 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK1    (BIT(0))
#define USB_H_XFERCOMPLMSK1_M  (USB_H_XFERCOMPLMSK1_V << USB_H_XFERCOMPLMSK1_S)
#define USB_H_XFERCOMPLMSK1_V  0x00000001
#define USB_H_XFERCOMPLMSK1_S  0
/** USB_H_CHHLTDMSK1 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK1    (BIT(1))
#define USB_H_CHHLTDMSK1_M  (USB_H_CHHLTDMSK1_V << USB_H_CHHLTDMSK1_S)
#define USB_H_CHHLTDMSK1_V  0x00000001
#define USB_H_CHHLTDMSK1_S  1
/** USB_H_AHBERRMSK1 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK1    (BIT(2))
#define USB_H_AHBERRMSK1_M  (USB_H_AHBERRMSK1_V << USB_H_AHBERRMSK1_S)
#define USB_H_AHBERRMSK1_V  0x00000001
#define USB_H_AHBERRMSK1_S  2
/** USB_H_STALLMSK1 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK1    (BIT(3))
#define USB_H_STALLMSK1_M  (USB_H_STALLMSK1_V << USB_H_STALLMSK1_S)
#define USB_H_STALLMSK1_V  0x00000001
#define USB_H_STALLMSK1_S  3
/** USB_H_NAKMSK1 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK1    (BIT(4))
#define USB_H_NAKMSK1_M  (USB_H_NAKMSK1_V << USB_H_NAKMSK1_S)
#define USB_H_NAKMSK1_V  0x00000001
#define USB_H_NAKMSK1_S  4
/** USB_H_ACKMSK1 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK1    (BIT(5))
#define USB_H_ACKMSK1_M  (USB_H_ACKMSK1_V << USB_H_ACKMSK1_S)
#define USB_H_ACKMSK1_V  0x00000001
#define USB_H_ACKMSK1_S  5
/** USB_H_NYETMSK1 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK1    (BIT(6))
#define USB_H_NYETMSK1_M  (USB_H_NYETMSK1_V << USB_H_NYETMSK1_S)
#define USB_H_NYETMSK1_V  0x00000001
#define USB_H_NYETMSK1_S  6
/** USB_H_XACTERRMSK1 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK1    (BIT(7))
#define USB_H_XACTERRMSK1_M  (USB_H_XACTERRMSK1_V << USB_H_XACTERRMSK1_S)
#define USB_H_XACTERRMSK1_V  0x00000001
#define USB_H_XACTERRMSK1_S  7
/** USB_H_BBLERRMSK1 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK1    (BIT(8))
#define USB_H_BBLERRMSK1_M  (USB_H_BBLERRMSK1_V << USB_H_BBLERRMSK1_S)
#define USB_H_BBLERRMSK1_V  0x00000001
#define USB_H_BBLERRMSK1_S  8
/** USB_H_FRMOVRUNMSK1 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK1    (BIT(9))
#define USB_H_FRMOVRUNMSK1_M  (USB_H_FRMOVRUNMSK1_V << USB_H_FRMOVRUNMSK1_S)
#define USB_H_FRMOVRUNMSK1_V  0x00000001
#define USB_H_FRMOVRUNMSK1_S  9
/** USB_H_DATATGLERRMSK1 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK1    (BIT(10))
#define USB_H_DATATGLERRMSK1_M  (USB_H_DATATGLERRMSK1_V << USB_H_DATATGLERRMSK1_S)
#define USB_H_DATATGLERRMSK1_V  0x00000001
#define USB_H_DATATGLERRMSK1_S  10
/** USB_H_BNAINTRMSK1 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK1    (BIT(11))
#define USB_H_BNAINTRMSK1_M  (USB_H_BNAINTRMSK1_V << USB_H_BNAINTRMSK1_S)
#define USB_H_BNAINTRMSK1_V  0x00000001
#define USB_H_BNAINTRMSK1_S  11
/** USB_H_DESC_LST_ROLLINTRMSK1 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK1    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK1_M  (USB_H_DESC_LST_ROLLINTRMSK1_V << USB_H_DESC_LST_ROLLINTRMSK1_S)
#define USB_H_DESC_LST_ROLLINTRMSK1_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK1_S  13


/** USB_HCINT2_REG register
 *  Host Channel 2 Interrupt Register
 */
#define USB_HCINT2_REG (SOC_DPORT_USB_BASE + 0x548)
/** USB_H_XFERCOMPL2 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL2    (BIT(0))
#define USB_H_XFERCOMPL2_M  (USB_H_XFERCOMPL2_V << USB_H_XFERCOMPL2_S)
#define USB_H_XFERCOMPL2_V  0x00000001
#define USB_H_XFERCOMPL2_S  0
/** USB_H_CHHLTD2 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD2    (BIT(1))
#define USB_H_CHHLTD2_M  (USB_H_CHHLTD2_V << USB_H_CHHLTD2_S)
#define USB_H_CHHLTD2_V  0x00000001
#define USB_H_CHHLTD2_S  1
/** USB_H_AHBERR2 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR2    (BIT(2))
#define USB_H_AHBERR2_M  (USB_H_AHBERR2_V << USB_H_AHBERR2_S)
#define USB_H_AHBERR2_V  0x00000001
#define USB_H_AHBERR2_S  2
/** USB_H_STALL2 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL2    (BIT(3))
#define USB_H_STALL2_M  (USB_H_STALL2_V << USB_H_STALL2_S)
#define USB_H_STALL2_V  0x00000001
#define USB_H_STALL2_S  3
/** USB_H_NACK2 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK2    (BIT(4))
#define USB_H_NACK2_M  (USB_H_NACK2_V << USB_H_NACK2_S)
#define USB_H_NACK2_V  0x00000001
#define USB_H_NACK2_S  4
/** USB_H_ACK2 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK2    (BIT(5))
#define USB_H_ACK2_M  (USB_H_ACK2_V << USB_H_ACK2_S)
#define USB_H_ACK2_V  0x00000001
#define USB_H_ACK2_S  5
/** USB_H_NYET2 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET2    (BIT(6))
#define USB_H_NYET2_M  (USB_H_NYET2_V << USB_H_NYET2_S)
#define USB_H_NYET2_V  0x00000001
#define USB_H_NYET2_S  6
/** USB_H_XACTERR2 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR2    (BIT(7))
#define USB_H_XACTERR2_M  (USB_H_XACTERR2_V << USB_H_XACTERR2_S)
#define USB_H_XACTERR2_V  0x00000001
#define USB_H_XACTERR2_S  7
/** USB_H_BBLERR2 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR2    (BIT(8))
#define USB_H_BBLERR2_M  (USB_H_BBLERR2_V << USB_H_BBLERR2_S)
#define USB_H_BBLERR2_V  0x00000001
#define USB_H_BBLERR2_S  8
/** USB_H_FRMOVRUN2 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN2    (BIT(9))
#define USB_H_FRMOVRUN2_M  (USB_H_FRMOVRUN2_V << USB_H_FRMOVRUN2_S)
#define USB_H_FRMOVRUN2_V  0x00000001
#define USB_H_FRMOVRUN2_S  9
/** USB_H_DATATGLERR2 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR2    (BIT(10))
#define USB_H_DATATGLERR2_M  (USB_H_DATATGLERR2_V << USB_H_DATATGLERR2_S)
#define USB_H_DATATGLERR2_V  0x00000001
#define USB_H_DATATGLERR2_S  10
/** USB_H_BNAINTR2 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR2    (BIT(11))
#define USB_H_BNAINTR2_M  (USB_H_BNAINTR2_V << USB_H_BNAINTR2_S)
#define USB_H_BNAINTR2_V  0x00000001
#define USB_H_BNAINTR2_S  11
/** USB_H_XCS_XACT_ERR2 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR2    (BIT(12))
#define USB_H_XCS_XACT_ERR2_M  (USB_H_XCS_XACT_ERR2_V << USB_H_XCS_XACT_ERR2_S)
#define USB_H_XCS_XACT_ERR2_V  0x00000001
#define USB_H_XCS_XACT_ERR2_S  12
/** USB_H_DESC_LST_ROLLINTR2 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR2    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR2_M  (USB_H_DESC_LST_ROLLINTR2_V << USB_H_DESC_LST_ROLLINTR2_S)
#define USB_H_DESC_LST_ROLLINTR2_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR2_S  13


