espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_HCINTMSK6_REG register
 *  Host Channel 6 Interrupt Mask Register
 */
#define USB_HCINTMSK6_REG (SOC_DPORT_USB_BASE + 0x5cc)
/** USB_H_XFERCOMPLMSK6 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK6    (BIT(0))
#define USB_H_XFERCOMPLMSK6_M  (USB_H_XFERCOMPLMSK6_V << USB_H_XFERCOMPLMSK6_S)
#define USB_H_XFERCOMPLMSK6_V  0x00000001
#define USB_H_XFERCOMPLMSK6_S  0
/** USB_H_CHHLTDMSK6 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK6    (BIT(1))
#define USB_H_CHHLTDMSK6_M  (USB_H_CHHLTDMSK6_V << USB_H_CHHLTDMSK6_S)
#define USB_H_CHHLTDMSK6_V  0x00000001
#define USB_H_CHHLTDMSK6_S  1
/** USB_H_AHBERRMSK6 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK6    (BIT(2))
#define USB_H_AHBERRMSK6_M  (USB_H_AHBERRMSK6_V << USB_H_AHBERRMSK6_S)
#define USB_H_AHBERRMSK6_V  0x00000001
#define USB_H_AHBERRMSK6_S  2
/** USB_H_STALLMSK6 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK6    (BIT(3))
#define USB_H_STALLMSK6_M  (USB_H_STALLMSK6_V << USB_H_STALLMSK6_S)
#define USB_H_STALLMSK6_V  0x00000001
#define USB_H_STALLMSK6_S  3
/** USB_H_NAKMSK6 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK6    (BIT(4))
#define USB_H_NAKMSK6_M  (USB_H_NAKMSK6_V << USB_H_NAKMSK6_S)
#define USB_H_NAKMSK6_V  0x00000001
#define USB_H_NAKMSK6_S  4
/** USB_H_ACKMSK6 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK6    (BIT(5))
#define USB_H_ACKMSK6_M  (USB_H_ACKMSK6_V << USB_H_ACKMSK6_S)
#define USB_H_ACKMSK6_V  0x00000001
#define USB_H_ACKMSK6_S  5
/** USB_H_NYETMSK6 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK6    (BIT(6))
#define USB_H_NYETMSK6_M  (USB_H_NYETMSK6_V << USB_H_NYETMSK6_S)
#define USB_H_NYETMSK6_V  0x00000001
#define USB_H_NYETMSK6_S  6
/** USB_H_XACTERRMSK6 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK6    (BIT(7))
#define USB_H_XACTERRMSK6_M  (USB_H_XACTERRMSK6_V << USB_H_XACTERRMSK6_S)
#define USB_H_XACTERRMSK6_V  0x00000001
#define USB_H_XACTERRMSK6_S  7
/** USB_H_BBLERRMSK6 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK6    (BIT(8))
#define USB_H_BBLERRMSK6_M  (USB_H_BBLERRMSK6_V << USB_H_BBLERRMSK6_S)
#define USB_H_BBLERRMSK6_V  0x00000001
#define USB_H_BBLERRMSK6_S  8
/** USB_H_FRMOVRUNMSK6 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK6    (BIT(9))
#define USB_H_FRMOVRUNMSK6_M  (USB_H_FRMOVRUNMSK6_V << USB_H_FRMOVRUNMSK6_S)
#define USB_H_FRMOVRUNMSK6_V  0x00000001
#define USB_H_FRMOVRUNMSK6_S  9
/** USB_H_DATATGLERRMSK6 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK6    (BIT(10))
#define USB_H_DATATGLERRMSK6_M  (USB_H_DATATGLERRMSK6_V << USB_H_DATATGLERRMSK6_S)
#define USB_H_DATATGLERRMSK6_V  0x00000001
#define USB_H_DATATGLERRMSK6_S  10
/** USB_H_BNAINTRMSK6 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK6    (BIT(11))
#define USB_H_BNAINTRMSK6_M  (USB_H_BNAINTRMSK6_V << USB_H_BNAINTRMSK6_S)
#define USB_H_BNAINTRMSK6_V  0x00000001
#define USB_H_BNAINTRMSK6_S  11
/** USB_H_DESC_LST_ROLLINTRMSK6 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK6    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK6_M  (USB_H_DESC_LST_ROLLINTRMSK6_V << USB_H_DESC_LST_ROLLINTRMSK6_S)
#define USB_H_DESC_LST_ROLLINTRMSK6_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK6_S  13


/** USB_HCINT7_REG register
 *  Host Channel 7 Interrupt Register
 */
#define USB_HCINT7_REG (SOC_DPORT_USB_BASE + 0x5e8)
/** USB_H_XFERCOMPL7 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL7    (BIT(0))
#define USB_H_XFERCOMPL7_M  (USB_H_XFERCOMPL7_V << USB_H_XFERCOMPL7_S)
#define USB_H_XFERCOMPL7_V  0x00000001
#define USB_H_XFERCOMPL7_S  0
/** USB_H_CHHLTD7 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD7    (BIT(1))
#define USB_H_CHHLTD7_M  (USB_H_CHHLTD7_V << USB_H_CHHLTD7_S)
#define USB_H_CHHLTD7_V  0x00000001
#define USB_H_CHHLTD7_S  1
/** USB_H_AHBERR7 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR7    (BIT(2))
#define USB_H_AHBERR7_M  (USB_H_AHBERR7_V << USB_H_AHBERR7_S)
#define USB_H_AHBERR7_V  0x00000001
#define USB_H_AHBERR7_S  2
/** USB_H_STALL7 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL7    (BIT(3))
#define USB_H_STALL7_M  (USB_H_STALL7_V << USB_H_STALL7_S)
#define USB_H_STALL7_V  0x00000001
#define USB_H_STALL7_S  3
/** USB_H_NACK7 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK7    (BIT(4))
#define USB_H_NACK7_M  (USB_H_NACK7_V << USB_H_NACK7_S)
#define USB_H_NACK7_V  0x00000001
#define USB_H_NACK7_S  4
/** USB_H_ACK7 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK7    (BIT(5))
#define USB_H_ACK7_M  (USB_H_ACK7_V << USB_H_ACK7_S)
#define USB_H_ACK7_V  0x00000001
#define USB_H_ACK7_S  5
/** USB_H_NYET7 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET7    (BIT(6))
#define USB_H_NYET7_M  (USB_H_NYET7_V << USB_H_NYET7_S)
#define USB_H_NYET7_V  0x00000001
#define USB_H_NYET7_S  6
/** USB_H_XACTERR7 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR7    (BIT(7))
#define USB_H_XACTERR7_M  (USB_H_XACTERR7_V << USB_H_XACTERR7_S)
#define USB_H_XACTERR7_V  0x00000001
#define USB_H_XACTERR7_S  7
/** USB_H_BBLERR7 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR7    (BIT(8))
#define USB_H_BBLERR7_M  (USB_H_BBLERR7_V << USB_H_BBLERR7_S)
#define USB_H_BBLERR7_V  0x00000001
#define USB_H_BBLERR7_S  8
/** USB_H_FRMOVRUN7 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN7    (BIT(9))
#define USB_H_FRMOVRUN7_M  (USB_H_FRMOVRUN7_V << USB_H_FRMOVRUN7_S)
#define USB_H_FRMOVRUN7_V  0x00000001
#define USB_H_FRMOVRUN7_S  9
/** USB_H_DATATGLERR7 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR7    (BIT(10))
#define USB_H_DATATGLERR7_M  (USB_H_DATATGLERR7_V << USB_H_DATATGLERR7_S)
#define USB_H_DATATGLERR7_V  0x00000001
#define USB_H_DATATGLERR7_S  10
/** USB_H_BNAINTR7 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR7    (BIT(11))
#define USB_H_BNAINTR7_M  (USB_H_BNAINTR7_V << USB_H_BNAINTR7_S)
#define USB_H_BNAINTR7_V  0x00000001
#define USB_H_BNAINTR7_S  11
/** USB_H_XCS_XACT_ERR7 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR7    (BIT(12))
#define USB_H_XCS_XACT_ERR7_M  (USB_H_XCS_XACT_ERR7_V << USB_H_XCS_XACT_ERR7_S)
#define USB_H_XCS_XACT_ERR7_V  0x00000001
#define USB_H_XCS_XACT_ERR7_S  12
/** USB_H_DESC_LST_ROLLINTR7 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR7    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR7_M  (USB_H_DESC_LST_ROLLINTR7_V << USB_H_DESC_LST_ROLLINTR7_S)
#define USB_H_DESC_LST_ROLLINTR7_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR7_S  13


