espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DIEPINT0_REG register
 *  Device IN Endpoint 0 Interrupt Register
 */
#define USB_DIEPINT0_REG (SOC_DPORT_USB_BASE + 0x908)
/** USB_D_XFERCOMPL0 : R/W1C; bitpos: [0]; default: 0;
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Completed Interrupt
 */
#define USB_D_XFERCOMPL0    (BIT(0))
#define USB_D_XFERCOMPL0_M  (USB_D_XFERCOMPL0_V << USB_D_XFERCOMPL0_S)
#define USB_D_XFERCOMPL0_V  0x00000001
#define USB_D_XFERCOMPL0_S  0
/** USB_D_EPDISBLD0 : R/W1C; bitpos: [1]; default: 0;
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_D_EPDISBLD0    (BIT(1))
#define USB_D_EPDISBLD0_M  (USB_D_EPDISBLD0_V << USB_D_EPDISBLD0_S)
#define USB_D_EPDISBLD0_V  0x00000001
#define USB_D_EPDISBLD0_S  1
/** USB_D_AHBERR0 : R/W1C; bitpos: [2]; default: 0;
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_D_AHBERR0    (BIT(2))
#define USB_D_AHBERR0_M  (USB_D_AHBERR0_V << USB_D_AHBERR0_S)
#define USB_D_AHBERR0_V  0x00000001
#define USB_D_AHBERR0_S  2
/** USB_D_TIMEOUT0 : R/W1C; bitpos: [3]; default: 0;
 *  0x0 : No Timeout interrupt
 *  0x1 : Timeout interrupt
 */
#define USB_D_TIMEOUT0    (BIT(3))
#define USB_D_TIMEOUT0_M  (USB_D_TIMEOUT0_V << USB_D_TIMEOUT0_S)
#define USB_D_TIMEOUT0_V  0x00000001
#define USB_D_TIMEOUT0_S  3
/** USB_D_INTKNTXFEMP0 : R/W1C; bitpos: [4]; default: 0;
 *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
 *  0x1 : IN Token Received when TxFIFO Empty Interrupt
 */
#define USB_D_INTKNTXFEMP0    (BIT(4))
#define USB_D_INTKNTXFEMP0_M  (USB_D_INTKNTXFEMP0_V << USB_D_INTKNTXFEMP0_S)
#define USB_D_INTKNTXFEMP0_V  0x00000001
#define USB_D_INTKNTXFEMP0_S  4
/** USB_D_INTKNEPMIS0 : R/W1C; bitpos: [5]; default: 0;
 *  0x0 : No IN Token Received with EP Mismatch Interrupt
 *  0x1 : IN Token Received with EP Mismatch interrupt
 */
#define USB_D_INTKNEPMIS0    (BIT(5))
#define USB_D_INTKNEPMIS0_M  (USB_D_INTKNEPMIS0_V << USB_D_INTKNEPMIS0_S)
#define USB_D_INTKNEPMIS0_V  0x00000001
#define USB_D_INTKNEPMIS0_S  5
/** USB_D_INEPNAKEFF0 : R/W1C; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective
 *  0x0 : No IN Endpoint NAK Effective interrupt
 *  0x1 : IN Endpoint NAK Effective interrupt
 */
#define USB_D_INEPNAKEFF0    (BIT(6))
#define USB_D_INEPNAKEFF0_M  (USB_D_INEPNAKEFF0_V << USB_D_INEPNAKEFF0_S)
#define USB_D_INEPNAKEFF0_V  0x00000001
#define USB_D_INEPNAKEFF0_S  6
/** USB_D_TXFEMP0 : RO; bitpos: [7]; default: 0;
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty
 *  0x0 : No Transmit FIFO Empty interrupt
 *  0x1 : Transmit FIFO Empty interrupt
 */
#define USB_D_TXFEMP0    (BIT(7))
#define USB_D_TXFEMP0_M  (USB_D_TXFEMP0_V << USB_D_TXFEMP0_S)
#define USB_D_TXFEMP0_V  0x00000001
#define USB_D_TXFEMP0_S  7
/** USB_D_TXFIFOUNDRN0 : R/W1C; bitpos: [8]; default: 0;
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint
 *  0x0 : No Fifo Underrun interrupt
 *  0x1 : Fifo Underrun interrupt
 */
#define USB_D_TXFIFOUNDRN0    (BIT(8))
#define USB_D_TXFIFOUNDRN0_M  (USB_D_TXFIFOUNDRN0_V << USB_D_TXFIFOUNDRN0_S)
#define USB_D_TXFIFOUNDRN0_V  0x00000001
#define USB_D_TXFIFOUNDRN0_S  8
/** USB_D_BNAINTR0 : R/W1C; bitpos: [9]; default: 0;
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_D_BNAINTR0    (BIT(9))
#define USB_D_BNAINTR0_M  (USB_D_BNAINTR0_V << USB_D_BNAINTR0_S)
#define USB_D_BNAINTR0_V  0x00000001
#define USB_D_BNAINTR0_S  9
/** USB_D_PKTDRPSTS0 : R/W1C; bitpos: [11]; default: 0;
 *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
 *  has been dropped. This bit does not have an associated mask bit and does not
 *  generate an interrupt
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status
 */
#define USB_D_PKTDRPSTS0    (BIT(11))
#define USB_D_PKTDRPSTS0_M  (USB_D_PKTDRPSTS0_V << USB_D_PKTDRPSTS0_S)
#define USB_D_PKTDRPSTS0_V  0x00000001
#define USB_D_PKTDRPSTS0_S  11
/** USB_D_BBLEERR0 : R/W1C; bitpos: [12]; default: 0;
 *  The core generates this interrupt when babble is received for the endpoint
 *  0x0 : No interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_D_BBLEERR0    (BIT(12))
#define USB_D_BBLEERR0_M  (USB_D_BBLEERR0_V << USB_D_BBLEERR0_S)
#define USB_D_BBLEERR0_V  0x00000001
#define USB_D_BBLEERR0_S  12
/** USB_D_NAKINTRPT0 : R/W1C; bitpos: [13]; default: 0;
 *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
 *  received by the device
 *  0x0 : No interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_D_NAKINTRPT0    (BIT(13))
#define USB_D_NAKINTRPT0_M  (USB_D_NAKINTRPT0_V << USB_D_NAKINTRPT0_S)
#define USB_D_NAKINTRPT0_V  0x00000001
#define USB_D_NAKINTRPT0_S  13
/** USB_D_NYETINTRPT0 : R/W1C; bitpos: [14]; default: 0;
 *  NYET Interrupt. The core generates this interrupt when a NYET response is
 *  transmitted for a non isochronous OUT endpoint
 *  0x0 : No interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_D_NYETINTRPT0    (BIT(14))
#define USB_D_NYETINTRPT0_M  (USB_D_NYETINTRPT0_V << USB_D_NYETINTRPT0_S)
#define USB_D_NYETINTRPT0_V  0x00000001
#define USB_D_NYETINTRPT0_S  14


/** USB_DIEPINT1_REG register
 *  Device IN Endpoint 1 Interrupt Register
 */
#define USB_DIEPINT1_REG (SOC_DPORT_USB_BASE + 0x928)
/** USB_D_XFERCOMPL1 : R/W1C; bitpos: [0]; default: 0;
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Completed Interrupt
 */
#define USB_D_XFERCOMPL1    (BIT(0))
#define USB_D_XFERCOMPL1_M  (USB_D_XFERCOMPL1_V << USB_D_XFERCOMPL1_S)
#define USB_D_XFERCOMPL1_V  0x00000001
#define USB_D_XFERCOMPL1_S  0
/** USB_D_EPDISBLD1 : R/W1C; bitpos: [1]; default: 0;
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_D_EPDISBLD1    (BIT(1))
#define USB_D_EPDISBLD1_M  (USB_D_EPDISBLD1_V << USB_D_EPDISBLD1_S)
#define USB_D_EPDISBLD1_V  0x00000001
#define USB_D_EPDISBLD1_S  1
/** USB_D_AHBERR1 : R/W1C; bitpos: [2]; default: 0;
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_D_AHBERR1    (BIT(2))
#define USB_D_AHBERR1_M  (USB_D_AHBERR1_V << USB_D_AHBERR1_S)
#define USB_D_AHBERR1_V  0x00000001
#define USB_D_AHBERR1_S  2
/** USB_D_TIMEOUT1 : R/W1C; bitpos: [3]; default: 0;
 *  0x0 : No Timeout interrupt
 *  0x1 : Timeout interrupt
 */
#define USB_D_TIMEOUT1    (BIT(3))
#define USB_D_TIMEOUT1_M  (USB_D_TIMEOUT1_V << USB_D_TIMEOUT1_S)
#define USB_D_TIMEOUT1_V  0x00000001
#define USB_D_TIMEOUT1_S  3
/** USB_D_INTKNTXFEMP1 : R/W1C; bitpos: [4]; default: 0;
 *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
 *  0x1 : IN Token Received when TxFIFO Empty Interrupt
 */
#define USB_D_INTKNTXFEMP1    (BIT(4))
#define USB_D_INTKNTXFEMP1_M  (USB_D_INTKNTXFEMP1_V << USB_D_INTKNTXFEMP1_S)
#define USB_D_INTKNTXFEMP1_V  0x00000001
#define USB_D_INTKNTXFEMP1_S  4
/** USB_D_INTKNEPMIS1 : R/W1C; bitpos: [5]; default: 0;
 *  0x0 : No IN Token Received with EP Mismatch Interrupt
 *  0x1 : IN Token Received with EP Mismatch interrupt
 */
#define USB_D_INTKNEPMIS1    (BIT(5))
#define USB_D_INTKNEPMIS1_M  (USB_D_INTKNEPMIS1_V << USB_D_INTKNEPMIS1_S)
#define USB_D_INTKNEPMIS1_V  0x00000001
#define USB_D_INTKNEPMIS1_S  5
/** USB_D_INEPNAKEFF1 : R/W1C; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective
 *  0x0 : No IN Endpoint NAK Effective interrupt
 *  0x1 : IN Endpoint NAK Effective interrupt
 */
#define USB_D_INEPNAKEFF1    (BIT(6))
#define USB_D_INEPNAKEFF1_M  (USB_D_INEPNAKEFF1_V << USB_D_INEPNAKEFF1_S)
#define USB_D_INEPNAKEFF1_V  0x00000001
#define USB_D_INEPNAKEFF1_S  6
/** USB_D_TXFEMP1 : RO; bitpos: [7]; default: 0;
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty
 *  0x0 : No Transmit FIFO Empty interrupt
 *  0x1 : Transmit FIFO Empty interrupt
 */
#define USB_D_TXFEMP1    (BIT(7))
#define USB_D_TXFEMP1_M  (USB_D_TXFEMP1_V << USB_D_TXFEMP1_S)
#define USB_D_TXFEMP1_V  0x00000001
#define USB_D_TXFEMP1_S  7
/** USB_D_TXFIFOUNDRN1 : R/W1C; bitpos: [8]; default: 0;
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint
 *  0x0 : No Fifo Underrun interrupt
 *  0x1 : Fifo Underrun interrupt
 */
#define USB_D_TXFIFOUNDRN1    (BIT(8))
#define USB_D_TXFIFOUNDRN1_M  (USB_D_TXFIFOUNDRN1_V << USB_D_TXFIFOUNDRN1_S)
#define USB_D_TXFIFOUNDRN1_V  0x00000001
#define USB_D_TXFIFOUNDRN1_S  8
/** USB_D_BNAINTR1 : R/W1C; bitpos: [9]; default: 0;
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_D_BNAINTR1    (BIT(9))
#define USB_D_BNAINTR1_M  (USB_D_BNAINTR1_V << USB_D_BNAINTR1_S)
#define USB_D_BNAINTR1_V  0x00000001
#define USB_D_BNAINTR1_S  9
/** USB_D_PKTDRPSTS1 : R/W1C; bitpos: [11]; default: 0;
 *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
 *  has been dropped. This bit does not have an associated mask bit and does not
 *  generate an interrupt
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status
 */
#define USB_D_PKTDRPSTS1    (BIT(11))
#define USB_D_PKTDRPSTS1_M  (USB_D_PKTDRPSTS1_V << USB_D_PKTDRPSTS1_S)
#define USB_D_PKTDRPSTS1_V  0x00000001
#define USB_D_PKTDRPSTS1_S  11
/** USB_D_BBLEERR1 : R/W1C; bitpos: [12]; default: 0;
 *  The core generates this interrupt when babble is received for the endpoint
 *  0x0 : No interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_D_BBLEERR1    (BIT(12))
#define USB_D_BBLEERR1_M  (USB_D_BBLEERR1_V << USB_D_BBLEERR1_S)
#define USB_D_BBLEERR1_V  0x00000001
#define USB_D_BBLEERR1_S  12
/** USB_D_NAKINTRPT1 : R/W1C; bitpos: [13]; default: 0;
 *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
 *  received by the device
 *  0x0 : No interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_D_NAKINTRPT1    (BIT(13))
#define USB_D_NAKINTRPT1_M  (USB_D_NAKINTRPT1_V << USB_D_NAKINTRPT1_S)
#define USB_D_NAKINTRPT1_V  0x00000001
#define USB_D_NAKINTRPT1_S  13
/** USB_D_NYETINTRPT1 : R/W1C; bitpos: [14]; default: 0;
 *  NYET Interrupt. The core generates this interrupt when a NYET response is
 *  transmitted for a non isochronous OUT endpoint
 *  0x0 : No interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_D_NYETINTRPT1    (BIT(14))
#define USB_D_NYETINTRPT1_M  (USB_D_NYETINTRPT1_V << USB_D_NYETINTRPT1_S)
#define USB_D_NYETINTRPT1_V  0x00000001
#define USB_D_NYETINTRPT1_S  14


/** USB_DIEPINT2_REG register
 *  Device IN Endpoint 2 Interrupt Register
 */
#define USB_DIEPINT2_REG (SOC_DPORT_USB_BASE + 0x948)
/** USB_D_XFERCOMPL2 : R/W1C; bitpos: [0]; default: 0;
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Completed Interrupt
 */
#define USB_D_XFERCOMPL2    (BIT(0))
#define USB_D_XFERCOMPL2_M  (USB_D_XFERCOMPL2_V << USB_D_XFERCOMPL2_S)
#define USB_D_XFERCOMPL2_V  0x00000001
#define USB_D_XFERCOMPL2_S  0
/** USB_D_EPDISBLD2 : R/W1C; bitpos: [1]; default: 0;
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_D_EPDISBLD2    (BIT(1))
#define USB_D_EPDISBLD2_M  (USB_D_EPDISBLD2_V << USB_D_EPDISBLD2_S)
#define USB_D_EPDISBLD2_V  0x00000001
#define USB_D_EPDISBLD2_S  1
/** USB_D_AHBERR2 : R/W1C; bitpos: [2]; default: 0;
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_D_AHBERR2    (BIT(2))
#define USB_D_AHBERR2_M  (USB_D_AHBERR2_V << USB_D_AHBERR2_S)
#define USB_D_AHBERR2_V  0x00000001
#define USB_D_AHBERR2_S  2
/** USB_D_TIMEOUT2 : R/W1C; bitpos: [3]; default: 0;
 *  0x0 : No Timeout interrupt
 *  0x1 : Timeout interrupt
 */
#define USB_D_TIMEOUT2    (BIT(3))
#define USB_D_TIMEOUT2_M  (USB_D_TIMEOUT2_V << USB_D_TIMEOUT2_S)
#define USB_D_TIMEOUT2_V  0x00000001
#define USB_D_TIMEOUT2_S  3
/** USB_D_INTKNTXFEMP2 : R/W1C; bitpos: [4]; default: 0;
 *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
 *  0x1 : IN Token Received when TxFIFO Empty Interrupt
 */
#define USB_D_INTKNTXFEMP2    (BIT(4))
#define USB_D_INTKNTXFEMP2_M  (USB_D_INTKNTXFEMP2_V << USB_D_INTKNTXFEMP2_S)
#define USB_D_INTKNTXFEMP2_V  0x00000001
#define USB_D_INTKNTXFEMP2_S  4
/** USB_D_INTKNEPMIS2 : R/W1C; bitpos: [5]; default: 0;
 *  0x0 : No IN Token Received with EP Mismatch Interrupt
 *  0x1 : IN Token Received with EP Mismatch interrupt
 */
#define USB_D_INTKNEPMIS2    (BIT(5))
#define USB_D_INTKNEPMIS2_M  (USB_D_INTKNEPMIS2_V << USB_D_INTKNEPMIS2_S)
#define USB_D_INTKNEPMIS2_V  0x00000001
#define USB_D_INTKNEPMIS2_S  5
/** USB_D_INEPNAKEFF2 : R/W1C; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective
 *  0x0 : No IN Endpoint NAK Effective interrupt
 *  0x1 : IN Endpoint NAK Effective interrupt
 */
#define USB_D_INEPNAKEFF2    (BIT(6))
#define USB_D_INEPNAKEFF2_M  (USB_D_INEPNAKEFF2_V << USB_D_INEPNAKEFF2_S)
#define USB_D_INEPNAKEFF2_V  0x00000001
#define USB_D_INEPNAKEFF2_S  6
/** USB_D_TXFEMP2 : RO; bitpos: [7]; default: 0;
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty
 *  0x0 : No Transmit FIFO Empty interrupt
 *  0x1 : Transmit FIFO Empty interrupt
 */
#define USB_D_TXFEMP2    (BIT(7))
#define USB_D_TXFEMP2_M  (USB_D_TXFEMP2_V << USB_D_TXFEMP2_S)
#define USB_D_TXFEMP2_V  0x00000001
#define USB_D_TXFEMP2_S  7
/** USB_D_TXFIFOUNDRN2 : R/W1C; bitpos: [8]; default: 0;
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint
 *  0x0 : No Fifo Underrun interrupt
 *  0x1 : Fifo Underrun interrupt
 */
#define USB_D_TXFIFOUNDRN2    (BIT(8))
#define USB_D_TXFIFOUNDRN2_M  (USB_D_TXFIFOUNDRN2_V << USB_D_TXFIFOUNDRN2_S)
#define USB_D_TXFIFOUNDRN2_V  0x00000001
#define USB_D_TXFIFOUNDRN2_S  8
/** USB_D_BNAINTR2 : R/W1C; bitpos: [9]; default: 0;
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_D_BNAINTR2    (BIT(9))
#define USB_D_BNAINTR2_M  (USB_D_BNAINTR2_V << USB_D_BNAINTR2_S)
#define USB_D_BNAINTR2_V  0x00000001
#define USB_D_BNAINTR2_S  9
/** USB_D_PKTDRPSTS2 : R/W1C; bitpos: [11]; default: 0;
 *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
 *  has been dropped. This bit does not have an associated mask bit and does not
 *  generate an interrupt
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status
 */
#define USB_D_PKTDRPSTS2    (BIT(11))
#define USB_D_PKTDRPSTS2_M  (USB_D_PKTDRPSTS2_V << USB_D_PKTDRPSTS2_S)
#define USB_D_PKTDRPSTS2_V  0x00000001
#define USB_D_PKTDRPSTS2_S  11
/** USB_D_BBLEERR2 : R/W1C; bitpos: [12]; default: 0;
 *  The core generates this interrupt when babble is received for the endpoint
 *  0x0 : No interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_D_BBLEERR2    (BIT(12))
#define USB_D_BBLEERR2_M  (USB_D_BBLEERR2_V << USB_D_BBLEERR2_S)
#define USB_D_BBLEERR2_V  0x00000001
#define USB_D_BBLEERR2_S  12
/** USB_D_NAKINTRPT2 : R/W1C; bitpos: [13]; default: 0;
 *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
 *  received by the device
 *  0x0 : No interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_D_NAKINTRPT2    (BIT(13))
#define USB_D_NAKINTRPT2_M  (USB_D_NAKINTRPT2_V << USB_D_NAKINTRPT2_S)
#define USB_D_NAKINTRPT2_V  0x00000001
#define USB_D_NAKINTRPT2_S  13
/** USB_D_NYETINTRPT2 : R/W1C; bitpos: [14]; default: 0;
 *  NYET Interrupt. The core generates this interrupt when a NYET response is
 *  transmitted for a non isochronous OUT endpoint
 *  0x0 : No interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_D_NYETINTRPT2    (BIT(14))
#define USB_D_NYETINTRPT2_M  (USB_D_NYETINTRPT2_V << USB_D_NYETINTRPT2_S)
#define USB_D_NYETINTRPT2_V  0x00000001
#define USB_D_NYETINTRPT2_S  14


/** USB_DIEPINT3_REG register
 *  Device IN Endpoint 3 Interrupt Register
 */
#define USB_DIEPINT3_REG (SOC_DPORT_USB_BASE + 0x968)
/** USB_D_XFERCOMPL3 : R/W1C; bitpos: [0]; default: 0;
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Completed Interrupt
 */
#define USB_D_XFERCOMPL3    (BIT(0))
#define USB_D_XFERCOMPL3_M  (USB_D_XFERCOMPL3_V << USB_D_XFERCOMPL3_S)
#define USB_D_XFERCOMPL3_V  0x00000001
#define USB_D_XFERCOMPL3_S  0
/** USB_D_EPDISBLD3 : R/W1C; bitpos: [1]; default: 0;
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_D_EPDISBLD3    (BIT(1))
#define USB_D_EPDISBLD3_M  (USB_D_EPDISBLD3_V << USB_D_EPDISBLD3_S)
#define USB_D_EPDISBLD3_V  0x00000001
#define USB_D_EPDISBLD3_S  1
/** USB_D_AHBERR3 : R/W1C; bitpos: [2]; default: 0;
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_D_AHBERR3    (BIT(2))
#define USB_D_AHBERR3_M  (USB_D_AHBERR3_V << USB_D_AHBERR3_S)
#define USB_D_AHBERR3_V  0x00000001
#define USB_D_AHBERR3_S  2
/** USB_D_TIMEOUT3 : R/W1C; bitpos: [3]; default: 0;
 *  0x0 : No Timeout interrupt
 *  0x1 : Timeout interrupt
 */
#define USB_D_TIMEOUT3    (BIT(3))
#define USB_D_TIMEOUT3_M  (USB_D_TIMEOUT3_V << USB_D_TIMEOUT3_S)
#define USB_D_TIMEOUT3_V  0x00000001
#define USB_D_TIMEOUT3_S  3
/** USB_D_INTKNTXFEMP3 : R/W1C; bitpos: [4]; default: 0;
 *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
 *  0x1 : IN Token Received when TxFIFO Empty Interrupt
 */
#define USB_D_INTKNTXFEMP3    (BIT(4))
#define USB_D_INTKNTXFEMP3_M  (USB_D_INTKNTXFEMP3_V << USB_D_INTKNTXFEMP3_S)
#define USB_D_INTKNTXFEMP3_V  0x00000001
#define USB_D_INTKNTXFEMP3_S  4
/** USB_D_INTKNEPMIS3 : R/W1C; bitpos: [5]; default: 0;
 *  0x0 : No IN Token Received with EP Mismatch Interrupt
 *  0x1 : IN Token Received with EP Mismatch interrupt
 */
#define USB_D_INTKNEPMIS3    (BIT(5))
#define USB_D_INTKNEPMIS3_M  (USB_D_INTKNEPMIS3_V << USB_D_INTKNEPMIS3_S)
#define USB_D_INTKNEPMIS3_V  0x00000001
#define USB_D_INTKNEPMIS3_S  5
/** USB_D_INEPNAKEFF3 : R/W1C; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective
 *  0x0 : No IN Endpoint NAK Effective interrupt
 *  0x1 : IN Endpoint NAK Effective interrupt
 */
#define USB_D_INEPNAKEFF3    (BIT(6))
#define USB_D_INEPNAKEFF3_M  (USB_D_INEPNAKEFF3_V << USB_D_INEPNAKEFF3_S)
#define USB_D_INEPNAKEFF3_V  0x00000001
#define USB_D_INEPNAKEFF3_S  6
/** USB_D_TXFEMP3 : RO; bitpos: [7]; default: 0;
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty
 *  0x0 : No Transmit FIFO Empty interrupt
 *  0x1 : Transmit FIFO Empty interrupt
 */
#define USB_D_TXFEMP3    (BIT(7))
#define USB_D_TXFEMP3_M  (USB_D_TXFEMP3_V << USB_D_TXFEMP3_S)
#define USB_D_TXFEMP3_V  0x00000001
#define USB_D_TXFEMP3_S  7
/** USB_D_TXFIFOUNDRN3 : R/W1C; bitpos: [8]; default: 0;
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint
 *  0x0 : No Fifo Underrun interrupt
 *  0x1 : Fifo Underrun interrupt
 */
#define USB_D_TXFIFOUNDRN3    (BIT(8))
#define USB_D_TXFIFOUNDRN3_M  (USB_D_TXFIFOUNDRN3_V << USB_D_TXFIFOUNDRN3_S)
#define USB_D_TXFIFOUNDRN3_V  0x00000001
#define USB_D_TXFIFOUNDRN3_S  8
/** USB_D_BNAINTR3 : R/W1C; bitpos: [9]; default: 0;
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_D_BNAINTR3    (BIT(9))
#define USB_D_BNAINTR3_M  (USB_D_BNAINTR3_V << USB_D_BNAINTR3_S)
#define USB_D_BNAINTR3_V  0x00000001
#define USB_D_BNAINTR3_S  9
/** USB_D_PKTDRPSTS3 : R/W1C; bitpos: [11]; default: 0;
 *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
 *  has been dropped. This bit does not have an associated mask bit and does not
 *  generate an interrupt
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status
 */
#define USB_D_PKTDRPSTS3    (BIT(11))
#define USB_D_PKTDRPSTS3_M  (USB_D_PKTDRPSTS3_V << USB_D_PKTDRPSTS3_S)
#define USB_D_PKTDRPSTS3_V  0x00000001
#define USB_D_PKTDRPSTS3_S  11
/** USB_D_BBLEERR3 : R/W1C; bitpos: [12]; default: 0;
 *  The core generates this interrupt when babble is received for the endpoint
 *  0x0 : No interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_D_BBLEERR3    (BIT(12))
#define USB_D_BBLEERR3_M  (USB_D_BBLEERR3_V << USB_D_BBLEERR3_S)
#define USB_D_BBLEERR3_V  0x00000001
#define USB_D_BBLEERR3_S  12
/** USB_D_NAKINTRPT3 : R/W1C; bitpos: [13]; default: 0;
 *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
 *  received by the device
 *  0x0 : No interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_D_NAKINTRPT3    (BIT(13))
#define USB_D_NAKINTRPT3_M  (USB_D_NAKINTRPT3_V << USB_D_NAKINTRPT3_S)
#define USB_D_NAKINTRPT3_V  0x00000001
#define USB_D_NAKINTRPT3_S  13
/** USB_D_NYETINTRPT3 : R/W1C; bitpos: [14]; default: 0;
 *  NYET Interrupt. The core generates this interrupt when a NYET response is
 *  transmitted for a non isochronous OUT endpoint
 *  0x0 : No interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_D_NYETINTRPT3    (BIT(14))
#define USB_D_NYETINTRPT3_M  (USB_D_NYETINTRPT3_V << USB_D_NYETINTRPT3_S)
#define USB_D_NYETINTRPT3_V  0x00000001
#define USB_D_NYETINTRPT3_S  14


