espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_DOEPINT1_REG register
 *  Device OUT Endpoint 1 Interrupt Register
 */
#define USB_DOEPINT1_REG (SOC_DPORT_USB_BASE + 0xb28)
/** USB_XFERCOMPL1 : R/W1C; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Complete Interrupt
 */
#define USB_XFERCOMPL1    (BIT(0))
#define USB_XFERCOMPL1_M  (USB_XFERCOMPL1_V << USB_XFERCOMPL1_S)
#define USB_XFERCOMPL1_V  0x00000001
#define USB_XFERCOMPL1_S  0
/** USB_EPDISBLD1 : R/W1C; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_EPDISBLD1    (BIT(1))
#define USB_EPDISBLD1_M  (USB_EPDISBLD1_V << USB_EPDISBLD1_S)
#define USB_EPDISBLD1_V  0x00000001
#define USB_EPDISBLD1_S  1
/** USB_AHBERR1 : R/W1C; bitpos: [2]; default: 0;
 *  AHB Error
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_AHBERR1    (BIT(2))
#define USB_AHBERR1_M  (USB_AHBERR1_V << USB_AHBERR1_S)
#define USB_AHBERR1_V  0x00000001
#define USB_AHBERR1_S  2
/** USB_SETUP1 : R/W1C; bitpos: [3]; default: 0;
 *  SETUP Phase Done
 *  0x0 : No SETUP Phase Done
 *  0x1 : SETUP Phase Done
 */
#define USB_SETUP1    (BIT(3))
#define USB_SETUP1_M  (USB_SETUP1_V << USB_SETUP1_S)
#define USB_SETUP1_V  0x00000001
#define USB_SETUP1_S  3
/** USB_OUTTKNEPDIS1 : R/W1C; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled
 *  0x0 : No OUT Token Received When Endpoint Disabled
 *  0x1 : OUT Token Received When Endpoint Disabled
 */
#define USB_OUTTKNEPDIS1    (BIT(4))
#define USB_OUTTKNEPDIS1_M  (USB_OUTTKNEPDIS1_V << USB_OUTTKNEPDIS1_S)
#define USB_OUTTKNEPDIS1_V  0x00000001
#define USB_OUTTKNEPDIS1_S  4
/** USB_STSPHSERCVD1 : R/W1C; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write
 *  0x0 : No Status Phase Received for Control Write
 *  0x1 : Status Phase Received for Control Write
 */
#define USB_STSPHSERCVD1    (BIT(5))
#define USB_STSPHSERCVD1_M  (USB_STSPHSERCVD1_V << USB_STSPHSERCVD1_S)
#define USB_STSPHSERCVD1_V  0x00000001
#define USB_STSPHSERCVD1_S  5
/** USB_BACK2BACKSETUP1 : R/W1C; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received
 *  0x0 : No Back-to-Back SETUP Packets Received
 *  0x1 : Back-to-Back SETUP Packets Received
 */
#define USB_BACK2BACKSETUP1    (BIT(6))
#define USB_BACK2BACKSETUP1_M  (USB_BACK2BACKSETUP1_V << USB_BACK2BACKSETUP1_S)
#define USB_BACK2BACKSETUP1_V  0x00000001
#define USB_BACK2BACKSETUP1_S  6
/** USB_OUTPKTERR1 : R/W1C; bitpos: [8]; default: 0;
 *  OUT Packet Error
 *  0x0 : No OUT Packet Error
 *  0x1 : OUT Packet Error
 */
#define USB_OUTPKTERR1    (BIT(8))
#define USB_OUTPKTERR1_M  (USB_OUTPKTERR1_V << USB_OUTPKTERR1_S)
#define USB_OUTPKTERR1_V  0x00000001
#define USB_OUTPKTERR1_S  8
/** USB_BNAINTR1 : R/W1C; bitpos: [9]; default: 0;
 *  Buffer Not Available Interrupt
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_BNAINTR1    (BIT(9))
#define USB_BNAINTR1_M  (USB_BNAINTR1_V << USB_BNAINTR1_S)
#define USB_BNAINTR1_V  0x00000001
#define USB_BNAINTR1_S  9
/** USB_PKTDRPSTS1 : R/W1C; bitpos: [11]; default: 0;
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status interrupt
 */
#define USB_PKTDRPSTS1    (BIT(11))
#define USB_PKTDRPSTS1_M  (USB_PKTDRPSTS1_V << USB_PKTDRPSTS1_S)
#define USB_PKTDRPSTS1_V  0x00000001
#define USB_PKTDRPSTS1_S  11
/** USB_BBLEERR1 : R/W1C; bitpos: [12]; default: 0;
 *  0x0 : No BbleErr interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_BBLEERR1    (BIT(12))
#define USB_BBLEERR1_M  (USB_BBLEERR1_V << USB_BBLEERR1_S)
#define USB_BBLEERR1_V  0x00000001
#define USB_BBLEERR1_S  12
/** USB_NAKINTRPT1 : R/W1C; bitpos: [13]; default: 0;
 *  0x0 : No NAK interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_NAKINTRPT1    (BIT(13))
#define USB_NAKINTRPT1_M  (USB_NAKINTRPT1_V << USB_NAKINTRPT1_S)
#define USB_NAKINTRPT1_V  0x00000001
#define USB_NAKINTRPT1_S  13
/** USB_NYEPINTRPT1 : R/W1C; bitpos: [14]; default: 0;
 *  0x0 : No NYET interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_NYEPINTRPT1    (BIT(14))
#define USB_NYEPINTRPT1_M  (USB_NYEPINTRPT1_V << USB_NYEPINTRPT1_S)
#define USB_NYEPINTRPT1_V  0x00000001
#define USB_NYEPINTRPT1_S  14
/** USB_STUPPKTRCVD1 : R/W1C; bitpos: [15]; default: 0;
 *  0x0 : No Setup packet received
 *  0x1 : Setup packet received
 */
#define USB_STUPPKTRCVD1    (BIT(15))
#define USB_STUPPKTRCVD1_M  (USB_STUPPKTRCVD1_V << USB_STUPPKTRCVD1_S)
#define USB_STUPPKTRCVD1_V  0x00000001
#define USB_STUPPKTRCVD1_S  15


/** USB_DOEPINT2_REG register
 *  Device OUT Endpoint 2 Interrupt Register
 */
#define USB_DOEPINT2_REG (SOC_DPORT_USB_BASE + 0xb48)
/** USB_XFERCOMPL2 : R/W1C; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Complete Interrupt
 */
#define USB_XFERCOMPL2    (BIT(0))
#define USB_XFERCOMPL2_M  (USB_XFERCOMPL2_V << USB_XFERCOMPL2_S)
#define USB_XFERCOMPL2_V  0x00000001
#define USB_XFERCOMPL2_S  0
/** USB_EPDISBLD2 : R/W1C; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_EPDISBLD2    (BIT(1))
#define USB_EPDISBLD2_M  (USB_EPDISBLD2_V << USB_EPDISBLD2_S)
#define USB_EPDISBLD2_V  0x00000001
#define USB_EPDISBLD2_S  1
/** USB_AHBERR2 : R/W1C; bitpos: [2]; default: 0;
 *  AHB Error
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_AHBERR2    (BIT(2))
#define USB_AHBERR2_M  (USB_AHBERR2_V << USB_AHBERR2_S)
#define USB_AHBERR2_V  0x00000001
#define USB_AHBERR2_S  2
/** USB_SETUP2 : R/W1C; bitpos: [3]; default: 0;
 *  SETUP Phase Done
 *  0x0 : No SETUP Phase Done
 *  0x1 : SETUP Phase Done
 */
#define USB_SETUP2    (BIT(3))
#define USB_SETUP2_M  (USB_SETUP2_V << USB_SETUP2_S)
#define USB_SETUP2_V  0x00000001
#define USB_SETUP2_S  3
/** USB_OUTTKNEPDIS2 : R/W1C; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled
 *  0x0 : No OUT Token Received When Endpoint Disabled
 *  0x1 : OUT Token Received When Endpoint Disabled
 */
#define USB_OUTTKNEPDIS2    (BIT(4))
#define USB_OUTTKNEPDIS2_M  (USB_OUTTKNEPDIS2_V << USB_OUTTKNEPDIS2_S)
#define USB_OUTTKNEPDIS2_V  0x00000001
#define USB_OUTTKNEPDIS2_S  4
/** USB_STSPHSERCVD2 : R/W1C; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write
 *  0x0 : No Status Phase Received for Control Write
 *  0x1 : Status Phase Received for Control Write
 */
#define USB_STSPHSERCVD2    (BIT(5))
#define USB_STSPHSERCVD2_M  (USB_STSPHSERCVD2_V << USB_STSPHSERCVD2_S)
#define USB_STSPHSERCVD2_V  0x00000001
#define USB_STSPHSERCVD2_S  5
/** USB_BACK2BACKSETUP2 : R/W1C; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received
 *  0x0 : No Back-to-Back SETUP Packets Received
 *  0x1 : Back-to-Back SETUP Packets Received
 */
#define USB_BACK2BACKSETUP2    (BIT(6))
#define USB_BACK2BACKSETUP2_M  (USB_BACK2BACKSETUP2_V << USB_BACK2BACKSETUP2_S)
#define USB_BACK2BACKSETUP2_V  0x00000001
#define USB_BACK2BACKSETUP2_S  6
/** USB_OUTPKTERR2 : R/W1C; bitpos: [8]; default: 0;
 *  OUT Packet Error
 *  0x0 : No OUT Packet Error
 *  0x1 : OUT Packet Error
 */
#define USB_OUTPKTERR2    (BIT(8))
#define USB_OUTPKTERR2_M  (USB_OUTPKTERR2_V << USB_OUTPKTERR2_S)
#define USB_OUTPKTERR2_V  0x00000001
#define USB_OUTPKTERR2_S  8
/** USB_BNAINTR2 : R/W1C; bitpos: [9]; default: 0;
 *  Buffer Not Available Interrupt
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_BNAINTR2    (BIT(9))
#define USB_BNAINTR2_M  (USB_BNAINTR2_V << USB_BNAINTR2_S)
#define USB_BNAINTR2_V  0x00000001
#define USB_BNAINTR2_S  9
/** USB_PKTDRPSTS2 : R/W1C; bitpos: [11]; default: 0;
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status interrupt
 */
#define USB_PKTDRPSTS2    (BIT(11))
#define USB_PKTDRPSTS2_M  (USB_PKTDRPSTS2_V << USB_PKTDRPSTS2_S)
#define USB_PKTDRPSTS2_V  0x00000001
#define USB_PKTDRPSTS2_S  11
/** USB_BBLEERR2 : R/W1C; bitpos: [12]; default: 0;
 *  0x0 : No BbleErr interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_BBLEERR2    (BIT(12))
#define USB_BBLEERR2_M  (USB_BBLEERR2_V << USB_BBLEERR2_S)
#define USB_BBLEERR2_V  0x00000001
#define USB_BBLEERR2_S  12
/** USB_NAKINTRPT2 : R/W1C; bitpos: [13]; default: 0;
 *  0x0 : No NAK interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_NAKINTRPT2    (BIT(13))
#define USB_NAKINTRPT2_M  (USB_NAKINTRPT2_V << USB_NAKINTRPT2_S)
#define USB_NAKINTRPT2_V  0x00000001
#define USB_NAKINTRPT2_S  13
/** USB_NYEPINTRPT2 : R/W1C; bitpos: [14]; default: 0;
 *  0x0 : No NYET interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_NYEPINTRPT2    (BIT(14))
#define USB_NYEPINTRPT2_M  (USB_NYEPINTRPT2_V << USB_NYEPINTRPT2_S)
#define USB_NYEPINTRPT2_V  0x00000001
#define USB_NYEPINTRPT2_S  14
/** USB_STUPPKTRCVD2 : R/W1C; bitpos: [15]; default: 0;
 *  0x0 : No Setup packet received
 *  0x1 : Setup packet received
 */
#define USB_STUPPKTRCVD2    (BIT(15))
#define USB_STUPPKTRCVD2_M  (USB_STUPPKTRCVD2_V << USB_STUPPKTRCVD2_S)
#define USB_STUPPKTRCVD2_V  0x00000001
#define USB_STUPPKTRCVD2_S  15


/** USB_DOEPINT3_REG register
 *  Device OUT Endpoint 3 Interrupt Register
 */
#define USB_DOEPINT3_REG (SOC_DPORT_USB_BASE + 0xb68)
/** USB_XFERCOMPL3 : R/W1C; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Complete Interrupt
 */
#define USB_XFERCOMPL3    (BIT(0))
#define USB_XFERCOMPL3_M  (USB_XFERCOMPL3_V << USB_XFERCOMPL3_S)
#define USB_XFERCOMPL3_V  0x00000001
#define USB_XFERCOMPL3_S  0
/** USB_EPDISBLD3 : R/W1C; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_EPDISBLD3    (BIT(1))
#define USB_EPDISBLD3_M  (USB_EPDISBLD3_V << USB_EPDISBLD3_S)
#define USB_EPDISBLD3_V  0x00000001
#define USB_EPDISBLD3_S  1
/** USB_AHBERR3 : R/W1C; bitpos: [2]; default: 0;
 *  AHB Error
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_AHBERR3    (BIT(2))
#define USB_AHBERR3_M  (USB_AHBERR3_V << USB_AHBERR3_S)
#define USB_AHBERR3_V  0x00000001
#define USB_AHBERR3_S  2
/** USB_SETUP3 : R/W1C; bitpos: [3]; default: 0;
 *  SETUP Phase Done
 *  0x0 : No SETUP Phase Done
 *  0x1 : SETUP Phase Done
 */
#define USB_SETUP3    (BIT(3))
#define USB_SETUP3_M  (USB_SETUP3_V << USB_SETUP3_S)
#define USB_SETUP3_V  0x00000001
#define USB_SETUP3_S  3
/** USB_OUTTKNEPDIS3 : R/W1C; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled
 *  0x0 : No OUT Token Received When Endpoint Disabled
 *  0x1 : OUT Token Received When Endpoint Disabled
 */
#define USB_OUTTKNEPDIS3    (BIT(4))
#define USB_OUTTKNEPDIS3_M  (USB_OUTTKNEPDIS3_V << USB_OUTTKNEPDIS3_S)
#define USB_OUTTKNEPDIS3_V  0x00000001
#define USB_OUTTKNEPDIS3_S  4
/** USB_STSPHSERCVD3 : R/W1C; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write
 *  0x0 : No Status Phase Received for Control Write
 *  0x1 : Status Phase Received for Control Write
 */
#define USB_STSPHSERCVD3    (BIT(5))
#define USB_STSPHSERCVD3_M  (USB_STSPHSERCVD3_V << USB_STSPHSERCVD3_S)
#define USB_STSPHSERCVD3_V  0x00000001
#define USB_STSPHSERCVD3_S  5
/** USB_BACK2BACKSETUP3 : R/W1C; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received
 *  0x0 : No Back-to-Back SETUP Packets Received
 *  0x1 : Back-to-Back SETUP Packets Received
 */
#define USB_BACK2BACKSETUP3    (BIT(6))
#define USB_BACK2BACKSETUP3_M  (USB_BACK2BACKSETUP3_V << USB_BACK2BACKSETUP3_S)
#define USB_BACK2BACKSETUP3_V  0x00000001
#define USB_BACK2BACKSETUP3_S  6
/** USB_OUTPKTERR3 : R/W1C; bitpos: [8]; default: 0;
 *  OUT Packet Error
 *  0x0 : No OUT Packet Error
 *  0x1 : OUT Packet Error
 */
#define USB_OUTPKTERR3    (BIT(8))
#define USB_OUTPKTERR3_M  (USB_OUTPKTERR3_V << USB_OUTPKTERR3_S)
#define USB_OUTPKTERR3_V  0x00000001
#define USB_OUTPKTERR3_S  8
/** USB_BNAINTR3 : R/W1C; bitpos: [9]; default: 0;
 *  Buffer Not Available Interrupt
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_BNAINTR3    (BIT(9))
#define USB_BNAINTR3_M  (USB_BNAINTR3_V << USB_BNAINTR3_S)
#define USB_BNAINTR3_V  0x00000001
#define USB_BNAINTR3_S  9
/** USB_PKTDRPSTS3 : R/W1C; bitpos: [11]; default: 0;
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status interrupt
 */
#define USB_PKTDRPSTS3    (BIT(11))
#define USB_PKTDRPSTS3_M  (USB_PKTDRPSTS3_V << USB_PKTDRPSTS3_S)
#define USB_PKTDRPSTS3_V  0x00000001
#define USB_PKTDRPSTS3_S  11
/** USB_BBLEERR3 : R/W1C; bitpos: [12]; default: 0;
 *  0x0 : No BbleErr interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_BBLEERR3    (BIT(12))
#define USB_BBLEERR3_M  (USB_BBLEERR3_V << USB_BBLEERR3_S)
#define USB_BBLEERR3_V  0x00000001
#define USB_BBLEERR3_S  12
/** USB_NAKINTRPT3 : R/W1C; bitpos: [13]; default: 0;
 *  0x0 : No NAK interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_NAKINTRPT3    (BIT(13))
#define USB_NAKINTRPT3_M  (USB_NAKINTRPT3_V << USB_NAKINTRPT3_S)
#define USB_NAKINTRPT3_V  0x00000001
#define USB_NAKINTRPT3_S  13
/** USB_NYEPINTRPT3 : R/W1C; bitpos: [14]; default: 0;
 *  0x0 : No NYET interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_NYEPINTRPT3    (BIT(14))
#define USB_NYEPINTRPT3_M  (USB_NYEPINTRPT3_V << USB_NYEPINTRPT3_S)
#define USB_NYEPINTRPT3_V  0x00000001
#define USB_NYEPINTRPT3_S  14
/** USB_STUPPKTRCVD3 : R/W1C; bitpos: [15]; default: 0;
 *  0x0 : No Setup packet received
 *  0x1 : Setup packet received
 */
#define USB_STUPPKTRCVD3    (BIT(15))
#define USB_STUPPKTRCVD3_M  (USB_STUPPKTRCVD3_V << USB_STUPPKTRCVD3_S)
#define USB_STUPPKTRCVD3_V  0x00000001
#define USB_STUPPKTRCVD3_S  15


/** USB_DOEPINT4_REG register
 *  Device OUT Endpoint 4 Interrupt Register
 */
#define USB_DOEPINT4_REG (SOC_DPORT_USB_BASE + 0xb88)
/** USB_XFERCOMPL4 : R/W1C; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Complete Interrupt
 */
#define USB_XFERCOMPL4    (BIT(0))
#define USB_XFERCOMPL4_M  (USB_XFERCOMPL4_V << USB_XFERCOMPL4_S)
#define USB_XFERCOMPL4_V  0x00000001
#define USB_XFERCOMPL4_S  0
/** USB_EPDISBLD4 : R/W1C; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_EPDISBLD4    (BIT(1))
#define USB_EPDISBLD4_M  (USB_EPDISBLD4_V << USB_EPDISBLD4_S)
#define USB_EPDISBLD4_V  0x00000001
#define USB_EPDISBLD4_S  1
/** USB_AHBERR4 : R/W1C; bitpos: [2]; default: 0;
 *  AHB Error
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_AHBERR4    (BIT(2))
#define USB_AHBERR4_M  (USB_AHBERR4_V << USB_AHBERR4_S)
#define USB_AHBERR4_V  0x00000001
#define USB_AHBERR4_S  2
/** USB_SETUP4 : R/W1C; bitpos: [3]; default: 0;
 *  SETUP Phase Done
 *  0x0 : No SETUP Phase Done
 *  0x1 : SETUP Phase Done
 */
#define USB_SETUP4    (BIT(3))
#define USB_SETUP4_M  (USB_SETUP4_V << USB_SETUP4_S)
#define USB_SETUP4_V  0x00000001
#define USB_SETUP4_S  3
/** USB_OUTTKNEPDIS4 : R/W1C; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled
 *  0x0 : No OUT Token Received When Endpoint Disabled
 *  0x1 : OUT Token Received When Endpoint Disabled
 */
#define USB_OUTTKNEPDIS4    (BIT(4))
#define USB_OUTTKNEPDIS4_M  (USB_OUTTKNEPDIS4_V << USB_OUTTKNEPDIS4_S)
#define USB_OUTTKNEPDIS4_V  0x00000001
#define USB_OUTTKNEPDIS4_S  4
/** USB_STSPHSERCVD4 : R/W1C; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write
 *  0x0 : No Status Phase Received for Control Write
 *  0x1 : Status Phase Received for Control Write
 */
#define USB_STSPHSERCVD4    (BIT(5))
#define USB_STSPHSERCVD4_M  (USB_STSPHSERCVD4_V << USB_STSPHSERCVD4_S)
#define USB_STSPHSERCVD4_V  0x00000001
#define USB_STSPHSERCVD4_S  5
/** USB_BACK2BACKSETUP4 : R/W1C; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received
 *  0x0 : No Back-to-Back SETUP Packets Received
 *  0x1 : Back-to-Back SETUP Packets Received
 */
#define USB_BACK2BACKSETUP4    (BIT(6))
#define USB_BACK2BACKSETUP4_M  (USB_BACK2BACKSETUP4_V << USB_BACK2BACKSETUP4_S)
#define USB_BACK2BACKSETUP4_V  0x00000001
#define USB_BACK2BACKSETUP4_S  6
/** USB_OUTPKTERR4 : R/W1C; bitpos: [8]; default: 0;
 *  OUT Packet Error
 *  0x0 : No OUT Packet Error
 *  0x1 : OUT Packet Error
 */
#define USB_OUTPKTERR4    (BIT(8))
#define USB_OUTPKTERR4_M  (USB_OUTPKTERR4_V << USB_OUTPKTERR4_S)
#define USB_OUTPKTERR4_V  0x00000001
#define USB_OUTPKTERR4_S  8
/** USB_BNAINTR4 : R/W1C; bitpos: [9]; default: 0;
 *  Buffer Not Available Interrupt
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_BNAINTR4    (BIT(9))
#define USB_BNAINTR4_M  (USB_BNAINTR4_V << USB_BNAINTR4_S)
#define USB_BNAINTR4_V  0x00000001
#define USB_BNAINTR4_S  9
/** USB_PKTDRPSTS4 : R/W1C; bitpos: [11]; default: 0;
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status interrupt
 */
#define USB_PKTDRPSTS4    (BIT(11))
#define USB_PKTDRPSTS4_M  (USB_PKTDRPSTS4_V << USB_PKTDRPSTS4_S)
#define USB_PKTDRPSTS4_V  0x00000001
#define USB_PKTDRPSTS4_S  11
/** USB_BBLEERR4 : R/W1C; bitpos: [12]; default: 0;
 *  0x0 : No BbleErr interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_BBLEERR4    (BIT(12))
#define USB_BBLEERR4_M  (USB_BBLEERR4_V << USB_BBLEERR4_S)
#define USB_BBLEERR4_V  0x00000001
#define USB_BBLEERR4_S  12
/** USB_NAKINTRPT4 : R/W1C; bitpos: [13]; default: 0;
 *  0x0 : No NAK interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_NAKINTRPT4    (BIT(13))
#define USB_NAKINTRPT4_M  (USB_NAKINTRPT4_V << USB_NAKINTRPT4_S)
#define USB_NAKINTRPT4_V  0x00000001
#define USB_NAKINTRPT4_S  13
/** USB_NYEPINTRPT4 : R/W1C; bitpos: [14]; default: 0;
 *  0x0 : No NYET interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_NYEPINTRPT4    (BIT(14))
#define USB_NYEPINTRPT4_M  (USB_NYEPINTRPT4_V << USB_NYEPINTRPT4_S)
#define USB_NYEPINTRPT4_V  0x00000001
#define USB_NYEPINTRPT4_S  14
/** USB_STUPPKTRCVD4 : R/W1C; bitpos: [15]; default: 0;
 *  0x0 : No Setup packet received
 *  0x1 : Setup packet received
 */
#define USB_STUPPKTRCVD4    (BIT(15))
#define USB_STUPPKTRCVD4_M  (USB_STUPPKTRCVD4_V << USB_STUPPKTRCVD4_S)
#define USB_STUPPKTRCVD4_V  0x00000001
#define USB_STUPPKTRCVD4_S  15


