espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_HCTSIZ7_REG register
 *  Host Channel 7Transfer Size Register
 */
#define USB_HCTSIZ7_REG (SOC_DPORT_USB_BASE + 0x5f0)
/** USB_H_XFERSIZE7 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE7    0x0007FFFF
#define USB_H_XFERSIZE7_M  (USB_H_XFERSIZE7_V << USB_H_XFERSIZE7_S)
#define USB_H_XFERSIZE7_V  0x0007FFFF
#define USB_H_XFERSIZE7_S  0
/** USB_H_PKTCNT7 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT7    0x000003FF
#define USB_H_PKTCNT7_M  (USB_H_PKTCNT7_V << USB_H_PKTCNT7_S)
#define USB_H_PKTCNT7_V  0x000003FF
#define USB_H_PKTCNT7_S  19
/** USB_H_PID7 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID7    0x00000003
#define USB_H_PID7_M  (USB_H_PID7_V << USB_H_PID7_S)
#define USB_H_PID7_V  0x00000003
#define USB_H_PID7_S  29
/** USB_H_DOPNG7 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG7    (BIT(31))
#define USB_H_DOPNG7_M  (USB_H_DOPNG7_V << USB_H_DOPNG7_S)
#define USB_H_DOPNG7_V  0x00000001
#define USB_H_DOPNG7_S  31




/** Status registers */
/** USB_GRXSTSR_REG register
 *  Receive Status Debug Read Register
 */
#define USB_GRXSTSR_REG (SOC_DPORT_USB_BASE + 0x1c)
/** USB_G_CHNUM : RO; bitpos: [4:0]; default: 0;
 *  Channel Number: Host only. Indicates the channel number to which the current
 *  received packet belongs.
 *  Endpoint Number: Device only Indicates the endpoint number to which the current
 *  received packet belongs
 */
#define USB_G_CHNUM    0x0000000F
#define USB_G_CHNUM_M  (USB_G_CHNUM_V << USB_G_CHNUM_S)
#define USB_G_CHNUM_V  0x0000000F
#define USB_G_CHNUM_S  0
/** USB_G_BCNT : RO; bitpos: [15:4]; default: 0;
 *  In host mode, indicates the byte count of the received IN data Packet
 *  In device mode, indicates the byte count of the received data packet
 */
#define USB_G_BCNT    0x000007FF
#define USB_G_BCNT_M  (USB_G_BCNT_V << USB_G_BCNT_S)
#define USB_G_BCNT_V  0x000007FF
#define USB_G_BCNT_S  4
/** USB_G_DPID : RO; bitpos: [17:15]; default: 0;
 *  Data PID
 *  0x0 (DATA0): DATA0
 *  0x2 (DATA1): DATA1
 *  0x1 (DATA2): DATA2
 *  0x3 (MDATA): MDATA
 */
#define USB_G_DPID    0x00000003
#define USB_G_DPID_M  (USB_G_DPID_V << USB_G_DPID_S)
#define USB_G_DPID_V  0x00000003
#define USB_G_DPID_S  15
/** USB_G_PKTSTS : RO; bitpos: [21:17]; default: 0;
 *  0x1 (OUTNAK): Global OUT NAK in device mode (triggers an Interrupt)
 *  0x2 (INOUTDPRX): IN data packet received in host mode and  OUT data received in
 *  device mode
 *  0x3 (INOUTTRCOM): IN or OUT transfer completed in both host  and device (triggers
 *  an interrupt)
 *  0x4 (DSETUPCOM): SETUP transaction completed in device mode (triggers an interrupt)
 *  0x5 (DTTOG): Data toggle error (triggers an interrupt) in host Mode
 *  0x6 (DSETUPRX): SETUP data packet received in device mode
 *  0x7 (CHHALT): Channel halted in host mode (triggers an  interrupt)
 */
#define USB_G_PKTSTS    0x0000000F
#define USB_G_PKTSTS_M  (USB_G_PKTSTS_V << USB_G_PKTSTS_S)
#define USB_G_PKTSTS_V  0x0000000F
#define USB_G_PKTSTS_S  17
/** USB_G_FN : RO; bitpos: [25:21]; default: 0;
 *  This is the least significant 4 bits of the (micro)Frame number in which the packet
 *  is received on the USB. This field is supported only when isochronous OUT endpoints
 *  are supported
 */
#define USB_G_FN    0x0000000F
#define USB_G_FN_M  (USB_G_FN_V << USB_G_FN_S)
#define USB_G_FN_V  0x0000000F
#define USB_G_FN_S  21


/** USB_GRXSTSP_REG register
 *  Receive Status Read/Pop Register
 */
#define USB_GRXSTSP_REG (SOC_DPORT_USB_BASE + 0x20)
/** USB_CHNUM : RO; bitpos: [4:0]; default: 0;
 *  Channel Number: Host only. Indicates the channel number to which the current
 *  received packet belongs.
 *  Endpoint Number: Device only Indicates the endpoint number to which the current
 *  received packet belongs
 */
#define USB_CHNUM    0x0000000F
#define USB_CHNUM_M  (USB_CHNUM_V << USB_CHNUM_S)
#define USB_CHNUM_V  0x0000000F
#define USB_CHNUM_S  0
/** USB_BCNT : RO; bitpos: [15:4]; default: 0;
 *  In host mode, indicates the byte count of the received IN data Packet
 *  In device mode, indicates the byte count of the received data packet
 */
#define USB_BCNT    0x000007FF
#define USB_BCNT_M  (USB_BCNT_V << USB_BCNT_S)
#define USB_BCNT_V  0x000007FF
#define USB_BCNT_S  4
/** USB_DPID : RO; bitpos: [17:15]; default: 0;
 *  Data PID
 *  0x0 (DATA0): DATA0
 *  0x2 (DATA1): DATA1
 *  0x1 (DATA2): DATA2
 *  0x3 (MDATA): MDATA
 */
#define USB_DPID    0x00000003
#define USB_DPID_M  (USB_DPID_V << USB_DPID_S)
#define USB_DPID_V  0x00000003
#define USB_DPID_S  15
/** USB_PKTSTS : RO; bitpos: [21:17]; default: 0;
 *  0x1 (OUTNAK): Global OUT NAK in device mode (triggers an Interrupt)
 *  0x2 (INOUTDPRX): IN data packet received in host mode and  OUT data packet received
 *  in device mode
 *  0x3 (INOUTTRCOM): IN or OUT transfer completed in both host  and device mode
 *  (triggers an interrupt)
 *  0x4 (DSETUPCOM): SETUP transaction completed in device mode (triggers an interrupt)
 *  0x5 (DTTOG): Data toggle error (triggers an interrupt) in host Mode
 *  0x6 (DSETUPRX): SETUP data packet received in device mode
 *  0x7 (CHHALT): Channel halted in host mode (triggers an  interrupt)
 */
#define USB_PKTSTS    0x0000000F
#define USB_PKTSTS_M  (USB_PKTSTS_V << USB_PKTSTS_S)
#define USB_PKTSTS_V  0x0000000F
#define USB_PKTSTS_S  17
/** USB_FN : RO; bitpos: [25:21]; default: 0;
 *  This is the least significant 4 bits of the (micro)Frame number in which the packet
 *  is received on the USB. This field is supported only when isochronous OUT endpoints
 *  are supported
 */
#define USB_FN    0x0000000F
#define USB_FN_M  (USB_FN_V << USB_FN_S)
#define USB_FN_V  0x0000000F
#define USB_FN_S  21


/** USB_GSNPSID_REG register
 *  ID Register
 */
#define USB_GSNPSID_REG (SOC_DPORT_USB_BASE + 0x40)
/** USB_SYNOPSYSID : RO; bitpos: [32:0]; default: 1330921482;
 *  ID register
 */
#define USB_SYNOPSYSID    0xFFFFFFFF
#define USB_SYNOPSYSID_M  (USB_SYNOPSYSID_V << USB_SYNOPSYSID_S)
#define USB_SYNOPSYSID_V  0xFFFFFFFF
#define USB_SYNOPSYSID_S  0


/** USB_GHWCFG1_REG register
 *  User Hardware Configuration 1 Register
 */
#define USB_GHWCFG1_REG (SOC_DPORT_USB_BASE + 0x44)
/** USB_EPDIR : RO; bitpos: [32:0]; default: 0;
 *  This 32-bit field uses two bits per endpoint to determine the endpoint direction.
 *  Bits [31:30]: Endpoint 15 direction
 *  Bits [29:28]: Endpoint 14 direction
 *  ...
 *  Direction:
 *  2'b00: BIDIR (IN and OUT) endpoint
 *  2'b01: IN endpoint
 *  2'b10: OUT endpoint
 *  2'b11: Reserved
 */
#define USB_EPDIR    0xFFFFFFFF
#define USB_EPDIR_M  (USB_EPDIR_V << USB_EPDIR_S)
#define USB_EPDIR_V  0xFFFFFFFF
#define USB_EPDIR_S  0


/** USB_GHWCFG2_REG register
 *  User Hardware Configuration 2 Register
 */
#define USB_GHWCFG2_REG (SOC_DPORT_USB_BASE + 0x48)
/** USB_OTGMODE : RO; bitpos: [3:0]; default: 0;
 *  3'b000: HNP- and SRP-Capable OTG (Host  Device)
 */
#define USB_OTGMODE    0x00000007
#define USB_OTGMODE_M  (USB_OTGMODE_V << USB_OTGMODE_S)
#define USB_OTGMODE_V  0x00000007
#define USB_OTGMODE_S  0
/** USB_OTGARCH : RO; bitpos: [5:3]; default: 2;
 *  2'b10: Internal DMA
 */
#define USB_OTGARCH    0x00000003
#define USB_OTGARCH_M  (USB_OTGARCH_V << USB_OTGARCH_S)
#define USB_OTGARCH_V  0x00000003
#define USB_OTGARCH_S  3
/** USB_SINGPNT : RO; bitpos: [5]; default: 1;
 *  Point-to-Point
 *  1'b1: Single-point application (no hub and split support).
 */
#define USB_SINGPNT    (BIT(5))
#define USB_SINGPNT_M  (USB_SINGPNT_V << USB_SINGPNT_S)
#define USB_SINGPNT_V  0x00000001
#define USB_SINGPNT_S  5
/** USB_HSPHYTYPE : RO; bitpos: [8:6]; default: 0;
 *  High-Speed PHY Interface Type
 *  2'b00: High-Speed interface not supported
 */
#define USB_HSPHYTYPE    0x00000003
#define USB_HSPHYTYPE_M  (USB_HSPHYTYPE_V << USB_HSPHYTYPE_S)
#define USB_HSPHYTYPE_V  0x00000003
#define USB_HSPHYTYPE_S  6
/** USB_FSPHYTYPE : RO; bitpos: [10:8]; default: 1;
 *  Full-Speed PHY Interface Type.
 */
#define USB_FSPHYTYPE    0x00000003
#define USB_FSPHYTYPE_M  (USB_FSPHYTYPE_V << USB_FSPHYTYPE_S)
#define USB_FSPHYTYPE_V  0x00000003
#define USB_FSPHYTYPE_S  8
/** USB_NUMDEVEPS : RO; bitpos: [14:10]; default: 6;
 *  Number of Device Endpoints.
 */
#define USB_NUMDEVEPS    0x0000000F
#define USB_NUMDEVEPS_M  (USB_NUMDEVEPS_V << USB_NUMDEVEPS_S)
#define USB_NUMDEVEPS_V  0x0000000F
#define USB_NUMDEVEPS_S  10
/** USB_NUMHSTCHNL : RO; bitpos: [18:14]; default: 7;
 *  Number of Host Channels.
 */
#define USB_NUMHSTCHNL    0x0000000F
#define USB_NUMHSTCHNL_M  (USB_NUMHSTCHNL_V << USB_NUMHSTCHNL_S)
#define USB_NUMHSTCHNL_V  0x0000000F
#define USB_NUMHSTCHNL_S  14
/** USB_PERIOSUPPORT : RO; bitpos: [18]; default: 1;
 *  1'b0:Periodic OUT Channels is not Supported in Host Mode
 *  1'b1:Periodic OUT Channels Supported in Host Mode
 */
#define USB_PERIOSUPPORT    (BIT(18))
#define USB_PERIOSUPPORT_M  (USB_PERIOSUPPORT_V << USB_PERIOSUPPORT_S)
#define USB_PERIOSUPPORT_V  0x00000001
#define USB_PERIOSUPPORT_S  18
/** USB_DYNFIFOSIZING : RO; bitpos: [19]; default: 1;
 *  1'b0:Dynamic FIFO Sizing Disabled
 *  1'b1:Dynamic FIFO Sizing Enabled
 */
#define USB_DYNFIFOSIZING    (BIT(19))
#define USB_DYNFIFOSIZING_M  (USB_DYNFIFOSIZING_V << USB_DYNFIFOSIZING_S)
#define USB_DYNFIFOSIZING_V  0x00000001
#define USB_DYNFIFOSIZING_S  19
/** USB_MULTIPROCINTRPT : RO; bitpos: [20]; default: 0;
 *  1'b0: No Multi Processor Interrupt Enabled
 *  1'b1:Multi Processor Interrupt Enabled
 */
#define USB_MULTIPROCINTRPT    (BIT(20))
#define USB_MULTIPROCINTRPT_M  (USB_MULTIPROCINTRPT_V << USB_MULTIPROCINTRPT_S)
#define USB_MULTIPROCINTRPT_V  0x00000001
#define USB_MULTIPROCINTRPT_S  20
/** USB_NPTXQDEPTH : RO; bitpos: [24:22]; default: 1;
 *  Non-periodic Request Queue Depth
 *  2'b01: 4
 */
#define USB_NPTXQDEPTH    0x00000003
#define USB_NPTXQDEPTH_M  (USB_NPTXQDEPTH_V << USB_NPTXQDEPTH_S)
#define USB_NPTXQDEPTH_V  0x00000003
#define USB_NPTXQDEPTH_S  22
/** USB_PTXQDEPTH : RO; bitpos: [26:24]; default: 2;
 *  Host Mode Periodic Request Queue Depth.
 *  2'b10: 8
 */
#define USB_PTXQDEPTH    0x00000003
#define USB_PTXQDEPTH_M  (USB_PTXQDEPTH_V << USB_PTXQDEPTH_S)
#define USB_PTXQDEPTH_V  0x00000003
#define USB_PTXQDEPTH_S  24
/** USB_TKNQDEPTH : RO; bitpos: [31:26]; default: 8;
 *  Device Mode IN Token Sequence Learning Queue Depth.
 */
#define USB_TKNQDEPTH    0x0000001F
#define USB_TKNQDEPTH_M  (USB_TKNQDEPTH_V << USB_TKNQDEPTH_S)
#define USB_TKNQDEPTH_V  0x0000001F
#define USB_TKNQDEPTH_S  26
/** USB_OTG_ENABLE_IC_USB : RO; bitpos: [31]; default: 0;
 *  0x0 (DISABLE): Disabled the IC_USB Full-Speed Serial Transceiver interface
 *  0x1 (ENABLE): Enabled the IC_USB Full-Speed Serial Transceiver interface
 */
#define USB_OTG_ENABLE_IC_USB    (BIT(31))
#define USB_OTG_ENABLE_IC_USB_M  (USB_OTG_ENABLE_IC_USB_V << USB_OTG_ENABLE_IC_USB_S)
#define USB_OTG_ENABLE_IC_USB_V  0x00000001
#define USB_OTG_ENABLE_IC_USB_S  31


