espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_GHWCFG3_REG register
 *  User Hardware Configuration 3 Register
 */
#define USB_GHWCFG3_REG (SOC_DPORT_USB_BASE + 0x4c)
/** USB_XFERSIZEWIDTH : RO; bitpos: [4:0]; default: 5;
 *  Width of Transfer Size Counters
 *  0x5 (WIDTH16): Width of Transfer Size Counter 16 bits
 */
#define USB_XFERSIZEWIDTH    0x0000000F
#define USB_XFERSIZEWIDTH_M  (USB_XFERSIZEWIDTH_V << USB_XFERSIZEWIDTH_S)
#define USB_XFERSIZEWIDTH_V  0x0000000F
#define USB_XFERSIZEWIDTH_S  0
/** USB_PKTSIZEWIDTH : RO; bitpos: [7:4]; default: 3;
 *  Width of Packet Size Counters
 *  3'b011: 7 bits
 */
#define USB_PKTSIZEWIDTH    0x00000007
#define USB_PKTSIZEWIDTH_M  (USB_PKTSIZEWIDTH_V << USB_PKTSIZEWIDTH_S)
#define USB_PKTSIZEWIDTH_V  0x00000007
#define USB_PKTSIZEWIDTH_S  4
/** USB_OTGEN : RO; bitpos: [7]; default: 1;
 *  OTG Function Enabled.
 */
#define USB_OTGEN    (BIT(7))
#define USB_OTGEN_M  (USB_OTGEN_V << USB_OTGEN_S)
#define USB_OTGEN_V  0x00000001
#define USB_OTGEN_S  7
/** USB_I2CINTSEL : RO; bitpos: [8]; default: 0;
 *  1'b0: I2C Interface is not available on the controller.
 */
#define USB_I2CINTSEL    (BIT(8))
#define USB_I2CINTSEL_M  (USB_I2CINTSEL_V << USB_I2CINTSEL_S)
#define USB_I2CINTSEL_V  0x00000001
#define USB_I2CINTSEL_S  8
/** USB_VNDCTLSUPT : RO; bitpos: [9]; default: 0;
 *  Vendor Control Interface is not available .
 */
#define USB_VNDCTLSUPT    (BIT(9))
#define USB_VNDCTLSUPT_M  (USB_VNDCTLSUPT_V << USB_VNDCTLSUPT_S)
#define USB_VNDCTLSUPT_V  0x00000001
#define USB_VNDCTLSUPT_S  9
/** USB_OPTFEATURE : RO; bitpos: [10]; default: 1;
 *  Optional Features have been Removed.
 */
#define USB_OPTFEATURE    (BIT(10))
#define USB_OPTFEATURE_M  (USB_OPTFEATURE_V << USB_OPTFEATURE_S)
#define USB_OPTFEATURE_V  0x00000001
#define USB_OPTFEATURE_S  10
/** USB_RSTTYPE : RO; bitpos: [11]; default: 0;
 *  Asynchronous reset is used in the core
 */
#define USB_RSTTYPE    (BIT(11))
#define USB_RSTTYPE_M  (USB_RSTTYPE_V << USB_RSTTYPE_S)
#define USB_RSTTYPE_V  0x00000001
#define USB_RSTTYPE_S  11
/** USB_ADPSUPPORT : RO; bitpos: [12]; default: 0;
 *  ADP logic is not present along with the controller.
 */
#define USB_ADPSUPPORT    (BIT(12))
#define USB_ADPSUPPORT_M  (USB_ADPSUPPORT_V << USB_ADPSUPPORT_S)
#define USB_ADPSUPPORT_V  0x00000001
#define USB_ADPSUPPORT_S  12
/** USB_HSICMODE : RO; bitpos: [13]; default: 0;
 *  HSIC mode specified for Mode of Operation.
 *  1'b0: Non-HSIC-capable
 */
#define USB_HSICMODE    (BIT(13))
#define USB_HSICMODE_M  (USB_HSICMODE_V << USB_HSICMODE_S)
#define USB_HSICMODE_V  0x00000001
#define USB_HSICMODE_S  13
/** USB_BCSUPPORT : RO; bitpos: [14]; default: 0;
 *  1'b0: No Battery Charger Support
 */
#define USB_BCSUPPORT    (BIT(14))
#define USB_BCSUPPORT_M  (USB_BCSUPPORT_V << USB_BCSUPPORT_S)
#define USB_BCSUPPORT_V  0x00000001
#define USB_BCSUPPORT_S  14
/** USB_LPMMODE : RO; bitpos: [15]; default: 0;
 *  LPM mode specified for Mode of Operation.
 */
#define USB_LPMMODE    (BIT(15))
#define USB_LPMMODE_M  (USB_LPMMODE_V << USB_LPMMODE_S)
#define USB_LPMMODE_V  0x00000001
#define USB_LPMMODE_S  15
/** USB_DFIFODEPTH : RO; bitpos: [32:16]; default: 256;
 *  DFIFO Depth.This value is in terms of 32-bit words.
 */
#define USB_DFIFODEPTH    0x0000FFFF
#define USB_DFIFODEPTH_M  (USB_DFIFODEPTH_V << USB_DFIFODEPTH_S)
#define USB_DFIFODEPTH_V  0x0000FFFF
#define USB_DFIFODEPTH_S  16


/** USB_GHWCFG4_REG register
 *  User Hardware Configuration 4 Register
 */
#define USB_GHWCFG4_REG (SOC_DPORT_USB_BASE + 0x50)
/** USB_G_NUMDEVPERIOEPS : RO; bitpos: [4:0]; default: 0;
 *  Number of Device Mode Periodic IN Endpoints.
 */
#define USB_G_NUMDEVPERIOEPS    0x0000000F
#define USB_G_NUMDEVPERIOEPS_M  (USB_G_NUMDEVPERIOEPS_V << USB_G_NUMDEVPERIOEPS_S)
#define USB_G_NUMDEVPERIOEPS_V  0x0000000F
#define USB_G_NUMDEVPERIOEPS_S  0
/** USB_G_PARTIALPWRDN : RO; bitpos: [4]; default: 1;
 *  Enable Partial Power Down.
 */
#define USB_G_PARTIALPWRDN    (BIT(4))
#define USB_G_PARTIALPWRDN_M  (USB_G_PARTIALPWRDN_V << USB_G_PARTIALPWRDN_S)
#define USB_G_PARTIALPWRDN_V  0x00000001
#define USB_G_PARTIALPWRDN_S  4
/** USB_G_AHBFREQ : RO; bitpos: [5]; default: 1;
 *  Minimum AHB Frequency Less Than 60 MHz
 */
#define USB_G_AHBFREQ    (BIT(5))
#define USB_G_AHBFREQ_M  (USB_G_AHBFREQ_V << USB_G_AHBFREQ_S)
#define USB_G_AHBFREQ_V  0x00000001
#define USB_G_AHBFREQ_S  5
/** USB_G_HIBERNATION : RO; bitpos: [6]; default: 0;
 *  1'b0: Hibernation feature not enabled.
 */
#define USB_G_HIBERNATION    (BIT(6))
#define USB_G_HIBERNATION_M  (USB_G_HIBERNATION_V << USB_G_HIBERNATION_S)
#define USB_G_HIBERNATION_V  0x00000001
#define USB_G_HIBERNATION_S  6
/** USB_G_EXTENDEDHIBERNATION : RO; bitpos: [7]; default: 0;
 *  Extended Hibernation feature not enabled
 */
#define USB_G_EXTENDEDHIBERNATION    (BIT(7))
#define USB_G_EXTENDEDHIBERNATION_M  (USB_G_EXTENDEDHIBERNATION_V << USB_G_EXTENDEDHIBERNATION_S)
#define USB_G_EXTENDEDHIBERNATION_V  0x00000001
#define USB_G_EXTENDEDHIBERNATION_S  7
/** USB_G_ACGSUPT : RO; bitpos: [12]; default: 0;
 *  Active Clock Gating is not enabled.
 */
#define USB_G_ACGSUPT    (BIT(12))
#define USB_G_ACGSUPT_M  (USB_G_ACGSUPT_V << USB_G_ACGSUPT_S)
#define USB_G_ACGSUPT_V  0x00000001
#define USB_G_ACGSUPT_S  12
/** USB_G_ENHANCEDLPMSUPT : RO; bitpos: [13]; default: 1;
 *  Enhanced LPM Support.
 */
#define USB_G_ENHANCEDLPMSUPT    (BIT(13))
#define USB_G_ENHANCEDLPMSUPT_M  (USB_G_ENHANCEDLPMSUPT_V << USB_G_ENHANCEDLPMSUPT_S)
#define USB_G_ENHANCEDLPMSUPT_V  0x00000001
#define USB_G_ENHANCEDLPMSUPT_S  13
/** USB_G_PHYDATAWIDTH : RO; bitpos: [16:14]; default: 2;
 *  UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width (PhyDataWidth) When a ULPI PHY
 *  is used, an internal wrapper converts ULPI to UTMI+
 *  2'b10: 8/16 bits, software selectable
 */
#define USB_G_PHYDATAWIDTH    0x00000003
#define USB_G_PHYDATAWIDTH_M  (USB_G_PHYDATAWIDTH_V << USB_G_PHYDATAWIDTH_S)
#define USB_G_PHYDATAWIDTH_V  0x00000003
#define USB_G_PHYDATAWIDTH_S  14
/** USB_G_NUMCTLEPS : RO; bitpos: [20:16]; default: 0;
 *  Number of Device Mode Control Endpoints in Addition to Endpoint 0
 */
#define USB_G_NUMCTLEPS    0x0000000F
#define USB_G_NUMCTLEPS_M  (USB_G_NUMCTLEPS_V << USB_G_NUMCTLEPS_S)
#define USB_G_NUMCTLEPS_V  0x0000000F
#define USB_G_NUMCTLEPS_S  16
/** USB_G_IDDQFLTR : RO; bitpos: [20]; default: 1;
 *  IDDIG Filter Enable.
 */
#define USB_G_IDDQFLTR    (BIT(20))
#define USB_G_IDDQFLTR_M  (USB_G_IDDQFLTR_V << USB_G_IDDQFLTR_S)
#define USB_G_IDDQFLTR_V  0x00000001
#define USB_G_IDDQFLTR_S  20
/** USB_G_VBUSVALIDFLTR : RO; bitpos: [21]; default: 1;
 *  VBUS Valid Filter Enabled.
 */
#define USB_G_VBUSVALIDFLTR    (BIT(21))
#define USB_G_VBUSVALIDFLTR_M  (USB_G_VBUSVALIDFLTR_V << USB_G_VBUSVALIDFLTR_S)
#define USB_G_VBUSVALIDFLTR_V  0x00000001
#define USB_G_VBUSVALIDFLTR_S  21
/** USB_G_AVALIDFLTR : RO; bitpos: [22]; default: 1;
 *  a_valid Filter Enabled.
 */
#define USB_G_AVALIDFLTR    (BIT(22))
#define USB_G_AVALIDFLTR_M  (USB_G_AVALIDFLTR_V << USB_G_AVALIDFLTR_S)
#define USB_G_AVALIDFLTR_V  0x00000001
#define USB_G_AVALIDFLTR_S  22
/** USB_G_BVALIDFLTR : RO; bitpos: [23]; default: 1;
 *  b_valid Filter Enabled.
 */
#define USB_G_BVALIDFLTR    (BIT(23))
#define USB_G_BVALIDFLTR_M  (USB_G_BVALIDFLTR_V << USB_G_BVALIDFLTR_S)
#define USB_G_BVALIDFLTR_V  0x00000001
#define USB_G_BVALIDFLTR_S  23
/** USB_G_SESSENDFLTR : RO; bitpos: [24]; default: 1;
 *  session_end Filter Enabled.
 */
#define USB_G_SESSENDFLTR    (BIT(24))
#define USB_G_SESSENDFLTR_M  (USB_G_SESSENDFLTR_V << USB_G_SESSENDFLTR_S)
#define USB_G_SESSENDFLTR_V  0x00000001
#define USB_G_SESSENDFLTR_S  24
/** USB_G_DEDFIFOMODE : RO; bitpos: [25]; default: 1;
 *  Enable Dedicated Transmit FIFO for device IN Endpoints
 */
#define USB_G_DEDFIFOMODE    (BIT(25))
#define USB_G_DEDFIFOMODE_M  (USB_G_DEDFIFOMODE_V << USB_G_DEDFIFOMODE_S)
#define USB_G_DEDFIFOMODE_V  0x00000001
#define USB_G_DEDFIFOMODE_S  25
/** USB_G_INEPS : RO; bitpos: [30:26]; default: 4;
 *  Number of Device Mode IN Endpoints Including Control Endpoints.
 */
#define USB_G_INEPS    0x0000000F
#define USB_G_INEPS_M  (USB_G_INEPS_V << USB_G_INEPS_S)
#define USB_G_INEPS_V  0x0000000F
#define USB_G_INEPS_S  26
/** USB_G_DESCDMAENABLED : RO; bitpos: [30]; default: 1;
 *  0x1: Scatter/Gather DMA configuration.
 */
#define USB_G_DESCDMAENABLED    (BIT(30))
#define USB_G_DESCDMAENABLED_M  (USB_G_DESCDMAENABLED_V << USB_G_DESCDMAENABLED_S)
#define USB_G_DESCDMAENABLED_V  0x00000001
#define USB_G_DESCDMAENABLED_S  30
/** USB_G_DESCDMA : RO; bitpos: [31]; default: 1;
 *  Scatter/Gather DMA configuration
 *  1'b1: Dynamic configuration
 */
#define USB_G_DESCDMA    (BIT(31))
#define USB_G_DESCDMA_M  (USB_G_DESCDMA_V << USB_G_DESCDMA_S)
#define USB_G_DESCDMA_V  0x00000001
#define USB_G_DESCDMA_S  31


/** USB_HFNUM_REG register
 *  Frame Number configure Resigster
 */
#define USB_HFNUM_REG (SOC_DPORT_USB_BASE + 0x408)
/** USB_FRNUM : RO; bitpos: [14:0]; default: 16383;
 *  Frame Number
 *  0x0 (INACTIVE): No SOF is transmitted
 *  0x1 (ACTIVE): SOF is transmitted
 */
#define USB_FRNUM    0x00003FFF
#define USB_FRNUM_M  (USB_FRNUM_V << USB_FRNUM_S)
#define USB_FRNUM_V  0x00003FFF
#define USB_FRNUM_S  0
/** USB_FRREM : RO; bitpos: [32:16]; default: 0;
 *  Frame Time Remaining.ndicates the amount of time remaining in the current
 *  microframe
 *  (HS) or Frame (FS/LS), in terms of PHY clocks.
 */
#define USB_FRREM    0x0000FFFF
#define USB_FRREM_M  (USB_FRREM_V << USB_FRREM_S)
#define USB_FRREM_V  0x0000FFFF
#define USB_FRREM_S  16


