espressif/esp-idf/components/soc/esp32s3/register/soc/usb_reg.h
/** USB_HPTXSTS_REG register
 *  Host Periodic Transmit FIFO/Queue Status Register
 */
#define USB_HPTXSTS_REG (SOC_DPORT_USB_BASE + 0x410)
/** USB_PTXFSPCAVAIL : RO; bitpos: [16:0]; default: 256;
 *  Periodic Transmit Data FIFO Space Available. Values are in terms of 32-bit words.
 */
#define USB_PTXFSPCAVAIL    0x0000FFFF
#define USB_PTXFSPCAVAIL_M  (USB_PTXFSPCAVAIL_V << USB_PTXFSPCAVAIL_S)
#define USB_PTXFSPCAVAIL_V  0x0000FFFF
#define USB_PTXFSPCAVAIL_S  0
/** USB_PTXQSPCAVAIL : RO; bitpos: [21:16]; default: 8;
 *  Periodic Transmit Request Queue Space Available.
 */
#define USB_PTXQSPCAVAIL    0x0000001F
#define USB_PTXQSPCAVAIL_M  (USB_PTXQSPCAVAIL_V << USB_PTXQSPCAVAIL_S)
#define USB_PTXQSPCAVAIL_V  0x0000001F
#define USB_PTXQSPCAVAIL_S  16
/** USB_PTXQTOP : RO; bitpos: [32:24]; default: 0;
 *  Bit [31]: Odd/Even (micro)Frame. 1'b0: send in even (micro)Frame
 *  Bits [30:27]: Channel/endpoint number
 *  Bits [26:25]: Type. 2'b00: IN/OUT.   2'b01: Zero-length packet.     2'b10: CSPLIT
 *    2'b11: Disable channel command
 *  Bit [24]: Terminate
 */
#define USB_PTXQTOP    0x000000FF
#define USB_PTXQTOP_M  (USB_PTXQTOP_V << USB_PTXQTOP_S)
#define USB_PTXQTOP_V  0x000000FF
#define USB_PTXQTOP_S  24


/** USB_HCDMAB$n_REG register
 *  Host Channel $n DMA Buffer Address Register
 */
#define USB_HCDMAB$N_REG (SOC_DPORT_USB_BASE + 0x51c)
/** USB_H_HCDMAB0 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB0    0xFFFFFFFF
#define USB_H_HCDMAB0_M  (USB_H_HCDMAB0_V << USB_H_HCDMAB0_S)
#define USB_H_HCDMAB0_V  0xFFFFFFFF
#define USB_H_HCDMAB0_S  0


/** USB_HCDMAB1_REG register
 *  Host Channel 1 DMA Buffer Address Register
 */
#define USB_HCDMAB1_REG (SOC_DPORT_USB_BASE + 0x53c)
/** USB_H_HCDMAB1 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB1    0xFFFFFFFF
#define USB_H_HCDMAB1_M  (USB_H_HCDMAB1_V << USB_H_HCDMAB1_S)
#define USB_H_HCDMAB1_V  0xFFFFFFFF
#define USB_H_HCDMAB1_S  0


/** USB_HCDMAB2_REG register
 *  Host Channel 2 DMA Buffer Address Register
 */
#define USB_HCDMAB2_REG (SOC_DPORT_USB_BASE + 0x55c)
/** USB_H_HCDMAB2 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB2    0xFFFFFFFF
#define USB_H_HCDMAB2_M  (USB_H_HCDMAB2_V << USB_H_HCDMAB2_S)
#define USB_H_HCDMAB2_V  0xFFFFFFFF
#define USB_H_HCDMAB2_S  0


/** USB_HCDMAB3_REG register
 *  Host Channel 3 DMA Buffer Address Register
 */
#define USB_HCDMAB3_REG (SOC_DPORT_USB_BASE + 0x57c)
/** USB_H_HCDMAB3 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB3    0xFFFFFFFF
#define USB_H_HCDMAB3_M  (USB_H_HCDMAB3_V << USB_H_HCDMAB3_S)
#define USB_H_HCDMAB3_V  0xFFFFFFFF
#define USB_H_HCDMAB3_S  0


/** USB_HCDMAB4_REG register
 *  Host Channel 4 DMA Buffer Address Register
 */
#define USB_HCDMAB4_REG (SOC_DPORT_USB_BASE + 0x59c)
/** USB_H_HCDMAB4 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB4    0xFFFFFFFF
#define USB_H_HCDMAB4_M  (USB_H_HCDMAB4_V << USB_H_HCDMAB4_S)
#define USB_H_HCDMAB4_V  0xFFFFFFFF
#define USB_H_HCDMAB4_S  0


/** USB_HCDMAB5_REG register
 *  Host Channel 5 DMA Buffer Address Register
 */
#define USB_HCDMAB5_REG (SOC_DPORT_USB_BASE + 0x5bc)
/** USB_H_HCDMAB5 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB5    0xFFFFFFFF
#define USB_H_HCDMAB5_M  (USB_H_HCDMAB5_V << USB_H_HCDMAB5_S)
#define USB_H_HCDMAB5_V  0xFFFFFFFF
#define USB_H_HCDMAB5_S  0


/** USB_HCDMAB6_REG register
 *  Host Channel 6 DMA Buffer Address Register
 */
#define USB_HCDMAB6_REG (SOC_DPORT_USB_BASE + 0x5dc)
/** USB_H_HCDMAB6 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB6    0xFFFFFFFF
#define USB_H_HCDMAB6_M  (USB_H_HCDMAB6_V << USB_H_HCDMAB6_S)
#define USB_H_HCDMAB6_V  0xFFFFFFFF
#define USB_H_HCDMAB6_S  0


/** USB_HCDMAB7_REG register
 *  Host Channel 7 DMA Buffer Address Register
 */
#define USB_HCDMAB7_REG (SOC_DPORT_USB_BASE + 0x5fc)
/** USB_H_HCDMAB7 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address
 */
#define USB_H_HCDMAB7    0xFFFFFFFF
#define USB_H_HCDMAB7_M  (USB_H_HCDMAB7_V << USB_H_HCDMAB7_S)
#define USB_H_HCDMAB7_V  0xFFFFFFFF
#define USB_H_HCDMAB7_S  0


/** USB_DSTS_REG register
 *  Device Status Register
 */
#define USB_DSTS_REG (SOC_DPORT_USB_BASE + 0x808)
/** USB_SUSPSTS : RO; bitpos: [0]; default: 0;
 *  Suspend Status
 *  0x0 : No suspend state
 *  0x1 : Suspend state
 */
#define USB_SUSPSTS    (BIT(0))
#define USB_SUSPSTS_M  (USB_SUSPSTS_V << USB_SUSPSTS_S)
#define USB_SUSPSTS_V  0x00000001
#define USB_SUSPSTS_S  0
/** USB_ENUMSPD : RO; bitpos: [3:1]; default: 1;
 *  0x0 : High speed (PHY clock is running at 30 or 60 MHz)
 *  0x1 : Full speed (PHY clock is running at 30 or 60 MHz)
 *  0x2 : Low speed (PHY clock is running at 6 MHz)
 *  0x3 : Full speed (PHY clock is running at 48 MHz)
 */
#define USB_ENUMSPD    0x00000003
#define USB_ENUMSPD_M  (USB_ENUMSPD_V << USB_ENUMSPD_S)
#define USB_ENUMSPD_V  0x00000003
#define USB_ENUMSPD_S  1
/** USB_ERRTICERR : RO; bitpos: [3]; default: 0;
 *  0x0 : No Erratic Error
 *  0x1 : Erratic Error
 */
#define USB_ERRTICERR    (BIT(3))
#define USB_ERRTICERR_M  (USB_ERRTICERR_V << USB_ERRTICERR_S)
#define USB_ERRTICERR_V  0x00000001
#define USB_ERRTICERR_S  3
/** USB_SOFFN : RO; bitpos: [22:8]; default: 0;
 *  Frame or Microframe Number of the Received SOF (SOFFN).  This field contains a
 *  Frame number.
 */
#define USB_SOFFN    0x00003FFF
#define USB_SOFFN_M  (USB_SOFFN_V << USB_SOFFN_S)
#define USB_SOFFN_V  0x00003FFF
#define USB_SOFFN_S  8
/** USB_DEVLNSTS : RO; bitpos: [24:22]; default: 0;
 *  Device Line Status
 *  DevLnSts[1]: Logic level of D+
 *  DevLnSts[0]: Logic level of D-
 */
#define USB_DEVLNSTS    0x00000003
#define USB_DEVLNSTS_M  (USB_DEVLNSTS_V << USB_DEVLNSTS_S)
#define USB_DEVLNSTS_V  0x00000003
#define USB_DEVLNSTS_S  22


